Repository: Artogn/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/blog.po
Languages: ru

source: Implement local storage of messages
ru: Реализовано локальное хранилище сообщений

source: Add offline mode
ru: Добавлен автономный режим

source: Messages now deleted on server after download
ru: Теперь после скачивания сообщения удаляются на сервере

source: Several backend POP3 and SMTP speedups and fixes
ru: Несколько исправлений и ускорений POP3 и SMTP в серверной части

source: NetDB lookup fixes
ru: Исправления в поиске в сетевой БД

source: Fix transition from not-firewalled to firewalled
ru: Исправлен переход состояния от незаблокированного к заблокированному межсетевым экраном

source: Fix plugin uninstall on Windows
ru: Исправлено удаление плагина в Windows

source: SSU locking fixes
ru: Исправления блокировки SSU

source: Fix rapid republishing of SSU addresses
ru: Исправление быстрого повторного публикования адресов SSU

source: IRC client exception fixes
ru: Исправления исключений в IRC клиенте

source: Fix changing HTTP outproxy configuration without restarting tunnel
ru: Исправлено изменение настроек внешних HTTP-прокси без перезагрузки туннелей

source: New i2ptunnel server option for unique local address per-client
ru: Новый серверный параметр в i2ptunnel для уникального локального адреса каждого клиента

source: Warn in i2ptunnel on duplicate client ports
ru: Предупреждение в i2ptunnel при дублировании клиентских портов

source: Update HTTP User-Agent to match TBB
ru: Обновлен HTTP User-Agent в соответствии с TBB

source: Extend SSU establishment retransmission timer
ru: Увеличен таймер ретрансляции SSU

source: Use constant-time method for HMAC verification
ru: Использование метода с постоянной сложностью для верификации HMAC

source: New translation: Slovak
ru: Новый перевод: словацкий язык

source: ============== 0.9.14 Release ==============
ru: ============= Версия 0.9.14 =============

source: 0.9.14 includes critical security fixes
ru: Версия 0.9.14 содержит критические обновления безопасности

source: 0.9.14 includes critical fixes for XSS and remote execution vulnerabilities reported by Exodus Intelligence. As an added precaution, we have disabled several advanced configuration features in the router console, including installation of new plugins. We plan to re-enable these in a future release after additional review.
ru: В версию 0.9.14 включены критические исправления уязвимостей XSS и удаленного выполнения, о которых сообщили Exodus Intelligence. В качестве дополнительных мер предосторожносты мы отключили несколько расширенных настроек в консоли маршрутизатора, в том числе установку новых плагинов. Мы планируем снова включить эти возможности в будущей версии после дополнительной проверки.

source: Due to I2P library changes, I2P-Bote users must upgrade their plugin to version 0.2.10 to work with I2P 0.9.14. Your router should update the plugin automatically after the router restarts.
ru: В связи с изменениями в библиотеке I2P пользователям I2PBote необходимо обновить плагин до версии 0.2.10 для работы с I2P 0.9.14. Ваш маршрутизатор должен обновить плагин автоматически после перезагрузки.

source: The release also contains several bug fixes in i2ptunnel, i2psnark, and other areas, and updates to the latest Jetty, Tomcat, and Wrapper. We've also implemented a faster and more secure method for reseeding. Of course, there's also the usual collection of minor bug fixes and translation updates.
ru: Релиз также содержит несколько исправлений в i2ptunnel, i2psnark и др., а также обновления до последней версии Jetty, Tomcat, Wrapper. Мы также реализовали более быстрый и безопасный метод для начальной загрузки. Конечно, также присутствует обычный набор небольших исправлений ошибок и обновлений переводов.

source: You must update to this release immediately. The best way to maintain security and help the network is to run the latest release.
ru: Вам необходимо немедленно обновиться до этой версии. Лучший способ оставаться в безопасности и помогать сети — использовать последнюю версию.

source: Security Fixes
ru: Исправления безопасности

source: Fix several XSS issues
ru: Исправлены несколько XSS

source: Disable changing news feed URL from UI
ru: Отключено изменение URL ленты новостей из пользовательского интерфейса

source: Disable plugin install
ru: Отключена установка плагинов

source: Disable setting unsigned update URL from UI
ru: Отключена установка неподписанного адреса обновлений из интерфейса пользователя

source: Disable clients.config editing from the UI
ru: Отключить редактирование clients.config из пользовательского интерфейса

source: Add Content-Security-Policy and X-XSS-Protection headers
ru: Добалена политика безопасности контента и заголовки X-XSS-Protection

source: Disable unused ExecNamingService (thx joernchen of Phenoelit)
ru: Отключен неиспользуемый ExecNamingService (спасибо joernchen из Phenoelit)

source: Fix tunnel building so it doesn't get "stuck" on a single pool
ru: Исправление в создании туннелей - теперь они не закреплены в едином пуле

source: Reject participating tunnels when hidden
ru: Отклонять транзитные туннели в скрытом режиме

source: Several i2psnark improvements and fixes (GUI and DHT), including changes for better compatibility with Vuze
ru: Несколько улучшений и исправлений в i2psnark (интерфейс и DHT), включая изменения для лучшей совместимости с Vuze

source: Reseeding now fetches a signed zip file containing router infos for security and speed
ru: При начальной загрузке для обеспечения безопасности и увеличения скорости теперь принимается подписаный zip-файл, содержащий информацию о маршрутизаторах

source: Use JVM's AES implementation if it is faster
ru: Использовать реализацию AES на JVM, если это быстрее

source: More advanced options shown in the i2ptunnel edit pages
ru: Добавлено больше дополнительных настроек на странице i2ptunnel/edit

source: Per-message reliabilitiy settings in I2CP and error propagation back from router to client
ru: Установки и ошибки надёжности i2CP на уровне сообщений доводятся маршрутизатором до клиента

source: Lots of findbugs fixes and cleanups
ru: Код "почищен" и исправлены ошибки, найденные с помощью findbugs

source: Support signature types in SAM, bump rev to 3.1
ru: Поддержка параметра SIGNATURE_TYPE в SAM, номер версии увеличен до 3.1

source: New event log page in console
ru: Новая страница журнала событий в консоли

source: Wrapper 3.5.25 (new installs and PPA only)
ru: Wrapper 3.5.25 (только новые установки и PPA)

source: ================ 0.9.14.1 Release ================
ru: ================ Версия 0.9.14.1 ================

source: 0.9.14.1 includes i2psnark and console fixes
ru: 0.9.14.1 содержит исправления в i2psnark и консоли

source: 0.9.14.1 includes fixes for the "Add Torrent" form in i2psnark and some other web forms. We've restored the ability to install plugins via the console, but you must first edit your router.config file (in ~/.i2p/ or /var/lib/i2p/i2p-config/ or %APPDATA%\I2P\) to add the line routerconsole.enablePluginInstall=true. Other rarely-used advanced features that were removed in 0.9.14 may be restored by adding the line routerconsole.advanced=true.
ru: 0.9.14.1 включает в себя исправление ошибки формы добавления торрента в i2psnark и некоторых других web-формах. Мы вернули возможность установки плагинов через консоль управления, для этого необходимо отредактировать router.config (in ~/.i2p/ or /var/lib/i2p/i2p-config/ or %APPDATA%\I2P\), добавив туда строку routerconsole.enablePluginInstall=true Некоторые другие редко используемые фичи, убранные в 0.9.14, могут быть восстановлены путём добавления в router.config строки routerconsole.advanced=true.

source: As usual, if configured with the default "Download and Verify", the router will automatically download the update and display a button to restart. However, due to a bug in 0.9.14, if your update is configured for "Notify only", the download button will not be displayed. You must change your configuration to "Download and Verify" or "Download, Verify, and Restart" to update.
ru: Как и ожидается, если обновление маршрутизатора сконфигурирован по умолчанию - "Download and Verify", будет скачано обновление и показана кнопка для установки и перезагрузки. Из-за ошибки в 0.9.14, если установлено значение "Notify only", кнопка для скачивания обновления не будет показана. Для успешного обновления необходимо изменить конфигурацию на значения "Download and Verify" либо "Download, Verify, and Restart".

source: If you are still running 0.9.13 or older, we recommend that you update to this release as soon as possible. If you don't often check your router console, please consider changing your configuration to "Download, Verify, and Restart" to ensure you are always running the latest release.
ru: Если вы всё ещё пользуетесь версией 0.9.13 или более старой, мы рекомендуем обновиться до последней версии как можно скорее. Если вы нерегулярно проверяете консоль маршрутизатора, пожалуйста, рассмотрите возможность изменения настроек на "скачать, проверить и обновить", чтобы всегда использовать последнюю версию.

source: Fix i2psnark add torrent form
ru: Исправлена форма добавления торрента в i2psnark

source: Fix iptunnel custom options form
ru: Исправлена форма дополнительных параметров в i2ptunnel

source: Fix update download buttons
ru: Исправлена кнопка для скачивания обновлений

source: Restore all console features if routerconsole.advanced=true
ru: Восстановить все возможности консоли, если routerconsole.advanced=true

source: Restore plugin install if routerconsole.enablePluginInstall=true
ru: Вернуть установку плагинов, если routerconsole.enablePluginInstall=true

source: Restpre client adds/changes if routerconsole.enableClientChange=true
ru: Возвращено добавление\изменение клиентов, для использования установите routerconsole.enableClientChange=true

source: Plugin signing keys are now whitelisted unless routerconsole.allowUntrustedPlugins=true
ru: Используется белый список ключей для подписи плагинов, если не настроено routerconsole.allowUntrustedPlugins=true

source: More escaping and cleanups in forms and messages
ru: Форматирование и чистка форумов и сообщений

source: ============================== The birth of Privacy Solutions ==============================
ru: ============================== Рождение Privacy Solutions ==============================

source: Organization launch
ru: Старт

source: Hello all! Today we announce the Privacy Solutions project, a new organization that develops and maintains I2P software. Privacy Solutions includes several new development efforts designed to enhance the privacy, security, and anonymity for users, based on I2P protocols and technology. These efforts include 1) The Abscond browser bundle. 2) The i2pd C++ router project. 3) The "BigBrother" I2P network monitoring project. 4) The Anoncoin crypto-coin project. 5) The Monero crypto-coin project. Privacy Solutions' initial funding was provided by the supporters of the Anoncoin and Monero projects. Privacy Solutions is a Norway-based non-profit type of organization registered within the Norwegian government registers. ( Kind of like US 501(c)3. ) Privacy Solutions plans to apply for funding from the Norwegian goverment for network research, because of BigBrother (We'll get back to what that is) and the coins that are planned to use low-latency networks as primary transport layer. Our research will support advances in software technology for anonymity, security, and privacy. First a little bit about the Abscond Browser Bundle. This was first a one-man project by Meeh, but later on friends started sending patches, the project is now trying to create the same easy access to I2P as Tor has with their browser bundle. Our first release isn't far away, it's just some gitian script tasks left, including setup of the Apple toolchain. But again we will add monitoring with PROCESS_INFORMATION (A C struct keeping vital proces information about an process) from the Java instance to check on I2P before we declare it stable. I2pd will also switch with the Java version once it's ready, and there is no point in shipping a JRE in the bundle anymore. You can read more about the Abscond Browser Bundle at https://hideme.today/dev
ru: Всем привет! Сегодня мы представляем проект Privacy Solutions — это новая организация, которая разрабатывает и поддерживает ПО I2P. Privacy Solutions занимается несколькими новыми разработками, спроектированными с целью улучшения приватности, безопасности и анонимности пользователей и основанными на протоколах и технологиях I2P. Список разработок проекта: 1) Abscond browser bundle. 2) маршрутизатор на C++ — i2pd. 3) проект наблюдения за сетью I2P под кодовым названием "BigBrother". 4) криптовалюта Anoncoin. 5) криптовалюта Monero. Первоначальное финансирование Privacy Solutions было предоставлено сторонниками проектов Anoncoin и Monero. Privacy Solutions — это некоммерческая организация, базирующаяся в Норвегии и зарегистрированная в норвежском государственном реестре (наподобие американского 501(c)3). Privacy Solutions планирует подать заявку на финансирование сетевых исследований норвежскими государственными органами, так как BigBrother (мы вернемся к сути проекта позже) и криптовалюты предполагают использование сетей с низкими задержками в качестве первичного транспортного уровня. Наши исследования поддержат развитие технологий анонимности, безопасности и приватности. Для начала расскажем немного об Abscond Browser Bundle. Изначально это был проект с одним человеком — Meeh, но со временем стали приходить патчи, а теперь проект стремится обеспечить такой же легкий доступ к I2P, как у браузера Tor. Выход первой версии уже скоро, осталось доделать несколько скриптов в gitian, включая настройку инструментария Apple. Также мы добавим мониторинг с использованием PROCESS_INFORMATION (структура C, которая содержит информацию о процессе) из Java версии для проверки I2P до объявления версии стабильной. I2pd также заменит Java версию, как только будет готов, и больше не будет необходимости поставлять JRE в наборе. Вы можете узнать больше об Abscond Browser Bundle на https://hideme.today/dev

source: We would also like to inform of the current status of i2pd. I2pd supports bi-directional streaming now, that allows to use not only HTTP but long-lived communication channels. Instant IRC support has been added. I2pd users are able to use it same way as Java I2P for access to I2P IRC network. I2PTunnel is one of key features of I2P network, allowing non-I2P applications communicate transparently. That's why it's vital feature for i2pd and one of key milestones.
ru: Мы также хотели бы сообщить о текущем статусе i2pd. I2pd теперь поддерживает потоки в обоих направлениях, что позволяет использовать не только HTTP, но и долгоживущие коммуникационные каналы. Добавлена непосредственная поддержка IRC. Пользователи i2pd могут использовать его для доступа к I2P IRC точно так же, как версию Java I2P. I2PTunnel — одна из ключевых особенностей сети I2P, позволяющая не-i2p приложениям прозрачно взаимодействовать друг с другом. Именно поэтому это жизненно важная функция i2pd и веха в истории развития.

source: At last, if you are familiar with I2P you probably know about Bigbrother.i2p, which is a metrics system Meeh made over a year back. Recently we noticed that Meeh actually have 100Gb of non-duplicated data from nodes reporting in since initial launch. This will also be moved to Privacy Solutions and be rewritten with a NSPOF backend. With this we will aslo start using the Graphite ( http://graphite.wikidot.com/screen-shots ). This will give us a great overview over the network without privacy issues for our end users. The clients filter all data except country, router hash and success rate on tunnel buildings. The name of this service is as always a little joke from Meeh.
ru: Наконец, если вы хорошо знаете I2P, то, возможно, слышали о Bigbrother.i2p, системе метрик, созданной Meeh более года назад. Недавно мы обнаружили, что у Meeh накопилось около 100Гб неповторяющихся данных от узлов с первого запуска. Также всё это будет перенесено в Privacy Solutions и переписано для NSPOF сервера. Вместе с этим мы начнем использовать Graphite (http://graphite.wikidot.com/screen-shots). Это позволит нам составить хорошее представление о сети без нарушения приватности конечных пользователей. Клиенты фильтруют все данные, кроме страны, хеша маршрутизатора и доли успешно построенных туннелей. В названии сервиса Meeh, как обычно, немножко пошутил.

source: We have shorted down a bit of the news here, if you're interested in more information please visit https://blog.privacysolutions.no/ We're still under construction and more content will come! For further information contact: press@privacysolutions.no Best regards, Mikal "Meeh" Villa
ru: Здесь мы сократили часть новостей, более полная информация доступна на сайте https://blog.privacysolutions.no/ Сайт всё ещё находится в разработке, и будет добавлено больше контента! За дополнительной информацией обращайтесь на press@privacysolutions.no С наилучшими пожеланиями, Mikal "Meeh" Villa

source: ============================================= Android test release on Google Play in Norway =============================================
ru: ====================================================== Тестовый релиз версии Android в Google Play в Норвегии ======================================================

source: I2P Android and Bote have been released on Google Play in Norway, as a test run for a future worldwide release.
ru: I2P Android и Bote были выпущены в Google Play в Норвегии в качестве тестового запуска перед предстоящим мировым релизом.

source: I2P Android has existed for over three years. In that time, it has evolved from a simple test project into a usable, useful Android port of the I2P router. Our eventual goal has been to release I2P Android on Google Play, to make it easier for users to discover, install and use I2P on their Android devices. After much work improving the user interface, fixing bugs and testing, we think that I2P Android is finally ready to go where the users are.
ru: I2P Android существует более трёх лет. За это время он развился из простого тестового проекта в годный к использованию, успешный порт I2P маршрутизатора на Android. Нашей конечной целью было выпустить I2P Android в Google Play, чтобы пользователям было удобно найти, установить и пользоваться I2P на устройствах с ОС Android. После большой работы над пользовательским интерфейсом, исправления ошибок и тестирования мы уверены, что I2P Android наконец готов к встрече с пользователями.

source: Initially, we are only releasing to Android users in Norway, as a test run. I2P Android will have far more exposure on Google Play than it has ever had before, and there will be bugs and usability issues that we need to fix. It will be much easier (and less stressful!) to respond to feedback if we only need to deal with reports from hundreds of users instead of thousands (already orders of magnitude more feedback than we have ever had).
ru: На первом этапе мы выпускаем приложение для пользователей Android из Норвегии в рамках тестового запуска. I2P Android в Google Play будет доступнее для пользователей, чем раньше, но при этом выявятся ошибки и недочеты интерфейса, требующие исправлений. Для нас будет проще (и менее напряженно!) отвечать на отзывы, если мы будем иметь дело с сообщениями от сотен пользователей, а не от тысяч (мы уже получаем больше отзывов, чем когда-либо ранее).

source: Simultaneously we are making the first public release of Bote, an Android port of `I2P-Bote`_. Bote is private, distributed, secure email, made easy. It runs on top of the I2P network, and while it works as a standalone app, it will use the I2P Android app by default if installed. As with I2P Android, we are initially only releasing Bote to Android users in Norway.
ru: Одновременно мы выпускаем первый публичный релиз Bote, `I2P-Bote`_, портированный на Android. Bote — приватная, распределенная, безопасная почта, простая в использовании. Работает поверх сети I2P как отдельное приложение, которое по умолчанию использует I2P Android, если он установлен. Так же как и I2P Android, изначально выпуск Bote для Android будет производиться только для пользователей из Норвегии.

source: The apps are being released on Google Play by `The Privacy Solutions Project`_. See their `blog post`_ for further information, and links to the Google Play page for Norway users.
ru: Приложения выпускаются в Google Play норвежским `The Privacy Solutions Project`_. Для дополнительной информации смотрите `сообщение в блоге`_ и ссылки на страницу Google Play для норвежских пользователей.

source: As lead developer for I2P Android and Bote, I look forward to your comments. You are the people who will be using them, and your perspectives will help me craft simple, intuitive apps that make privacy accessible to everyone.
ru: Как ведущий разработчик I2P Android и Bote я жду ваших комментариев. Вы — будущие пользователи, ваши мнения помогут мне создать простое, интуитивно понятное приложение, которое сделает приватность доступной для каждого.

source: `blog post`
ru: `сообщение в блоге`

source: Website release details
ru: Подробности выпуска версий на сайте

source: We have also updated I2P Android on the website to match the release candidate deployed in Norway. This version will be updated with changes as we respond to feedback from Norwegian users, heading towards our next stable release.
ru: Мы также обновили версию I2P Android на сайте, чтобы она соответствовала предрелизной версии, выпущенной в Норвегии. По мере приближения к следующей стабильной версии эта версия будет обновляться в соответствии с изменениями в ответ на сообщения норвежских пользователей.

source: Please note that we have upgraded the Android API to 9. This means that Froyo Android 2.2 will not be supported anymore; the minimum requirement is now Gingerbread Android 2.3.
ru: Пожалуйста, обратите внимание, что мы обновились до Android API 9 версии. Это означает, что Android 2.2 Froyo больше не поддерживается, минимальные требования теперь — Gingerbread Android 2.3.

source: Also note that if you have an earlier version of I2P Android, you will need to uninstall and reinstall because we have changed the release keys. Further information about this will be provided in a subsequent blog post.
ru: Если у вас более ранняя версия I2P Android, то вам потребуется деинсталлировать и переустановить приложение, так как изменились ключи релиза. Подробности будут размещены в предстоящей записи в блоге.

source: ============== 0.9.15 Release ==============
ru: ============== Версия 0.9.15 ==============

source: 0.9.15 includes Ed25519 crypto and many fixes
ru: В версии 0.9.15 добавлено шифрование Ed25519 и множество исправлений

source: 0.9.15 adds preliminary support for Ed25519 EdDSA signatures. It includes a new persistent configuration backend for i2psnark and fixes several issues with i2psnark's handling of file names. There are several improvements to speed up SAM. Plugins now support stronger signatures in the su3 file format. Plugin installation via the console, which was disabled in 0.9.14, is re-enabled.
ru: В версии 0.9.15 добавлена предварительная поддержка подписей Ed25519 EdDSA. Добавлены новые постоянные настройки и исправлены ошибки при обработке имён файлов в i2psnark. Увеличена скорость SAM. Плагины теперь поддерживают более стойкие подписи в формате su3. Установка плагинов из консоли, которая была отключена в версии 0.9.14, снова разрешена.
