Repository: Artogn/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/blog.po
Languages: ru

source: Fix changing client i2ptunnel target list
ru: Исправление в смене списка целей i2ptunnel клиента

source: Fix major bugs preventing reception of encrypted responses to leaseset lookups and verifies
ru: Исправлены серьезные ошибки, препятствующие получению зашифрованных ответов на запросы поиска LeaseSet

source: Fix bad links on some i2psnark buttons in Opera and text-mode browsers
ru: Исправлены неверные ссылки на некоторых кнопках в i2psnark при использовании текстовых браузеров и Opera

source: Fix NPE in Susimail
ru: Иправлено исключение нулевого указателя (NPE) в Susimail

source: Start work on supporting stronger signing keys in the router
ru: Начата работа по поддержке более стойких подписывающих ключей в роутере

source: Reduce thread usage for HTTP Server tunnels
ru: Уменьшено использование потоков для туннелей HTTP-сервера

source: Auto-stop update torrent after some time
ru: Автоостановка торрент-раздачи обновления спустя некоторое время

source: Add ability to stop webapp via console
ru: Добавлена возможность остановки веб-приложений через консоль управления

source: New POST throttler in HTTP server tunnel
ru: Новый ограничитель POST в туннеле HTTP-сервера

source: Improve connection throttling
ru: Улучшено регулирование подключения

source: More work to reduce number of connections
ru: Проведена работа для уменьшения числа соединений

source: Re-enable router info expiration job
ru: Возврат задачи router info expiration

source: Extend router info expiration and other changes to reduce load on floodfills
ru: Увеличено время до истечения срока хранения информации о маршрутизаторах и дргуие изменения для уменьшения нагрузки на floodfill-маршрутизаторы

source: Support multiple servers through a single server tunnel
ru: Поддержка нескольких серверов через один серверный туннель

source: Support specification of server port in i2ptunnel clients
ru: Поддержка указания порта сервера в клиентах i2ptunnel

source: Add support for SSL connections from i2ptunnel to external server
ru: Добавлена поддержка SSL соединений между i2ptunnel и внешним сервером

source: SSL and crypto code refactoring
ru: Рефакторинг криптографического и SSL-кода

source: i2psnark storage code refactoring
ru: Рефакторинг кода хранилища i2psnark

source: New destination cache
ru: Новый кэш назначений

source: Lots of code cleanup and resolution of findbugs warnings
ru: Код "почищен" и разрешены предупреждения findbugs

source: New Japanese translation (partial)
ru: Новый перевод на японский (частичный)

source: Translation updates: French, German, Italian, Romanian, Russian, Spanish, Swedish, and others
ru: Обновлены переводы для: французского, немецкого, итальянского, румынского, русского, испанского, шведского и других языков

source: Wrapper 3.5.22 (new installs and PPA only)
ru: Wrapper 3.5.22 (только новые установки и PPA)

source: ===================== Syndie 1.105b Release =====================
ru: =================== Релиз Syndie 1.105b ===================

source: Update to HSQLDB 2.3.1
ru: Обновление до HSQLDB 2.3.1

source: This is the first stable release since February 2013. It is essentially the same as 1.104b-7-rc, with some translation updates.
ru: Это первый стабильный релиз с февраля 2013 года. Он существенно не отличается от 1.104b-7-rc, но содержит некоторые обновления переводов.

source: All binaries and source packages are at `syndie.de`_ and `syndie.i2p`_. Plugins are available at `plugins.i2p`_ and `stats.i2p`_.
ru: Все исполняемые файлы и пакеты с исходным кодом доступны на `syndie.de`_ и `syndie.i2p`_. Плагины доступны по адресу `plugins.i2p`_ и `stats.i2p`_.

source: For those of you upgrading from 1.103b, you will find syndie startup and shutdown much faster due to the new version of HSQLDB.
ru: Если вы обновляетесь с версии 1.103b, то вы обнаружите, что загрузка и завершение работы Syndie стали более быстрыми благодаря новой версии HSQLDB.

source: If you have a large database or an identity you wish to preserve, you may wish to back up your entire ~/.syndie directory before you start. The upgrade process does make its own backup, however you may find it easier to use your own backup if the upgrade fails.
ru: Если у вас большая база данных или вы хотите сохранить идентификатор, вы можете сделать резервную копию всей директории ~/.syndie перед началом обновления. В процессе обновления создается отдельная резервная копия, однако может оказаться удобнее и проще использовать собственную копию на случай неудачи при обновлении.

source: Upgrades from 1.103b may fail for some people due to database corruption due to bugs in the old HSQLDB. Unfortunately, we don't know how to fix it. Your alternatives are to start over with a clean database, or stay with 1.103b forever. Sorry about that.
ru: Обновление с версии 1.103b может не выполниться из-за нарушения целостности базы данных в связи с ошибками в старой версии HSQLDB. К сожалению, мы не знаем, как это исправить. Альтренатива — начать сначала с чистой базой или остаться с версией 1.103b навсегда. Мы приносим извинения за неудобства.

source: As usual, we recommend that you update to this release. The best way to maintain security and help the network is to run the latest release.
ru: Как обычно, мы рекомендуем Вам обновиться. Лучший способ оставаться в безопасности и помогать сети - использовать самую свежую версию.

source: GUI Improvements and Fixes
ru: Улучшения и исправления пользовательского интерфейса

source: Syndication
ru: Синдикация

source: Database
ru: База данных

source: New translations
ru: Новые переводы

source: Translation updates
ru: Обновления переводов

source: ============== 0.9.10 Release ==============
ru: ============ Релиз 0.9.10 ============

source: 0.9.10 changes the mechanism for doing LeaseSet lookups, making it more difficult for an attacker to correlate a Destination with a Router.
ru: 0.9.10 изменяет механизм поиска LeaseSet, так что атакующему становится сложнее связать адрес назначения с маршрутизатором.

source: 0.9.10 changes the mechanism for doing LeaseSet lookups, making it more difficult for an attacker to correlate a Destination with a Router. It also fixes character encoding bugs in susimail, and includes lots of other bug fixes and translation updates. Most of you will update via torrent, using the new "su3" update format with stronger keys.
ru: 0.9.10 изменяет механизм поиска LeaseSet, так что атакующему становится сложнее связать адрес назначения с маршрутизатором. Также исправлены ошибки с кодировкой в Susimail и множество других, добавлены обновления переводов. Большинство из вас будет получать обновления через torrent, используя новый формат обновлений "su3" с использованием более сильных ключей.

source: We recently attended `30C3`_ and `Real World Crypto`_, making several new connections and formulating `big plans`_ for 2014. Thanks to those who supported our attendance with their `donations`_!
ru: Мы недавно посетили `30C3`_ и `Real World Crypto`_, где завязали несколько новых знакомств и сформулировали `большие планы`_ на 2014 год. Спасибо всем, кто поддерживает нас своими `пожертвованиями`_!

source: `big plans`
ru: `большие планы`

source: `donations`
ru: `пожертвованиями`

source: Use client tunnels for LeaseSet lookups
ru: Использовать клиентские туннели для поиска LeaseSet

source: Flood netdb stores to new location before midnight to prevent lookup fails after midnight
ru: Заполненные netdb хранятся до полуночи в другом месте, чтобы избежать отказов поиска после полуночи

source: Fix setting I2CP host/port in BOB
ru: Исправлена установка I2CP адреса/порта в BOB

source: Fix several character encoding issues in susimail
ru: Исправлено несколько проблем с кодировками в susimail

source: Fix StandardServerSocket.close()
ru: Исправление StandardServerSocket.close()

source: Fix exception in PrivateKeyFile
ru: Исправлено исключение в PrivateKeyFile

source: Fixes in RouterInfo expiration task
ru: Исправления в задаче устаревания RouterInfo

source: Tweaks to reduce number of peer connections
ru: Настройки для уменьшения числа одноранговых соединений

source: Several threading fixes to reduce blocking in the timer queues
ru: Изменения в потоках для уменьшения блокировок в очередях

source: Disable streaming ping handling for clients
ru: Выключение обработки потокового ping для клиентов

source: Use i2psnark's Kademlia library for the router netdb also
ru: Теперь для работы сетевой БД роутера используется библиотека Kademlia из i2psnark

source: Increase outbound exploratory default to 2 + 0-1 hops, part of gradual increase to 3 hops in/out
ru: Увеличено количество исходящих исследовательских туннелей по умолчанию до 2 + 0-1 прыжков; в рамках постепенного увеличения до 3 прыжков вх./исх.

source: More findbugs fixes
ru: Исправления в коде с использованием статического анализатора кода FindBugs

source: Streaming library refactoring
ru: Рефакторинг потоковой библиотеки

source: Support country-specific translations
ru: Поддержка переводов для разных стран

source: New Brazilian Portuguese translation
ru: Новый перевод на бразильский вариант португальского языка

source: ============== 0.9.11 Release ==============
ru: ============== Релиз 0.9.11 ==============

source: 0.9.11 adds support for outproxy plugins, improves lease set lookup security, and reduces memory usage.
ru: В версии 0.9.11 добавлена поддержка плагинов для внешних прокси, улучшена безопасность при поиске leaseSet, уменьшено использование памяти.

source: 0.9.11 continues improving LeaseSet lookup and storage to prevent an attacker from correlating a Destination with a Router. It adds support for the %(orchid)s outproxy plugin which is available at %(url)s. There is a reduction in memory usage due to fixes in the transports. We have some I2CP protocol improvements that will provide better lookup facilities and authorization protection for external clients. Of course, there's also the usual collection of bug fixes. All users should update.
ru: В 0.9.11 продолжаем исправление поиска и сохранения в LeaseSet, предотвращающее нахождение атакующим корреляции между маршрутизатором и точкой назначения. Добавлена поддержка %(orchid)s - доступен по адресу %(url)s - плагина, позволяющего использовать tor в качестве внешнего прокси, Уменьшено потребление памяти - исправлены ошибки транспорта. МЫ сделали некоторые исправления в протоколе I2CP для предоставления бОльшиз возможностей поиска и поддержки авторизации внешних клиентов. Конечно, есть ещё куча исправленных ошибок. Всем необходимо обновиться.

source: This may be the last release that works with Java 5, which is very old and unsupported. If you are using a Java 5 or 6 runtime, we strongly recommend that you upgrade to Java 7.
ru: Вероятно, это последняя версия, которая работает с устаревшей и более не поддерживаемой Java 5. Если вы используете Java 5 или 6, мы настоятельно рекомендуем обновиться до Java 7.

source: As usual, we recommend that you update to this release. The best way to maintain security and help the network is to run the latest release.
ru: Как обычно, мы рекомендуем вам обновиться до последней версии. Лучший способ оставаться в безопасности и помогать сети — использовать последнюю версию.

source: More leaseset handling improvements
ru: Улучшения обработки LeaseSet

source: Fix NPE after client shutdown
ru: Исправлено NPE после завершения работы клиента

source: Fix wrapper log encoding on logs page
ru: Исправлена кодировка журнала wrapper на странице журналов

source: Streaming ping and I2Ping fixes
ru: Исправления потокового ping и I2Ping

source: Add support for Orchid plugin
ru: Добавлена поддержка плагина Orchid

source: Add HTTPS support to HTTP client proxy
ru: Добавлена поддержка HTTPS для клиентских HTTP-прокси

source: New I2CP support for hostname lookups by external clients
ru: Поддержка поиска имени узла внешними клиентами в I2CP

source: Stricter I2CP authorization enforcement of external clients (incompatible change)
ru: Более строгое требование авторизации для внешних клиентов I2CP (несовместимые изменения)

source: Increase default inbound exploratory tunnel length variance
ru: Увеличен разброс входящих зондирующих туннелей по умолчанию

source: Big reduction in memory usage by transports
ru: Значительное уменьшние использования памяти транспортами

source: All in-net updates via torrent
ru: Все внутрисетевые обновления через torrent

source: ========================= Malware at i2pbrowser.net =========================
ru: ================================= Вредоносное ПО на i2pbrowser.net =================================

source: The site i2pbrowser.net is a fake I2P website mirror serving up malware for Windows.
ru: Сайт i2pbrowser.net является фальшивым зеркалом сайта I2P и распространяет вредоносное программное обеспечение для Windows.

source: We have recently been made aware of the existence of i2pbrowser.net. This website copies our homepage and download page, and attempts to trick users into downloading Windows malware.
ru: Нам недавно сообщили о существовании i2pbrowser.net. Этот сайт копирует нашу домашнюю страницу и страницу загрузок и пытается обманным путём заставить пользователей скачать вредоносное программное обеспечение для Windows.

source: There are several indicators that point to i2pbrowser.net being a malware site:
ru: Есть несколько признаков, которые указывают на то, что i2pbrowser.net является вредоносным сайтом:

source: The domain was registered on February 10th, 2014.
ru: Доменное имя было зарегистрировано 10 февраля 2014 года.

source: The download URLs for Windows, Mac OSX, Linux, Android etc. all link to the same .exe file.
ru: Все адреса загрузки для Windows, Mac OSX, Linux, Android и т. д. ведут к одному и тому же .exe файлу.

source: The .exe is only 741 KB; the official Windows installer for I2P is 13 MB.
ru: Файл .exe всего 741 кБ; официальная программа установки I2P для Windows имеет размер 13 МБ.

source: We have not examined the malware ourselves, but it does not appear to be very sophisticated; it is not integrated into or bundled with the I2P software. Information security expert `Lance James`_ posted `a tweet`_ labelling it as "a standard dark comet rat".
ru: Мы сами не изучали эту вредоносную программу, но она не выглядит очень сложной; она не интегрирована и не идет в комплекте с I2P. Эксперт по информационной безопасности `Lance James`_ разместил `твит`_, в котором назвал его "стандартной DarkComet RAT".

source: Spread the word. The only official download locations for I2P are linked on our `download page`_. All I2P download packages are GPG-signed by the `release signing key`_.
ru: Распространяйте эту информацию. Ссылки на единственное официальное место загрузки I2P находятся на нашей `странице загрузок`_. Все скачиваемые пакеты I2P подписаны GPG `ключом для подписи релизов`_.

source: `a tweet`
ru: `твит`

source: `release signing key`
ru: `ключом для подписи релизов`

source: ================================================================ Search Engine DuckDuckGo Awards Invisible Internet Project $5000 ================================================================
ru: ======================================================================================= Проект Невидимый Интернет получает награду в $5000 от поисковой системы DuckDuckGo =======================================================================================

source: Search engine `DuckDuckGo`_ `donates`_ $5000 to the `Invisible Internet Project`_ (I2P) in their open source donation program.
ru: Поисовая система `DuckDuckGo`_ `жертвует`_ $5000 `Проекту Невидимый Интернет`_ (I2P) в рамках программы пожертвований для свободного программного обеспечения.

source: **Somewhere, NH** -- Internet search company `DuckDuckGo`_ `donates`_ $5000 to the `Invisible Internet Project`_ (I2P) as part of their yearly open-source donation program. The award was granted on the basis of `nominations`_ by members of the public on the DuckDuckGo community portal. With an emphasis on privacy, DuckDuckGo provides a search engine which does not track its users or store personal data. I2P is an anonymous network intended to protect individuals from dragnet surveillance regularly performed by ISPs and governments.
ru: Интернет-поисковик DuckDuckGo пожертвовал 5000$ как часть годовых пожертвований проектам с открытым исходным кодом на проект I2P-Invisible Internet Project. Средства предоставлены членами публичного портала DuckDuckGo. DuckDuckGo предоставляет поисковый сервис, не собирающий персональных данных своих пользователей. I2P - анонимная сеть, идея которой - защитить пользователей от регулирующих и наблюдающих действий госорганов и провайдеров

source: This marks the single largest donation ever received by I2P and reflects a growing interest in privacy and security by the Internet community. The funding will help I2P to reach more users, expand development, and audit the code. It will also enable I2P developers to attend conferences, such as the `Real-World Cryptography`_ conference in New York City, where the developers met and collaborated with cryptography experts pursuant to I2P's goals of providing anonymity to the public.
ru: Это самое большое пожертвование, когда-либо полученное I2P, отражает растущий интерес к приватности и защищенности интернет-сообщества. Фонд поможет увеличить количество пользователей проекта, расширить и ускорить разработку, провести аудит исходных кодов. Ещё это даёт возможность разработчикам I2P присутствовать на конференциях, таких как `Real-World Cryptography` - конференция в Нью-Йорке, на которой разработчики знакомятся с экспертами в области криптографии в соответствии с целями I2P - предоставлять анонимность всем желающим.

source: I2P thanks Gabriel Weinberg and DuckDuckGo for the generous donation, and the I2P community for its support in the `nominations`_.
ru: I2P благодарит Гэбриела Вайнберга и DuckDuckGo за щедрое пожертвование, а также сообщество I2P за поддержу в `номинации`_.

source: For more information about I2P, visit `our web site`_ or follow us `on Twitter`_.
ru: Для получения дополнительной информации о I2P посетите `наш сайт`_ или подпишитесь на `наш Twitter`_.

source: `donates`
ru: `жертвует`

source: `our web site`
ru: `наш сайт`

source: `nominations`
ru: `номинации`

source: `on Twitter`
ru: `наш Twitter`

source: ============== 0.9.12 Release ==============
ru: ============== Версия 0.9.12 ==============

source: 0.9.12 adds support for ECDSA and updates to Jetty 8
ru: В 0.9.12 добавлена поддержка ECDSA и обновление Jetty до 8 версии

source: I2P now requires Java 6 or higher. We strongly recommend that you upgrade to Java 7. If you are still using Java 5, you must upgrade your Java before installing I2P 0.9.12.
ru: I2P теперь требует наличия Java версии 6 или выше. Мы настоятельно рекомендуем вам обновиться до Java 7. Если вы всё ещё используете Java 5, то потребуется обновление Java перед установкой I2P 0.9.12.

source: 0.9.12 adds preliminary support for ECDSA-signed Destinations. It contains several fixes for the handling of Delivery Status Messages (acknowledgements) and those messages are now end-to-end encrypted for increased security.
ru: В 0.9.12 добавлена предварительная поддержка подписанных ECDSA адресов назначения. Содержит несколько исправлений обработки сообщений о статусе доставки (подтверждений), для усиления безопасности для этих сообщений используется сквозное шифрование.

source: We have upgraded to Jetty 8. Jetty 8 is almost identical to Jetty 7, so there are no complex configuration file conversions as there have been in past Jetty upgrades. No manual changes should be necessary.
ru: Мы обновились до Jetty 8. Jetty 8 почти полностью идентичен Jetty 7, так что нет необходимости в запутанных правках конфигурационных файлов, как это случалось во время предыдущих обновлений Jetty. Изменения вручную не требуются.

source: In early March, Internet search company `DuckDuckGo`_ `donated`_ $5000 to the `Invisible Internet Project` (I2P) as part of their yearly open-source donation program. The award was granted on the basis of `nominations`_ by members of the public on the DuckDuckGo community portal.
ru: В начале марта компания-владелец поисковой системы `DuckDuckGo`_ `пожертвовала`_ $5000 `Проекту Невидимый Интернет`_ (I2P) в рамках ежегодной программы по поддержке свободного программного обеспечения. Награда была вручена на основе общественной `номинации`_ на портале сообщества DuckDuckGo.

source: `donated`
ru: `пожертвовала`

source: Encrypt Delivery Status Messages
ru: Шифрование сообщений о статусе доставки

source: Add preliminary support for ECDSA-signed Destinations
ru: Добавлена предварительная поддержка подписанных ECDSA адресов назначения

source: Add check for replayed NTCP session requests
ru: Добавлена проверка запросов пересоздания NTCP-сессий

source: Add throttling and blocking checks to streaming ping processing
ru: Добавлены проверки блокирования и задержки обработки поточных тестовых опросов

source: Fix RouterInfo exchange in NTCP
ru: Исправлен обмен RouterInfo в NTCP

source: Extend timeout for Delivery Status Messages
ru: Увеличено время ожидания для сообщений о статусе доставки

source: Drop streaming messages from recently closed connections
ru: Выкидывание из обработки поточных сообщений от недавно закрытых соединений

source: Fix restarts on Raspberry Pi
ru: Исправлен перезапуск на Raspberry Po

source: Restore profileOrganizer.sameCountryBonus advanced config
ru: Восстановлены настройки profileOrganizer.sameCountryBonus

source: Fix for jwebcache and i2phex
ru: Исправления для jwebcache и i2phex

source: Jetty 8.1.14.v20131031; Java 6 now required
ru: Jetty 8.1.14.v20131031; теперь требуется Java 6

source: Reduce target connection count again to reduce tunnel reject rate further
ru: Уменьшение количества целевых соединений для уменьшения отказов туннелей в будущем

source: Add rate limit for outbound connections at tunnel endpoints
ru: Добавлен лимит скорости для исходящих соединений на конечных точках туннелей

source: Add optional inproxy blocking in i2ptunnel
ru: Добавлено выборочное блокирование входных прокси в i2ptunnel

source: Use SSU session key for relay request/response when available
ru: Используйте ключи сессии SSU для промежуточных запросов/ответов, когда это возможно

source: Include HTTP POST data in SYN packet
ru: Данные HTTP POST включены в SYN пакет

source: Add getopt library for better argument processing
ru: Добавлена библиотека getopt для лучшей обработки параметров

source: More removal of Jetty dependencies
ru: Убраны зависимости для Jetty

source: Remove MD5 code, use Java libraries instead
ru: Убран MD5 код, вместо него используются библиотеки Java

source: Change the default addressbook subscription URL
ru: Изменен URL подписки по умолчанию для адресной книги

source: ============== 0.9.13 Release ==============
ru: ============= Версия 0.9.13 =============

source: 0.9.13 with SusiMail improvements and fixes for firewalled routers
ru: 0.9.13 с улучшениями SusiMail и исправлениями для маршрутизаторов за межсетевым экраном

source: 0.9.13 includes fixes for firewalled routers, netdb lookup improvements, and a big SusiMail update. Of course, there's also the usual collection of bug fixes and translation updates.
ru: 0.9.13 содержит исправления для маршрутизаторов за межсетевым экраном, улучшения поиска в сетевой базе данных и большое обновление SusiMail. Конечно, также присутствуют обычные исправления ошибок и обновления переводов.

source: zzz has updated his GPG keys, and the release files are signed with his new keys. His new key fingerprint is:
ru: zzz обновил свои GPG ключи, файлы релиза подписаны его новыми ключами. Отпечаток его нового открытого ключа:

source: Many UI improvements
ru: Многочисленные исправления пользовательского интерфейса
