Repository: Artogn/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/blog.po
Languages: ru

source: We have supported ECDSA signatures since 0.9.12, and we would like to start using ECDSA by default. Unfortunately, some of you are still running older I2P versions, and for others, their distribution or Java runtime does not support ECDSA. Red Hat (RHEL, Fedora) distributions are reported to be missing ECDSA. Some have fixed the Java issues by upgrading from Java 6 to Java 7; others have had success with installing the "unlimited strength policy files". We've added information about missing crypto to the log file and the /logs page in the console. After you update to 0.9.15, please check if you are missing ECDSA support, and attempt to fix it if necessary. This is particularly important for those that run popular eepsites and services.
ru: Мы поддерживаем подписи ECDSA с версии 0.9.12 и хотели бы начать использовать ECDSA по умолчанию. К сожалению, некоторые ещё пользуются старыми версиями I2P или их дистрибутив или Java Runtime не поддерживают ECDSA. Известно, что дистрибутивы Red Hat (RHEL, Fedora) на данный момент не поддерживают ECDSA. Проблемы с Java удается исправить, обновив Java 6 до 7 версии или установив пакет "unlimited strength policy files". Мы добавили информацию об отсутствующей криптографии в файл журнала и на страницу /logs в консоли. После обновления 0.9.15, пожалуйста, проверьте, поддерживается ли у вас ECDSA, и попробуйте разрешить этот вопрос, если потребуется. Особенно важно это для владельцев популярных сайтов и сервисов в i2p.

source: Changes
ru: Изменения

source: Add support for Ed25519 signatures
ru: Добавлена поддержка подписей Ed25519

source: i2psnark move to separate config file for each torrent to better support per-torrent settings
ru: Отдельный файл конфигурации для каждого торрента в i2psnark для упрощения поддержки индивидуальных настроек

source: Add i2psnark support for data outside the i2psnark/ directory
ru: В i2psnark добавлена поддержка данных вне директории i2psnark/

source: Enable stronger signatures (su3 format) for plugins
ru: Включить использование более стойких подписей (формат su3) для плагинов

source: Speed up SSU introductions by responding to hole punch messages
ru: Ускорение вступительных SSU путём ответа на перфорированые сообщения

source: Several improvements in SAM efficiency
ru: Несколько исправлений в работе SAM

source: Form submission fixes in the console and i2psnark
ru: Исправлена отправка форм в консоли и i2psnark

source: Streaming fixes for long signatures
ru: Исправления в потоковом модуле для длинных подписей

source: i2psnark fixes for file name character mapping when seeding
ru: Исправление кодировки имён файлов при сидировании в i2psnark

source: I2PTunnel fixes stopping client tunnels
ru: I2PTunnel испарвляет остановку клиентских туннелей

source: I2PTunnel fix updating options on a running delay-open client tunnel
ru: I2PTunnel: обновление опций для отложенно открытых клиентских туннелей

source: Re-enable plugin installation via the console, removed in 0.9.14
ru: Возобновлена установка плагинов из консоли, отключеная в 0.9.14

source: i2psnark now remembers uploaded count across restarts
ru: i2psnark теперь помнит количество отданного после перезагрузки

source: i2psnark increase max piece size to 8 MB
ru: Максимальный размер фрагмента в i2psnark увеличен до 8Мб

source: i2psnark several UI fixes
ru: Несколько исправлений в интерфейсе i2psnark

source: Prohibit SSU peer test requests unless a connection is established
ru: Запретить тестовые SSU запросы до установления соединения

source: i2ptunnel add support for local SSL connections for standard and IRC client tunnels
ru: Добавлена поддержка локальных SSL соединений для клиентских туннелей — обычных и IRC — в i2ptunnel

source: Console and log warnings for unavailable crypto
ru: Предупреждения в консоли и журналах о недоступном шифровании

source: More consistent routing for Delivery Status Messages to reduce network connections
ru: Более целостная маршрутизация Delivery Status Messages для уменьшения сетевых соединений

source: Disable external entities in UPnP XML parser
ru: Отключены внешние сущности в парсере UPnP XML

source: Update GeoIP data (in both new installs and updates)
ru: Обновлены данные GeoIP (как для новых установок, так и для обновлений)

source: 0.9.16 includes crypto migration and many fixes
ru: 0.9.16 включает множество обновлений и новую криптографию

source: 0.9.16 is a significant step forward in our plan to migrate from DSA to ECDSA and then EdDSA cryptographic signatures, and makes several other changes to increase your anonymity and security. Client tunnels for standard, IRC, and SOCKS IRC will use ECDSA signatures by default. In addition, we've fixed a large number of serious bugs, including console lockups.
ru: 0.9.16 - значительный шаг вперёд в нашем плане миграции с DSA на ECDSA и в далее на EdDSA криптографические сигнатуры, а также множество других изменений для увеличения вашей анонимности и защищенности. Клиентские туннели для стандартных сервисов, IRC и SOCK IRC будут использовать ECDSA сигнатуры по умолчанию. Также мы устранили большое количество серьёзных ошибок, включая блокировку консоли

source: Changes in router data structures will require i2pcontrol plugin users to update to version 0.0.9.
ru: Изменение в структурах данных маршрутизатора требуют обновление плагина i2pcontrol до версии 0.0.9

source: If you run an eepsite or a service and you are not running a recent release, or your Java or OS does not support ECDSA (as noted in the logs and on the /logs page in the console), please fix the issue as soon as possible or your users will soon be unable to connect.
ru: Если у вас запущен eepsite или другой сервис и вы не используете последнюю версию маршрутизатора, либо ваша Java-машина или ОС не поддерживает ECDSA (об этом будет написана в логах на странице /log консоли маршрутизатора), пожалуйста устраните это как можно быстрее, или скоро пользователи не смогут соединиться с вами

source: Add support for stronger Router Info signatures
ru: Добавлена поддержка более сильных сигнатур Router Info

source: Encrypt RI lookups and responses on faster boxes
ru: Шифрование запросов и ответов RI на быстрых машинах

source: Require I2CP authorization for all messages when enabled (requires 0.9.11 or higher client)
ru: Возможность авторизации всех сообщений I2CP (требуется клиент версии 0.9.11 и выше)

source: Disable SSLv3 and older ciphers for reseeding and other uses of SSL
ru: Отключение SSLv3 и старых алгоритмов шифрования для начальной загрузки (reseed) и другого использования SSL

source: Use ECDSA by default for i2ptunnel IRC, SOCKS-IRC, and standard client tunnels
ru: Использование по умолчанию алгоритма ECDSA для i2ptunnel IRC, SOCKS-IRC и стандартных клиентских туннелей

source: Don't prefer floodfills in some countries
ru: Предпочтение не становиться floodfill-маршрутизатором в некоторых странах

source: New column sorting, set-all priority buttons, and upload ratio display in i2psnark
ru: Новая сортировка, кнопка установки приоритета для всех файлов торрента и рейтинг аплоада в i2psnark

source: Increase i2psnark tunnel default to 3 hops
ru: Увеличение длины туннеля i2psnark до 3 хопов по умолчанию

source: Implement bundling of multiple fragments in a single SSU message for efficiency
ru: Реализована сборка нескольких фрагментов в одном SSU сообщении для повышения эффективности

source: New add-to-addressbook links on netdb leaseset page
ru: Новые ссылки для добавления в адресную книгу со страницы netdb - список LeasesSet

source: Implement I2NP DatabaseLookupMessage search type field to improve lookup efficiency
ru: Реализовано поле search type в I2NP DatabaseLookupMessage для улучшения эффективности поиска

source: CPUID fixes and updates for recent processors
ru: Исправления и обновления CPUID для новых процессоров

source: i2psnark fix magnet links with %(pc)s-encoding
ru: Исправление для i2psnark - корректная работа с magnet-ссылками, содержащими символы %(pc)s-encoding

source: Improve handling of SSU socket closing out from under us (hopefully fix 100%(pc)s CPU)
ru: Улучшение обработки закрытия SSU сокета (надеемся, решена проблема 100%(pc)s загрузки CPU)

source: SSU bitfield handling fixes
ru: Исправлена обработка битовых полей SSU

source: Fix HTTP header issues in i2psnark
ru: Исправлены некорректные HTTP заголовки в i2psnark

source: Fix rare NPE when building garlic message
ru: Исправлена редкая ошибка сборки чесночных сообщений

source: Fix console lockups (hopefully)
ru: Исправлена блокировка консоли (надеемся)

source: Fix i2ptunnel js confirm-delete
ru: Исправлено подтверждение удаления i2ptunnel js

source: Move router data structures from i2p.jar to router.jar (breaks i2pcontrol plugin)
ru: Структуры данных перемещены из i2p.jar to router.jar (плагин i2pcontrol не будет работать)

source: New router keys now stored in router.keys.dat (eepPriv.dat format) instead of router.keys
ru: Новые ключи теперь сохраняются в router.keys.dat в формате eepPriv.dat (вместо router.keys)

source: Improve handling of unsupported encryption throughout
ru: Исправлена обработка неподдерживаемых типов шифрования

source: More error checking of client I2CP messages by the router
ru: Маршрутизатор проверяет больше ошибок в клиентских I2CP сообщениях

source: Initial work on hooks for pluggable transports
ru: Начало работы над подключаемым транспортом

source: Enforce request timestamp in tunnel build messages
ru: Принудительный запрос временной метки в сообщениях создания туннелей

source: Re-enable message status in streaming, but treat no leaseset as a soft failure for now
ru: Возврат статусного сообщения в потоковом режиме, теперь отсутствие leaseset - некритическая ошибка

source: Return unused DH keypairs to the pool for efficiency
ru: Возврат неиспользуемых DH ключей

source: Raise failsafe tagset limit and improve deletion strategy when hit
ru: Поднятие порога отказоустойчивости и улучшение стратегии удаления при попадании

source: Change eepsite Jetty threadpool and queue configuration (new installs only)
ru: Изменение настроек очереди и пула потоков для Jetty (только новые установки)

source: NTCP establishment refactoring in prep for NTCP2 and PT
ru: Переписано создание NTCP соединений - готовимся к NTCP2 и PT

source: ============== 0.9.17 Release ==============
ru: ============= Версия 0.9.17 =============

source: 0.9.17 with more crypto migration and many fixes
ru: Версия 0.9.17 содержит множество исправлений и новую криптографию

source: 0.9.17 is primarily a bugfix release, but it also continues our migration to stronger cryptographic signatures.
ru: В 0.9.17 в первую очередь исправляются существующие ошибки, но также продолжается переход к более стойким криптографическим подписям.

source: We have moved the news feed system used for the news on your console and the latest router version indication to a signed format using RSA 4096-bit keys for enhanced security.
ru: Мы перешли к формату с подписью с использованием 4096-битных ключей RSA для улучшения безопасности в системе ленты новостей в консоли и отображении последней версии маршрутизатора.

source: New eepsites and servers will be ECDSA-signed by default, if ECDSA is available. There is now a warning in the console sidebar if ECDSA is not available. For RedHat users, we have reports of successful installs of the BouncyCastle Provider (bcprov) jar to add ECDSA support.
ru: Новые сайты и серверы в i2p по умолчанию будут использовать подписи ECDSA, если ECDSA поддерживается. В боковом меню консоли теперь появляется предупреждение, если ECDSA не поддерживается. Для ползователей RedHat: нам сообщили об успешном добавлении поддержки ECDSA после установки BouncyCastle Provider (bcprov) jar.

source: We've fixed several serious bugs, including an SSU packet corruption problem, and a SAM bug affecting i2p-messenger and other SAM applications. There are several fixes for the preliminary ECDSA router signatures added in the last release but not yet enabled.
ru: Мы исправили несколько серьезных багов, включая проблему с поврежденными пакетами SSU и ошибку SAM, затрагивающую i2p-messenger и другие приложения SAM. Также внесены исправления в подписи ECDSA, добавленные в прошлой версии, но ещё не включенные.

source: Many of us will be attending 31C3 in Hamburg in December. Stop by our table and say hi!
ru: Многие из нас будут на 31C3 в Гамбурге в декабре. Не проходите мимо нашего стола и зайдите поздороваться!

source: Signed news
ru: Подписанные новости

source: ECDSA default for new server tunnels
ru: ECDSA по умолчанию для новых серверных туннелей

source: Reseeding now SSL-only by default
ru: По умолчанию начальная загрузка использует только SSL

source: Fix SSU sending corrupt ack-only packets with partial bitfields
ru: Исправлена отправка поврежденных ack-only пакетов SSU с неполным битовым полем

source: Fix SSU inbound connection fail from non-DSA router
ru: Исправлен сбой входящего соединения SSU от маршрутизаторов без DSA

source: Don't select incompatible peers if we are a non-DSA router
ru: Маршрутизатор без DSA не будет выбирать несовместимых пиров

source: Fix EdDSA signature verification bug
ru: Исправлена ошибка при проверке EdDSA подписей

source: Stop i2ptunnel server acceptor thread after close
ru: Останавливать i2ptunnel Acceptor Thread на сервере после закрытия

source: Fix bug preventing some plugins from stopping completely
ru: Исправлена ошибка, не позволявшая некоторым плагинам полностью завершиться

source: Fix SAM v3 bug causing failures in incoming connections
ru: Исправлена ошибка в SAM v3, вызывающая сбой во входящих соединениях

source: Add a warning in the console sidebar if ECDSA not supported
ru: Добавлено предупреждение в боковом меню, если не поддерживается ECDSA

source: Log warnings for Java 6 that we will eventually require Java 7
ru: Логировать предупреждения в случае использования Java 6, так как переход на Java 7 неизбежен

source: Don't resend SSU acks that are too old
ru: Не отправлять повторно слишком давние подтверждения SSU

source: Don't publish direct info in SSU address if introducers are required
ru: Не публиковать непосредственную информацию в адресе SSU, если требуются посредники

source: New default opentrackers in i2psnark
ru: Новые открытые трекеры по умолчанию в i2psnark

source: Add support for specifiying data directory per-torrent in i2psnark
ru: Добавлена поддержка выбора директории для каждого торрента в i2psnark

source: Changes in streaming accept() error behavior
ru: Изменения в поведении при ошибках accept() библиотеки streaming

source: Minor blockfile format changes
ru: Небольшие изменения в формате блок-файла

source: New option for persistent random key to preserve peer ordering across restarts
ru: Новый параметр для постоянного случайного ключа для сохранения порядка узлов между перезапусками

source: ==================== Android app releases ====================
ru: ================== Версия для Android ==================

source: I2P Android 0.9.17 and Bote 0.3 have been released on the website, Google Play and F-Droid.
ru: I2P Android 0.9.17 и Bote 0.3 выпущены на сайте, в Google Play и F-Droid.

source: It has been some time since I last posted updates about our Android development, and several I2P releases have gone by without any matching Android releases. At last, the wait is over!
ru: Прошло довольно много времени с тех пор, как я последний раз размещал обновления о нашей разработке под Android, и несколько версий I2P вышли без соответствующей версии под Android. Наконец, ожидание закончилось!

source: New app versions ----------------
ru: Новые версии приложения ----------------

source: New versions of I2P Android and Bote have been released! They can be downloaded from these URLs:
ru: Были выпущены новые версии I2P Android и Bote! Их можно скачать с этих адресов:

source: The main change in these releases is the transition to Android's new Material design system. Material has made it much easier for app developers with, shall we say, "minimalist" design skills (like myself) to create apps that are nicer to use. I2P Android also updates its underlying I2P router to the just-released version 0.9.17. Bote brings in several new features along with many smaller improvements; for example, you can now add new email destinations via QR codes.
ru: Основным изменением в этих версиях является переход к новому материальному дизайну Android. Материальный дизайн упростил создание приложений, которые приятно использовать, для разработчиков со, скажем так, минимальными дизайнерскими навыками (как у меня). Также I2P Android теперь использует только что выпущенный I2P маршрутизатор 0.9.17. Bote приносит несколько новых функций наряду с множеством мелких улучшений и исправлений: например, теперь вы можете добавить новый адрес назначения через QR-код.

source: As I mentioned in `my last update`_, the release key that signs the apps has changed. The reason for this was because we needed to change the package name of I2P Android. The old package name (``net.i2p.android.router``) had already been taken on Google Play (we still don't know who was using it), and we wanted to use the same package name and signing key for all distributions of I2P Android. Doing so means that a user could initially install the app from the I2P website, and then later if the website was blocked they could upgrade it using Google Play. Android OS considers an application to be completely different when its package name changes, so we took the opportunity to increase the strength of the signing key.
ru: Как я уже упоминал в `моем прошлом сообщении`_, изменился ключ для подписи релиза. Причиной этого стала необходимость изменить имя пакета I2P Android. Старое название пакета (``net.i2p.android.router``) было занято в Google Play (мы до сих пор не знаем, кто им пользовался), а мы хотели использовать одинаковые имя пакета и подписывающий ключ для всех распространяемых версий I2P Android. В результате этого пользователь, который изначально установил приложение с сайта I2P, в дальнейшем сможет получать обновления из Google Play в случае блокировки сайта. Операционная система Android принимает приложение за совершенно другое, если изменяется соответствующее имя пакета, и, таким образом, мы воспользовались возможностью увеличить стойкость подписывающего ключа.

source: The fingerprint (SHA-256) of the new signing key is:
ru: Отпечаток (SHA-256) нового подписывающего ключа:

source: `my last update`
ru: `моем прошлом сообщении`

source: A few months ago we `released`_ both I2P Android and Bote on Google Play in Norway, to test the release process there. We are pleased to announce that both apps are now being released globally by `Privacy Solutions`_. The apps can be found at these URLs:
ru: Несколько месяцев назад мы `выпустили`_ I2P Android и Bote в Google Play в Норвегии для тестирования. Мы рады сообщить, что оба приложения теперь выпущены `Privacy Solutions`_ во всём мире. Приложения можно найти по этим адресам:

source: The global release is being done in several stages, starting with the countries for which we have translations. The notable exception to this is France; due to import regulations on cryptographic code, we are unable yet to distribute these apps on Google Play France. This is the same issue that has affected other apps like TextSecure and Orbot.
ru: Мировой релиз проходит в несколько стадий и начинается со стран, на языки которых приложение уже переведено. Примечательным исключением тут является Франция, где мы пока что не можем распространять приложения на Google Play France из-за ограничений на импорт критографического кода. Та же причина ранее затронула такие приложения, как TextSecure и Orbot.

source: `released`
ru: `выпустили`

source: `I2P on Google Play`
ru: `I2P в Google Play`

source: `Bote on Google Play`
ru: `Bote в Google Play`

source: Don't think we have forgotten about you, F-Droid users! In addition to the two locations above, we have set up our own F-Droid repository. If you are reading this post on your phone, `click here`_ to add it to F-Droid (this only works in some Android browsers). Or, you can manually add the URL below to your F-Droid repository list:
ru: Не думай, что мы забыли о тебе, пользователь F-Droid! Помимо перечисленных выше источников, мы создали свой F-Droid репозиторий. Если вы читаете это сообщение с телефона, то `нажмите сюда`_ для добавления в F-Droid (это работает не во всех браузерах Android). Также вы можете вручную добавить следующий URL в список репозиториев F-Droid:

source: If you would like to manually verify the fingerprint (SHA-256) of the repository signing key, or type it in when adding the repository, here it is:
ru: Если вы хотите проверить вручную отпечаток (SHA-256) подписывающего ключа репозитория или ввести его при добавлении репозитория, то вот он:

source: Unfortunately the I2P app in the main F-Droid repository has not been updated because our F-Droid maintainer has disappeared. We hope that by maintaining this binary repository, we can better support our F-Droid users and keep them up-to-date. If you have already installed I2P from the main F-Droid repository, you will need to uninstall it if you want to upgrade, because the signing key will be different. The apps in our F-Droid repository are the same APKs that are provided on our website and on Google Play, so in future you will be able to upgrade using any of these sources.
ru: К сожалению, приложение I2P в главном репозитории F-Droid давно не обновлялось, так как наш ответственный за репозиторий F-Droid исчез. Мы надеемся, что поддержание этого репозитория поможет пользователям F-Droid с обновлениями. Если у вас уже установлен I2P из главного репозитория F-Droid, то вам понадобится деинсталлировать программу для получения обновления, так как подписывающий ключ будет отличается. Приложения в нашем репозитории F-Droid — это те же самые APK, которые есть на нашем сайте и в Google Play, поэтому в будущем вы сможете обновляться, используя любой из этих источников.

source: `click here`
ru: `нажмите сюда`
