Repository: Artogn/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/blog.po
Languages: ru

source: Files are available on the `download page`_.
ru: Файлы доступны на `странице загрузок`_.

source: `download page`
ru: `странице загрузок`

source: RELEASE DETAILS
ru: ПОДРОБНОСТИ РЕЛИЗА

source: Major Changes
ru: Основные изменения

source: Bug Fixes
ru: Исправлены ошибки

source: Other
ru: Другое

source: SHA256 Checksums:
ru: Контрольные суммы SHA256

source: Major changes
ru: Основные изменения

source: Wrapper Update
ru: Обновление враппера

source: Update Info
ru: Информация об обновлении

source: 0.9.2 Release
ru: Версия 0.9.2

source: 0.9.2 includes extensive low-level changes to improve the performance and efficiency of the router. We have updated our UPnP library, to hopefully make UPnP work for more people. I2PSnark now has DHT support, but it is not yet enabled by default, as we plan to do more testing during the upcoming 0.9.3 development cycle.
ru: 0.9.2 включает в себя значительное количество изменений для увеличения производительности и эффективности маршрутизатора. Мы обновили нашу библиотеку UPnP, надеемся, что она будет работать для большего числа случаев. I2PSnark получил поддержку DHT, но она по умолчанию выключена, так как мы надеемся ее активно тестировать в процессе разработки версии 0.9.3.

source: As usual, there's also lots of bug fixes in this release, so updating is recommended.
ru: Как обычно, в этой версии исправлено много ошибок, поэтому рекомендуется обновление.

source: SSU: Fix several problems in our UDP transport, to improve efficiency and reliability for connection setup. Also improve defenses against various types of bad input.
ru: SSU: Исправлено несколько проблем в нашем UDP транспотре, для увеличения эффективности и надежности при установке соединения. Также улучшили защиту от разных типов плохих данных.

source: UPnP: Updated our library to fix several issues, should work for more routers now
ru: UPnP: Обновлили нашу библиотеку, теперь должно работать для большего количества устройств.

source: Transport: Improve performance in both our TCP and UDP transports, to benefit high-bandwidth routers
ru: Транспорт: Улучшили производительность TCP и UDP транспортов, особенно для маршрутизаторов на широких каналах.

source: Crypto: The thresholds and number of ElGamal/AES Session Tags delivered are now much more flexible, which should lessen protocol overhead and reduce stalls caused by dropped tags.
ru: Crypto: Отсечки и количество меток сессий ElGamal/AES сейчас гораздо более гибкие, что должно сократить затраты протокола и уменьшить подвисания, связанные с потерянными метками.

source: I2PSnark: Add DHT support, not yet enabled by default, will do further testing and plan to enable by default in 0.9.3.
ru: I2PSnark: Добавлена поддержка DHT, не включена по умолчанию, будет тестироваться, планируем включить по умолчанию в 0.9.3

source: Fix various issues affecting memory usage and performance on high-bandwidth routers
ru: Исправления ряда проблем с использованием памяти и производительностью на маршрутизаторах на широких каналах.

source: Fix problems in UDP for routers using a reduced-MTU connection, e.g. a VPN
ru: Исправлены проблемы в UDP для маршрутизаторов с уменьшенным MTU, например на VPN

source: Fix i2psnark bug that prevented a completion announcement to the tracker
ru: Исправлена проблема в i2psnark, которая мешала оповещению о завершении закачки на трекере.

source: Fix a lock contention problem in i2ptunnel
ru: Исправлена проблема с блокировками в i2ptunnel

source: Fix some OSX installation issues
ru: Исправлены некоторые проблемы при инсталляции в OSX

source: Remove uses of direct byte buffers that may have been leaking
ru: Избавились от использования direct byte buffers, которые могли утекать по памяти

source: Reduce overhead in network messages
ru: Уменьшены затраты протокола в сетевых сообщениях

source: Add "universal" theme support
ru: Добавлена поддержка темы "universal"

source: Theme updates
ru: Обновления тем

source: Add a jbigi library for Raspberry Pi
ru: Добавлена библиотека jbigi, оптимизированная для Rapspberry Pi

source: New Scala unit test framework
ru: Новая оснастка для юнит тестов Scala

source: Translation updates for Czech, Dutch, German, and Greek
ru: Обновления переводов для чешского, голландского, немецкого и греческого языков

source: Update wrapper to 3.5.15 (new installs and PPA only)
ru: Wrapper обновлен до 3.5.15 (для новых инсталляций и PPA)

source: Update GeoIP data (new installs and PPA only)
ru: Обновлены данные GeoIP (для новых инсталляций и PPA)

source: 0.9.3 Release
ru: Версия 0.9.3

source: 0.9.3 includes extensive low-level changes to the queueing of messages in the router. We implement the CoDel Active Queue Management (AQM) algorithm. We also unify the queueing and priority mechanisms in the transports to aid diagnosis and reduce network latency. Work continues on fixing UDP transport bugs and making UDP more resistant to attacks. There are more changes to improve the performance of the router and reduce its memory usage. Also, we enable i2psnark's DHT support, introduced last release, by default.
ru: Релиз 0.9.3 включает значительные изменения на низком уровне в работе с очередями сообщений в маршрутизаторе. Мы реализовали алгоритм CoDel Active Queue Management (AQM). Унифицировали работу с очередями и приоритетами в транспортах для облегчения диагностики и снижения сетевых задержек. Продолжается работа с проблемами в UDP транспорте, чтобы сделать UDP более устойчивым к возможным атакам. Значительные изменения сделаны, чтобы роутер работал эффективнее и с меньшей нагрузкой на память. Также мы включили DHT в i2psnark по умолчанию.

source: Priority queues
ru: Приоритетные очереди

source: I2PSnark DHT: Several bug fixes, enable by default.
ru: I2PSnark DHT: исправления нескольких проблем, включили по умолчанию.

source: Several SSU fixes including memory leak, and better handling of routers behind firewalls that change UDP ports; additional defenses for malicious packets.
ru: Ряд исправлений проблем в SSU, включая утечку памяти, более правильная обработка роутеров за файрволлами которые меняют UDP порты, дополнительные защиты от намеренно плохих пакетов.

source: Fix piece selection (rarest-first) bugs in i2psnark
ru: Исправлен выбор части (редкие вперед) в i2psnark

source: Fix bug causing multiple browsers to open at startup
ru: Исправлена проблема, приводящая к открытию нескольких браузеров на старте

source: Improvements in caching
ru: Улучшения в кэшировании

source: Several synchronization fixes and lock contention reduction
ru: Несколько исправлений в синхронизации и уменьшении использования блокировок

source: Major reduction in SSU buffers memory use
ru: Большое снижение потребления памяти в SSU буферах

source: Fix streaming connection timeout back to 1 minute, was inadvertently changed to 5 minutes; set i2ptunnel server read timeout to 5 minutes, was unlimited
ru: Таймаут потоковых соединений установлен в 1 минуту, ранее был 5 минут. Таймаут чтения i2ptunnel server установлен в 5 минут, было без ограничений

source: Improved defenses in i2ptunnel for "darkloris"
ru: Улучшили защиту от "darkloris" в i2ptunnel

source: More validation at torrent creation in i2psnark
ru: Больше проверок при создании торрента в i2psnark

source: Several parameter changes in SSU to improve throughput
ru: Несколько изменений параметров в SSU для увеличения пропускной способности

source: New event log for major events including restarts; show multiple restart lines on graphs
ru: Новый журнал для важных событий, включая перезапуски; показываем несколько моментов перезапусков на графиках

source: Remove duplicate messages from logs
ru: Удалены повторяющиеся сообщения в журнале

source: Don't respond to blocked streaming connections with a reset, just drop
ru: Не отвечать на заблокированные потоковые соединения reset, просто закрыть соедиение

source: Remove all uses of inefficient SimpleTimer
ru: Удалить все использование неэффективного SimpleTimer

source: More checks for valid IPs and ports entered in console
ru: Больше проверок на валидность IP и портов, введенных в консоли

source: Fix bug that wasted a lot of entropy
ru: Исправлена проблема что приводила к расходу энтропии

source: Translation updates: Italian, Portuguese, Spanish, Swedish
ru: Обновлены переводы: Итальянский, Португальский, Испанский, Шведский

source: Add non-NIO configuration in jetty.xml, recommended for Java 5
ru: Добавить не-NIO настройки в jetty.xml, рекомендованные для Java 5

source: 0.9.4 Release
ru: Версия 0.9.4

source: 0.9.4 includes a fix for a network capacity bug, introduced in 0.9.2, that was reducing network performance and reliability. It also includes major changes in the in-network update system, and adds the capability to update via in-network torrents.
ru: Версия 0.9.4 включает исправление для проблемы пропускной способности сети, внесенной в 0.9.2, что приводила к снижению производительности и надежности сети. Также включае большие изменения в системе обновления и добавляет возможность обновления через внутрисетевые torrent'ы

source: We fixed several bugs in the i2psnark DHT implementation that was introduced last release. For those of you using console or http proxy passwords, we converted to the more-secure digest method and improved the security for console forms.
ru: Мы исправили несколько проблем в реализации DHT в i2psnark, которые были внесены в последнем релизе. Для тех, кто использует пароли на консоль или прокси-сервер, мы сконвертировали их в более безопасный дайджест, а также улучшили безопасность форм.

source: For those of you already running development builds, your router should automatically update to 0.9.4-0 using the new in-network torrent facility. For those running 0.9.3-0, you will update normally using in-network HTTP, and we will have more information for you when we release 0.9.5.
ru: Для тех, кто уже работает с девелоперскими сборками, ваш маршрутизатор должен автоматически обновиться до 0.9.4.-0, используя новый механизм внутрисетевых торрентов. Для тех, кто пользуется 0.9.3-0, обновитель через внутрисетевой HTTP, и для вас будет больше информации, когда мы выпустим 0.9.5

source: Big rework of the update system; Preliminary support for updates via i2psnark
ru: Крупная переделка системы обновлений; Предварительная поддержка для обновлений через i2psnark

source: Add per-destination outbound priorities
ru: Добавить исходящие приоритеты для каждого назначения

source: Fix major bug that reduced SSU connection limits which reduced tunnel build success rates
ru: Исправить крупную проблему, которая уменьшала ограничения на соединения, что приводило к уменьшению качества построения туннелей

source: Fix bug with external I2CP that prevented some external apps from working
ru: Исправить проблему с внешним I2CP, которая мешала ряду внешний приложений работать

source: Fixed several bugs in i2psnark DHT
ru: Исправлено несколько проблем в реализации DHT в i2psnark

source: Fixed bug in i2psnark PEX that inflated peer counts
ru: Исправлена проблема в i2psnark PEX, которые увеличивали счетчик узлов

source: Handle dropped I2CP messages better
ru: Лучше обрабатывать отбитые I2CP сообщения

source: Reduce overhead of I2CP messages
ru: Уменьшить затраты протокола в I2CP сообщениях

source: Enforce max size in transport outbound message queues
ru: Усилить требования к максимальному размеру в исходящих очередях сообщений транспорта

source: Fixes for Windows eepget.bat (new installs and PPA only)
ru: Исправления для Windows eepget.bat (новые инсталляции и PPA)

source: Fix a bug that would drop messages of exactly 512 bytes in SSU
ru: Исправить проблему что приводила к потерям сообщений размером ровно 512 байт

source: More performance improvements, memory reduction, and object churn reduction
ru: Больше улучшений производительности, уменьшения расхода памяти и расхода ресурсов на постоянное пересоздание объектов

source: Better detection of network disconnections
ru: Лучшее определение сетевых рассоединений

source: Further improvements in the SSU transport
ru: Улучшения в SSU транспорте

source: Add console password form
ru: Добавить форму консольного пароля

source: Convert http proxy and console from basic to digest authentication for added security
ru: Для увеличения безопасности перейти к digest авторизации для консоли и http-прокси

source: Improved verification of console form submissions, using jsp sessions. Cookies may now be required on forms, except when the console password is enabled
ru: Улучшенная проверка для форм консоли, используя jsp сессии. Куки могут быть необходимы на формах, кроме тех случаев, когда включен пароль на консоль

source: Initial work on new interfaces to manage applications started via clients.config
ru: Первоначальная работа над новыми интерфейсами управления приложениями, запускаемыми через clients.config

source: Increase minimum peer port to 1024
ru: Увеличен минимальный номер порта на узле до 1024

source: Increase granularity of bandwidth limiter for smoother transmissions
ru: Увеличение гранулярности ограничителя полосы для более ровной передачи данных

source: Translation updates: Chinese, French, German, Italian, Polish, Portuguese, Swedish, and Ukrainian
ru: Обновлены переводы: китайский, французский, немецкий, итальянский, польский, португальский, шведский и украинский

source: Update wrapper to 3.5.16 (new installs and PPA only)
ru: Враппер обновлен до 3.5.16 (для новых инсталляций и PPA)

source: New ARMv6 wrapper for Raspberry Pi
ru: Новый ARMv6 враппер для Raspberry Pi

source: 0.9.5 Release
ru: Версия 0.9.5

source: 0.9.5 includes bug fixes and defenses for some issues and vulnerabilities that are being investigated by researchers at UCSB. We continue to work with them on additional improvements. This is a good opportunity to remind the community that while our network continues to grow rapidly, it is still relatively small. There may be multiple weaknesses or bugs that could compromise your anonymity. Help us grow the network by spreading the word and contributing where you can.
ru: Версия 0.9.5 включает исправления проблем и защиту от ряда уязвимостей, которые были исследованы специалистами в UCSB. Мы продолжаем работу вместе с ними над дополнительными улучшениями. Это хорошая возможность напомнить публике, что хотя наша сеть продолжает быстро расти, она все еще относительно невелика. Возможно, что присутствуют проблемы или ошибки, которые могут скомпрометировать вашу анонимность. Помогите нам увеличить сеть, распространяя информацию и принося свой вклад, какой вы можете сделать.

source: In this upgrade cycle, a random 1%(pc)s of routers, (plus all routers running a development build) will attempt to update via the experimental in-network bittorrent with i2psnark. If this doesn't work, it should fall back to standard in-network HTTP update.
ru: В этом цикле обновлений 1%(pc)s o случайных роутеров (плюс все роутеры, работающие на версии для разработчиков) будут пытаться обновиться через экспериментальный внетрисетевой bittorent с помощью i2psnark. Если это не сработает, обновление должно произойти через стандартный внутрисетевой HTTP.

source: Defenses and Bug Fixes
ru: Защита и исправление ошибок

source: Fix router bug causing lockup when using iMule
ru: Исправлена проблема в маршрутизаторе, приводившая к подвисанию при использовании iMule

source: Recognize, handle, reject duplicate tunnel IDs
ru: Узнаем, обрабатываем и отклоняем дублированный ID туннелей

source: Fix changing of the log file name
ru: Исправляем смену имени журнального файла

source: Prevent hashcode attack in session tags
ru: Предотвращаем hashcode attack в метках сессий

source: Add build request throttler based on previous hop
ru: Добавить регулятор запроса построения на основании предыдущего прыжка

source: Limit concurrent next-hop lookups
ru: Ограничиваем конкуррентные поиски следующего узла

source: Catch exceptions storing nonces in console
ru: Перехватываем исключения при сохранении в консоли

source: Fix saving graph settings in console
ru: Исправление настроек графиков в консоли

source: Fix eepget generation of URLs when not proxied
ru: Исправление генерации URL в eepget, когда работаем без прокси

source: Encrypt database lookup messages end-to-end when sent through exploratory tunnels
ru: Зашифровать сообщения поиска по базе данных от точки до точки при работе через исследующие туннели

source: Don't use multiple floodfills from the same /16 in a query
ru: Не использовать множественные floodfills из одной подсети /16 в запросе

source: Randomize delay before verifying floodfill store
ru: Сделать случайную задержку перед проверкой хранилища floodfill

source: Increase number of floodfills
ru: Увеличить количество floodfill

source: Improve support for mobile browsers
ru: Улучшить поддержку мобильных браузеров

source: Partial defenses for UCSB attacks
ru: Частичная защита от UCSB аттак

source: Add announce list support to i2psnark
ru: Добавить поддержку списка анонсов в i2psnark

source: Jetty: upgrade Apache Tomcat to 6.0.36
ru: jetty: обновить Apache Tomcat до 6.0.36

source: Split router info files into multiple subdirectories
ru: Разделить файлы маршрутизатора по нескольким поддиректориям

source: Add IP to hostname mapping option in SOCKS
ru: Добавить в SOCKS возможность распознавать IP в hostname

source: Improve PRNG seeding
ru: Улучшить запуск генератора случайных чисел

source: Translation updates: French, German, Hungarian, Italian, Norwegian, Polish, Portuguese, Russian, Swedish
ru: Обновления переводов: французский, немецкий, венгерский, итальянский, норвежский, польский, португальский, шведский

source: Update wrapper to 3.5.17 (new installs and PPA only)
ru: Wrapper обновлен до 3.5.17 (только новые установки и PPA)

source: 0.9.6 Release
ru: Версия 0.9.6

source: 0.9.6 includes bug fixes and an update from Jetty 6.1.26 (2010-11-10) to Jetty 7.6.10 (2013-03-12). See below for important information on the Jetty update. The Jetty 7 series is actively maintained and we plan to stay current with it in future I2P releases.
ru: Версия 0.9.6 включает в себя исправления и обновление jetty c Jetty 6.1.26 (2010-11-10) до 7.6.10 (2013-03-12). Смотрите ниже важную информацию про обновление jetty. Jetty версии 7 активно поддерживается и мы планируем последовательно обновлять версию до последней при будущих релизах I2P.

source: Most users will update via HTTP. Those running development builds will attempt to update via the experimental in-network bittorrent with i2psnark. We've fixed some bugs that will enable more users to update via torrent in the 0.9.7 update cycle.
ru: Большинство пользователей будут обновляться через HTTP. Те, кто работает на девелоперских сборках будут пытаться обновляться через внутрисетевой bittorrent с помошью i2psnark. Мы починили несколько проблем, это позволит большему количеству пользователей обновиться через torrent в процессе развития 0.9.7.

source: Important fix for Windows Eepsites, first install 0.9.5 only
ru: Важное исправление для Eepsite под Windows изначально запущенных под 0.9.5

source: If you first installed I2P with version 0.9.5, on Windows only, we recommend that you follow the following instructions to fix your eepsite location **before** you update to 0.9.6. Only original installations of 0.9.5-0 on Windows are affected by this issue. If your router version is 0.9.5-0-win1, you already have the fix and need not take any action.
ru: Если вы впервые запустили I2P на версии 0.9.5 под Windows (только это сочетание), мы рекомендуем проделать действия по инструкции чтобы сменить расположение сайта **до** обновления на 0.9.6. Только изначально установленные на 0.9.5-0 на Windows сайты подвержены этой проблеме. Если версия маршрутизатора 0.9.5-0-win1, то у вас уже все хорошо и ничего делать дополнительно не надо.

source: See `this page`_ for instructions.
ru: См. `эту страницу`_ для инструкций.

source: `this page`
ru: `эту страницу`

source: Jetty 7 Migration Details
ru: Порядок миграции на Jetty 7

source: For most people, the update should just work. If you have multiple Jetty eepsites, OR have made changes to jetty.xml or other Jetty configuration files, including changing the port from 7658, you MUST take manual action AFTER updating.
ru: Для большинсва людей, просто должен пройти процесс обновления и все. Если у вас несколько eepsite'ов на jetty? ИЛИ вы сделали изменения в jetty.xml или других конфигурационных файлах jetty, включая смену порта с 7658, вы ДОЛЖНЫ предпринять действия вручную ПОСЛЕ обновления.

source: After update, the router will migrate your jetty.xml files to the new Jetty 7 format.
ru: После обновления, маршрутизатор перенесет ваш jetty.xml в новый формат для jetty 7.

source: The migration resets the port to 7658. If you have more than one Jetty eepsite, OR your eepsite is NOT on port 7658, OR you have made other modifications to jetty.xml (for example changing the listen address from 127.0.0.1 to 0.0.0.0), you MUST edit the jetty.xml file for each eepsite to fix them up after updating, and restart again.
ru: Процесс миграции скинет порт на 7658. Если у вас более одного eepsite, ИЛИ ваш сайт НЕ на порту 7658, ИЛИ вы сделали другие изменения в jetty.xml (например, сменили адрес сервера с 127.0.0.1 на 0.0.0.0), вы ДОЛЖНЫ отредактировать jetty.xml для всех eepsite'ов и внести эти изменения снова, после обновления и снова перезапустить сайты.

source: **The following files will be backed up with a &quot;.jetty6&quot; suffix and then migrated.** If you have made local changes, you may have to edit them manually and restart. See http://wiki.eclipse.org/Jetty for assistance in configuring Jetty 7.
ru: **Следующие файлы будут сохранены с суффиксом &quot;.jetty6&quot; и затем изменены в новый формат** Если вы ранее делали локальные изменения в них, вы должны повторить эти изменения в новом формате и перезапуститься См. http://wiki.eclipse.org/Jetty для справки по настройкам Jetty 7.

source: Plugins
ru: Плагины

source: Most plugins should work fine with Jetty 7.
ru: Большинство плагинов должно нормально работать с Jetty 7

source: The I2PControl and zzzot plugins must be updated. Your router should download and install the new versions shortly after starting 0.9.6.
ru: Плагины I2PControl и zzzot должны быть обновлены. Ваш маршрутизатор должен скачать и установить новые версии вскоре после запуска 0.9.6.

source: If a plugin does not work, please contact the maintainer for that plugin.
ru: Если плагин не работает, пожалуйста, свяжитесь с автором плагина.

source: Several bugs with Windows installation (see above)
ru: Несколько проблем на Windows инсталляциях (см. выше)

source: Fix default form action in i2ptunnel
ru: Исправить действие в форме по умолчанию в i2ptunnel

source: Fix links on iframed console pages
ru: Исправлены ссылки на страницах консоли в iframe

source: Better detection of 64-bit Windows to prevent crashes by systray
ru: Улучшенное определение 64-битных Windows для предотвращения падений в systray

source: Fix bug preventing router update via torrent
ru: Исправить проблему, приводящую к невозможности обновиться через torrent

source: Several SSU fixes for NATs that change UDP ports
ru: Несколько проблем в SSU для NAT, которые меняют UDP порты

source: Ignore unsupported IPs in RouterInfos when selecting an address (prep for IPv6)
ru: Игнорировать не поддерживаемые IP в RouterInfo при выборе адреса (подготовка к IPv6)

source: Ignore unused option bits in Database Lookup Message (prep for requesting encrypted response)
ru: Игнорировать неиспользуемые биты настроек в Database Lookup Message (подготовка к запросу зашифрованных ответов)

source: Fix HTTP proxy error response for malformed URIs
ru: Исправить ответы HTTP прокси при ошибках неправильных URI
