Repository: Artogn/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/blog.po
Languages: ru

source: Recognize UPnP devices without port forwarding capability
ru: Опознавать устройства UPnP без поддержки порт-форвардинга

source: Jetty 7.6.10 (see above for migration information)
ru: Jetty 7.6.10 (см. выше инструкции по обновлению)

source: Limit page size in i2psnark
ru: Ограничение на размер страницы в i2psnark

source: Add data directory and page size configuration to i2psnark
ru: Добавить настройки директории с данными и размера страницы в i2psnark

source: Support multiple i2psnark instances
ru: Поддержка нескольких экземпляров i2psnark

source: Piece size adjustments in i2psnark
ru: Настройки размера части в I2psnark

source: Add more graphing support for combined bandwidth graph
ru: Дополнить графическую поддержку для отображения комбинированной полосы пропускания

source: Block b32.i2p supercookies
ru: Заблокировать b32.i2p supercookies

source: Allow stopping clients on /configclients
ru: Разрешить останавливать клиентов на /configclients

source: Check for nonce count replays in HTTP client
ru: Проверка на одноразовые ответы в клиенте HTTP

source: Support SASL authentication in IRC proxy
ru: Поддержка SASL авторизации в IRC прокси

source: Several cleanups and minor fixes in the update manager
ru: Несколько исправлений и мелких правок в управлении обновлением

source: Translation updates: German, Portuguese, Russian, Spanish, and Swedish
ru: Обновлены переводы: немецкий, португальский, русский, испанский, шведский

source: 0.9.7 Release
ru: Версия 0.9.7

source: 0.9.7 includes significant bug fixes and improvements.
ru: Версия включает значимые исправления и улучшения

source: For the first time, class 'N' routers (those with a minimumum of 128 KBytes/sec of shared bandwidth) will automatically become floodfill (previously it was only 'O' routers with 256 KBps). This will increase the floodfill population for additional resistance to certain attacks (see below). Floodfill routers don't consume much additional bandwidth, but they do tend to use additional memory and concurrent connections. If you do not wish your router to become floodfill, set the advanced configuration router.floodfillParticipant=false .
ru: Впервые, маршрутизаторы класса 'N' ( с минимальной полосой 128 Kbytes/sec) автоматически становятся floodfill (ранее так себя вели только 'O' маршрутизаторы с полосой 256 KBps). Это позволит увеличить количество floodfill для дополнительной защиты от некоторых атак (см. ниже). Floodfill не потребляет слишком много ресурсов сети, но есть тенденция к большему расходу памяти и соединений. Если вы не хотите чтобы ваш маршрутизатор становился floodfill, поставьте дополнительно настройку router.floodfillParticipant=false.

source: As we think the last release fixed the experimental update-via-torrent bugs, 3%(pc)s of routers should update over in-network bittorrent this cycle.
ru: Как мы и думали, последний релиз устранил проблемы экспериментального обновления-через-торрент, 3%(pc)s o маршрутизаторов должны обновиться через внутресетевой бит-торрент в этом цикле.

source: Plugin update checks, possibly broken for several releases, are fixed. Your plugins should once again auto-update after updating the router.
ru: Проверки обновления плагинов, возможно испорченные в нескольких релизах, исправлены. Ваши плагины должны еще раз обновиться автоматически после обновления маршрутизатора.

source: We fixed a major streaming timer bug that contributed to frequent IRC disconnects.
ru: Мы исправили главную ошибку потокового таймера, которая приводила к частым отключениям IRC.

source: This release contains additional mitigations for the `"practical attacks" paper`_. However, we have a lot more work to do to resist Sybil attacks on the floodfills, and resist traffic analysis at the gateways and endpoints of exploratory tunnels. It's a good reminder for everybody that our network is still relatively small and vulnerable. We don't currently recommend any uses that would put anybody in serious jeopardy. We'll keep working to improve it... please keep working to spread the word. A bigger network is a better network.
ru: Этот релиз содержит дополнительные ослабления по `заметкам о "практике атак"`_. Тем не менее, у нам предстоит выполнить еще много работы для защиты от атак Sybil с floodfill, и защиты от анализа трафика на шлюзах и конечных точках туннелей разведчиков. Это служит хорошим напоминанием всем о том, что наша сеть все еще относительно мала и уязвима. Мы не рекомендуем любое ее использование, которое может поставить вас под серьезную угрозу. Мы работаем над ее улучшением... пожалуйста, продолжайте работу, чтобы распространиться по миру. Чем больше сеть - тем лучше.

source: `"practical attacks" paper`
ru: `заметки о "практике атак"`

source: Anonymity Improvements
ru: Улучшения анонимности

source: End-to-end encryption of responses to leaseset lookups
ru: Непрерывное шифрование ответов на запросы просмотров leaseset

source: Expand floodfill pool by enabling class 'N' floodfills
ru: Расширение пула floodfill путем включения класса 'N' floodfill

source: Randomize padding inside encrypted SSU packets
ru: Случайное изменение размера внутри зашифрованных пакетов SSU

source: Preparation for better SSU protocol obfuscation
ru: Подготовка к улучшению обфускации протокола SSU

source: Fix newer lease sets not getting stored or published
ru: Исправление по проблеме: более новые наборы сроков аренды не сохраняются и не публикуются

source: Fix classpath bug when used with 4-year-old installations, causing the console not to start
ru: Исправление ошибки classpath, используемого с 4-летними установками, вызывающей отказ запуска консоли

source: Fix addressbook database bug preventing update of the reverse index
ru: Исправление ошибки адресной книги базы данных, предотвращающей обновление обратного индекса

source: Fix i2psnark bug that changed the infohash of torrents created by Robert and fetched via magnet link
ru: Исправление ошибки i2psnark, которая изменяет infohash торретнот, созданных Robert'ом и полученных через магнет ссылку

source: Fix version checking for plugins
ru: Исправление проверки версий плагинов

source: Fix a streaming timer bug causing frequent IRC disconnects (also affects other close-on-idle tunnels)
ru: Исправление ошибки потокового таймера, вызывающей частые отключения IRC (также влияющую на другие туннели, закрываемые при простое)

source: Don't install as a service on Windows by default
ru: Не устанавливать в качестве сервиса Windows по умолчанию

source: Reduce transport idle timeouts
ru: Уменьшение таймаутов простоя транспорта

source: Reduce tunnels on idle in i2psnark
ru: Уменьшение каналов в простое в i2psnark

source: Change default in i2ptunnel GUI to 3 hops
ru: Изменение настройки по умолчанию в i2ptunnel GUI на 3 прыжка

source: IE 10 support
ru: Поддержка IE 10

source: Individual expiration times in leases, for efficiency on destinations with a high number of tunnels
ru: Индивидуальное время жизни аренд, для повышения эффективности в пунктах назначения с большим количеством туннелей

source: Low-level encryption and XOR speedups
ru: Низкоуровневое шифрование и ускорение XOR

source: Translation updates: Chinese, French, German, Portuguese, Russian, Spanish
ru: Обновления переводов: Китайский, Французский, Немецкий, Португальский, Русский, Испанский

source: New Turkish translation
ru: Новый Турецкий перевод

source: Wrapper 3.5.19 (new installs and PPA only)
ru: Wrapper 3.5.19 (только новые установки и PPA)

source: 0.9.7.1 Release
ru: Версия 0.9.7.1

source: This unscheduled release disables the RouterInfo verification messages that were used in the attack published in the UCSB paper, which should make correlating a LeaseSet and a Router much more difficult. We have also included a limited number of other fixes listed below. Our 0.9.8 release, which will include IPv6 support, is still on-schedule for late September.
ru: Этот незапланированный релиз отключает проверочные сообщения RouterInfo, которые использовались в атаках, опубликованных в заметках UCSB, что должно усложнить нахождение связи между LeaseSet и маршрутизатором. Мы также включили ограниченное число исправлений, приведенных ниже. Наш релиз 0.9.8, который будет включать в себя поддержку IPv6, все еще запланирован на конец сентября.

source: As usual, we recommend that all users update to this release.
ru: Как обычно, мы рекомендуем всем обновиться до этого релиза.

source: Disable RouterInfo verification messages
ru: Отключение проверочных сообщений RouterInfo

source: Extend inbound tunnel expiration
ru: Увеличили время жизни входящего туннеля

source: i2prouter: bashism fix
ru: i2prouter: исправление bashism

source: i2psnark: increase max piece size, mime type updates
ru: i2psnark: увеличили максимальный размер куска, обновление mime типов

source: New reseed host
ru: Новый механизм повторного использования хоста

source: New update hosts, thanks Meeh and dg
ru: Новый механизм обновления хоста, спасибо Meeh и dg

source: Streaming: RTO changes
ru: Потоки: изменения RTO

source: Updater: Increase update-via-torrent to 30 percent
ru: Обновление: увеличение обновлений-через-торрент до 30 процентов

source: UPnP fix for some hardware
ru: Исправление UPnP для некоторого оборудования

source: 0.9.8 Release
ru: Версия 0.9.8

source: 0.9.8 includes the long-awaited support for IPv6. It's enabled by default, but of course you need a public IPv6 address to use it. Configuration is on the 'network' configuration tab in your console. We also have anonymity improvements including padding of SSU packets and longer router private keys.
ru: 0.9.8 включает долгожданную поддержку IPv6. Она включена по умолчанию, но, конечно же, вам нужен публичный IPv6 адрес, чтобы использовать её. Настраивается во вкладке настроек "сеть" в вашей консоли. Мы также усилили анонимность, включая многослойные SSU пакеты и более длинные закрытые ключи роутера.

source: 30%(pc)s of you will update via in-network torrent in this update cycle.
ru: В этом цикле обновлений 30%(pc)s o из вас будут обновлены через внутрисетевой торрент-клиент.

source: IPv6 Details
ru: Подробности об IPv6.

source: IPv6 is enabled and preferred by default. If you have a public IPv6 address and you are connecting to another router with a published IPv6 address, it will connect via IPv6. There is a new IPv6 configuration section on /confignet in the router console. If IPv6 is causing problems you may disable it there.
ru: IPv6 включён и предпочитается по умлочанию. Если у вас есть публичный IPv6 адрес и вы соединяетесь с другим роутером с публичным IPv6 адресом, они соединятся через IPv6. В /confignet в консоли роутера - новая секция настройки IPv6. Если IPv6 вызывает проблемы, вы можете отключить его там.

source: As a part of the IPv6 development effort, I2P now supports multiple published IP addresses. If you have multiple public IP addresses (IPv4, IPv6, or both), you may enable or disable them individually on /confignet. The default is to use the first IPv4 and IPv6 addresses it discovers. If you have multiple addresses you should review the configuration on /confignet and adjust it if necessary. Note that while you may enable multiple IPv4 and IPv6 addresses on /confignet, we recommend that you use only one IPv4 and one IPv6 address. There are bugs still to be fixed with multiple addresses of each type.
ru: Как часть усилий в области развития IPv6, I2P теперь поддерживает множественные публичные IP адреса. Если у вас есть множественные публичные IP адреса (IPv4, IPv6, или оба), вы можете включить или выключить каждый из них в /confignet. По умолчанию, используется сначала IPv4, а IPv6 адреса к нему обращаются. Если у вас есть множественные адреса, вам стоит проверить настройки в /confignet и поправить их, если необходимо. Заметьте, что в то время как вы можете включить множественные IPv4 и IPv6 адреса в /confignet, мы рекомендуем использовать только один IPv4 и один IPv6 адреса. Всё ещё есть ошибки с множественными адресами каждого типа, которые нужно исправить.

source: While IPv6 support was designed and developed over several years, it has only been tested by a limited number of users and is still beta. If you do have a public IPv6 address, please monitor your router and the logs for problems, and disable it necessary. Please report any bugs on http://trac.i2p2.i2p.
ru: В то время как поддержка IPv6 проектировалась и разрабатывалась в течение нескольких лет, она была протестирована только ограниченным количеством пользователей и всё ещё на стадии беты. Если у вас есть публичный IPv6 адрес, пожалуйста, проверяйте ваш маршрутизатор и логи на предмет проблем, и отключите его, если необходимо. Пожалуйста, сообщайте о любых ошибках на http://trac.i2p2.i2p

source: Rekeying Details
ru: Подробности о Подробном вводе.

source: For those of you running I2P on faster hardware (generally, 64-bit x86) the router will generate a new identity using longer keys. This will substantially reduce your participating traffic for 48 hours or more, while your router re-integrates into the network. Due to the new keys, the large number of torrent updates, and the recent network growth, we expect substantial disruption to the network for a week or more after the update is released. Please be patient and things should start to improve after a few days.
ru: Для тех из вас, кто запускает I2P на быстром аппаратном обеспечении (в основном, 64-битном x86), маршрутизатор сгенерирует новый профиль используя более длинные ключи. Это в значительной степени сократит ваш транзитный трафик на 48 часов или более, пока ваш маршрутизатор ре-интегрируется в сеть. По причине новых ключей, большого количества торрент-обновлений и недавнего роста сети мы ожидаем существенных сбоев в сети в течение недели или более после выпуска обновления. Пожалуйста, будьте терпеливы: всё должно начать улучшаться через несколько дней.

source: These changes may result in higher CPU usage for some of you. We're doing our best to increase efficiency, but stronger security generally requires more computation. Performance may also be poor during the first week due to the network churn. We will evaluate the network performace before deciding whether to change the key length on slower hardware in a future release.
ru: Эти изменения для некоторых из вас могут привести к более высокой нагрузке на процессор. Мы делаем всё возможное, чтобы повысить эффективность, но более высокий уровень безопасности обычно требует больше расчётов. Быстродействие также может быть низким в течение первой недели из-за оттока сети. Мы оценим производительность сети, прежде чем принимать решение об изменении длины ключа на более медленном оборудовании в будущих релизах.

source: We are experiencing rapid network growth in the last few weeks, which is causing a bit of a bumpy ride for some, especially on weekends. However, the network is still performing fairly well, so keep spreading the word.
ru: Мы переживаем быстрый рост сети в посдление несколько недель, который вызывает у некоторых проблемы, особенно по выходным. Однако, сеть всё ещё работает достаточно хорошо, так что продолжайте распространять информацию.

source: More Changes Coming
ru: Впереди Больше Изменений.

source: We're in the initial stages of desiging major changes to strengthen our crypto. Stronger crypto will use more CPU and it may possibly require a Java 7 JRE at a minimum. We understand your desire to run I2P on low-power and/or older hardware. We're working hard to minimize the impacts, but some loss of performance is inevitable. In addition, Java 5 and 6 are no longer supported by Oracle. Now is a good time to upgrade to Java 7. Any change in minimum requirements will be announced well in advance.
ru: Мы находимся на начальной стадии проектирования основных изменений для усиления нашего шифрования. Более сильное шифрование будет использовать больше ресурсов процессора и возможно потребует Java 7 JRE как минимум. Мы понимаем, что вы хотите запускать I2P на маломощном и/или старом оборудовании. Мы прилагаем все усилия, что уменьшить неудобства, но некоторая потеря быстродействия неизбежна. Кроме того, Java 5 и 6 более не поддерживаются Oracle. Сейчас самое время перейти на Java 7. Любые изменения в минимальных требованиях будут анонсированы заранее.

source: New Website
ru: Новый Вебсайт

source: After a heroic effort by str4d, the new website preview is available at http://i2hq.srv.i2p2.de. We hope to see it go live at https://geti2p.net and http://www.i2p2.i2p soon. Please contribute to the new website translations on Transifex, especially the website_priority resource.
ru: После героических усилий str4d предварительный просмотр нового сайта доступен на http://i2hq.srv.i2p2.de. Мы надеемся скоро увидеть его вживую на https://geti2p.net и http://www.i2p2.i2p. Пожалуйста, сделайте свой вклад в новый перевод вебсайта на Transifex, особенно в разделе website_priority.

source: Community Participation
ru: Участие в Сообществе

source: In early August, hottuna and zzz attended DEFCON 21 in Las Vegas. Last weekend, echelon attended the CTS IV conference in Berlin and psi attended the Tahoe-LAFS hackfest at GNU 30 in Cambridge, Mass. Several of us will be at 30C3 in Hamburg late this year. It's great to see people participating at these events and representing I2P.
ru: В начале августа hottuna и zzz принимали участие в DEFCON 21 в Лас Вегасе. В минувшие выходные echelon поучаствовал в конференции CTS IV в Берлине, а psi - в хакфесте Tahoe-LAFS на GNU 30 в Кембридже, штат Массачусетс. Некоторые из нас будут на 30C3 в Гамбурге в этом году. Это классно - видеть людей, участвующих в этих мероприятиях и представляющих I2P.

source: IPv6 support for both NTCP and SSU
ru: Поддержка IPv6 для обоих NTCP и SSU

source: SSU protocol obfuscation by adding random padding
ru: Затемнение протокола SSU добавлением случайного наполнения

source: Longer encryption and DH private keys for users on faster platforms
ru: Более длинные ключи шифрования и закрытые ключи DH для пользователей на более быстрых платформах.

source: Fix I2PTunnel / I2CP locking and duplicates (partial)
ru: Исправлены блокировка и дублирование (частично) I2PTunnel / I2C

source: Fix translation of HTTP proxy error pages
ru: Исправлен перевод страниц ошибок HTTP прокси

source: Fix occasional runtime exception in NTCP
ru: Исправлено случающееся иногда исключение времени выполнения в NTCP

source: Big rework of transport code to accommodate multiple addresses and IPv6
ru: Большая переработка транспортного кода для согласования множественных адресов и IPv6

source: Streaming: Improved recovery from lost acks, other fixes
ru: Streaming: улучшено восстановление после потерянных подтверждений, другие исправления

source: Use Transifex for translation of initial news and HTTP proxy error pages
ru: Использование Transifex для перевода начальных новостей и страниц ошибок HTTP прокси

source: Translation updates: Chinese, French, German, Portuguese, Russian, Swedish, Turkish
ru: Обновления перевода: китайский, французский, немецкий, португальский, русский, шведский, турецкий

source: New Romanian translation
ru: Новый румынский перево

source: Wrapper 3.5.20 (new installs and PPA only)
ru: Wrapper 3.5.20 (только новые установки и PPA)

source: 0.9.8.1 Release
ru: Релиз 0.9.8.1

source: 0.9.8.1 fixes a problem with updating to 0.9.8 on Windows for some people. New installs and non-Windows platforms are not affected, however all platforms will automatically update even if running 0.9.8.
ru: 0.9.8.1 исправляет проблему с обновлением до 0.9.8 на Windows у некоторых людей. Новые установки и не-Windows платформы не затронуты, тем не менее, все платформы автоматически обновятся, даже если они уже используют 0.9.8.

source: See the `Trac ticket`_ for details and workarounds. See `the 0.9.8 release notes`_ for information on IPv6 and other changes.
ru: Подробности и обходные пути смотри в `Trac ticket`_. Смотри `заметки по релизу 0.9.8`_ для информации по IPv6 и другим изменениям.

source: Due to recent attacks, logins are disabled on `Trac`_ and new registrations are disabled on `zzz.i2p`_. Until those services are restored, please report all bugs on IRC freenode or IRC2P #i2p-dev.
ru: В свете последних атак, учетные записи на `Trac`_ заблокированы, и новые регистрации на `zzz.i2p`_ заблокированы. Пока сервисы не доступны, пожалуйста, отправляйте все ошибки на IRC freenode или IRC2P #i2p-dev.

source: `the 0.9.8 release notes`
ru: `заметки по релизу 0.9.8`

source: 0.9.9 Release
ru: Релиз 0.9.9

source: 0.9.9 fixes a number of bugs in the netdb, streaming, and i2ptunnel, and starts work on a year-long plan to increase the strength of the cryptographic signing algorithms used in the router, and support multiple algorithms and key lengths simultaneously. Automatic update files will now be signed with 4096-bit RSA keys.
ru: 0.9.9 исправляет множество ошибок в netdb, механизме потоков и i2ptunnel, и дает начало роботе над годовым планом по увеличению стойкости алгоритмов криптографической подписи, используемой в маршрутизаторе, и одновременной поддержке нескольких алгоритмов и ключей разной длины. Файлы автоматического обновления теперь будут подписаны ключами 4096-bit RSA.

source: We now support SSL between your router and your servers for security. See `this development thread`_ for more information.
ru: В целях безопасности теперь мы поддерживаем протокол SSL между вашим маршрутизатором и вашими серверами. Смотрите подробнее в `this development thread`.

source: As usual, we recommend that you update to this release. The best way to maintain security and help the network is to run the latest release. Several members of the I2P team will be at 30C3 in Hamburg this year. Come say hello and ask for an I2P sticker. Thanks to everyone for their support this year.
ru: Как обычно, мы рекомендуем Вам обновиться. Лучший способ оставаться в безопасности и помогать сети - использовать самую свежую версию. Некоторые члены команды разработчиков I2P будут присутствовать на конференции 30C3 в Гамбурге в этом году. Приходите и получайте наклейку с символикой I2P. Спасибо всем за поддержку в этом году.

source: Don't build client tunnels through zero-hop exploratory tunnels
ru: Не создавайте клиентские туннели через исследовательские туннели с 0 прыжками

source: New "su3" file support using stronger keys
ru: Поддержка использования более стойких ключей для файлов su3

source: Use su3 for updates
ru: Теперь для обновлений используется формат su3

source: Issues with losing data when closing streams
ru: Потеря данных при закрытии потоков

source: Fix various streaming connection limit issues
ru: Исправлены различные проблемы с ограничениями потоковых соединений

source: Issues with resource usage of closed connections
ru: Проблемы с ресурсами, которые занимают закрытые соединения

source: Clean up timer threads in close-on-idle tunnels
ru: Сброс таймера потоков в туннелях close-on-idle

source: Several other streaming fixes
ru: Различные исправления в потоковом модуле

source: Reject more non-public IPv6 addresses
ru: Теперь отбрасывается большее количество локальных IPv6-адресов

source: Fix IPv6 GeoIP
ru: Исправлена служба GeoIP для IPv6

source: Fix peer selection in first minutes after startup
ru: Исправлен алгоритм выбора узлов в первые минуты после запуска

source: Several I2PTunnel bug fixes
ru: Исправлено несколько багов в I2PTunnel

source: Fix major i2psnark DHT bug that prevented magnets from working well
ru: Исправлена крупная ошибка в подсистеме DHT в i2psnark, которая мешала функционированию magnet-ссылок

source: Fix client tunnels that fail due to name resolution failure at startup, particularly with b32 hostnames
ru: Исправление ошибок в клиентских туннелях, возникших из-за невозможности разрешения имени во время запуска, в частности b32 имен узлов
