Repository: Artogn/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/get-involved.po
Languages: es

source: To collect this bounty, the existing in-memory multi-router simulation must be checked, made work again and extend to simulate lots of routers in memory on a single machine. This bounty will be split in more fine grained subworks.
es: Para obtener esta recompensa, debe comprobarse y hacer funcionar de nuevo la ya existente simulación multi-ruter en la memoria, además de poder simular muchos ruters en la memoria de una única máquina. Esta recompensa se partirá en otros trabajos menores.

source: Judge on all these works is the donor and donor decides if a phase is called succesfull done and money can be paid.
es: El jurado de estas donaciones es el que decide, y el que dona decide si la fase se ha hecho exitosamente y el dinero puede pagarse.

source: Bounty I2P vuze plugin
es: Rcompensa por el pluguin I2P vuze

source: vuze plugin
es: pluguin vuze

source: To improve I2P usage and attract more people into I2P torrent P2P I setout the bounty for a working I2P vuze plugin. The plugin needs to be official and submitted to vuze for publication on their webpage/repository for plugins. It should be easy to install and configured, work smooth and flawless. Configuration should be friendly to starters and made easy to be anonymous. It should work with *.b32.i2p destinations as with signed (516++ bits) destinations.
es: Para mejorar el suso de I2P y atraer a más usuarios al uso de torrents en I2P creo una recompensa por un pluguin de vuze que funcione. El pluguin tiene que ser oficial y debe aparecer en la web oficial de de vuze. Debe ser fácil de instalar y utilizar, y funcionar suave y sin problemas. La configuración debe ser sencillas para la gente nueva y debe proveer anonimato fácilmente. Debe funcionar con destinaciones b32 y con destinaciones firmadas (516++ bits).

source: Application Development
es: Desarrollo de aplicaciones

source: May 2013
es: Mayo de 2013

source: Application Development Guide
es: Guía de desarrollo de aplicaciones

source: Contents
es: Contenido

source: Why write I2P-specific code?
es: ¿Porqué escribir código específico para I2P?

source: Important concepts
es: Conceptos importantes

source: Development options
es: Opciones de desarrollo

source: Start developing - a simple guide
es: Empiece a programar - una guía simple

source: There are multiple ways to use applications in I2P. Using <a href="%(i2ptunnel)s">I2PTunnel</a>, you can use regular applications without needing to program explicit I2P support. This is very effective for client-server scenario's, where you need to connect to a single website. You can simply create a tunnel using I2PTunnel to connect to that website, as shown in <a href="#tunnel.serverclient">Figure 1</a>.
es: Hay múltiples formas de usar aplicaciones en I2P. Usando los <a href="%(i2ptunnel)s">I2PTunnel</a> puede utilizar aplicaciones normales sin que los programas tengan que tener soporte explícito para i2P. Esto es muy eficiente en escenarios cliente-servidor, cuando se necesita conectar con una sola web. Simplemente puede crear un túnel usando I2PTunnel para conectarse a la web, como se puede ver en la <a href="#tunnel.serverclient">Figura 1</a>.

source: If your application is distributed, it will require connections to a large amount of peers. Using I2PTunnel, you will need to create a new tunnel for each peer you want to contact, as shown in <a href="#tunnel.peertopeer">Figure 2</a>. This process can of course be automated, but running a lot of I2PTunnel instances creates a large amount of overhead. In addition, with many protocols you will need to force everyone to use the same set of ports for all peers - e.g. if you want to reliably run DCC chat, everyone needs to agree that port 10001 is Alice, port 10002 is Bob, port 10003 is Charlie, and so on, since the protocol includes TCP/IP specific information (host and port).
es: Si su aplicación es distribuida, requerirá la conexión de un gran número de pares. Usando un I2PTunnel necesitaría crear un túnel por cada para que quiera conectar, como se ve en la <a href="#tunnel.peertopeer">Figura 2</a>. Este procese puede ser automatizado, por supuesto, pero ejecutar muchas instancias de I2PTunnel crea mucha sobrecarga. Además, con muchos protocolos tendría que forzar a todos a usar los mismos puertos para todos los pares - por ejemplo, si desea habilitar DCC, todos necesitarían llegar al acuerdo de que el puerto 10001 es para Alice, el puerto 10002 para Bob, el puerto 10003 para Charlie, y así, ya que el protocolo incluye información específica TCP/IP (servidor y puerto).

source: General network applications often send a lot of additional data that could be used to identify users. Hostnames, port numbers, time zones, character sets, etc. are often sent without informing the user. As such, designing the network protocol specifically with anonymity in mind can avoid compromising user identities.
es: Las aplicaciones de red habitualmente envían mucha información adicional que puede identificar a los usuarios. Los nombres de los hosts, puertos, horarios, etc, a veces son enviados sin informar al usuario. Por lo que el diseñar los protocolos de red con el anonimato en mente puede evitar comprometer las identidades de los usuarios.

source: There are also efficiency considerations to review when determining how to interact on top of I2P. The streaming library and things built on top of it operate with handshakes similar to TCP, while the core I2P protocols (I2NP and I2CP) are strictly message based (like UDP or in some instances raw IP). The important distinction is that with I2P, communication is operating over a long fat network - each end to end message will have nontrivial latencies, but may contain payloads of up to several KB. An application that needs a simple request and response can get rid of any state and drop the latency incurred by the startup and teardown handshakes by using (best effort) datagrams without having to worry about MTU detection or fragmentation of messages.
es: También hay que tomar consideraciones sobre la eficiencia cuando se determina como funcionar sobre I2P. La librería de streaming y las cosas construidas sobre ellas funcionan con handshakes similares a los de TCP, mientras que los protocolos del núcleo de I2P (I2NP e I2CP) son estrictamente basados en mensajes (como UDP). La diferencia más importante es que con I2P las comunicaciones funcionan sobre una red grande y gorda, cada mensaje de fin a fin tendrá latencias no triviales, y puede contener cargas de varios KB. Una aplicación que necesite una simple petición y respuesta puede evitar cualquier estado y evitar los retardos con los handshakes de inicio usando (mejor esfuerzo) datagramas sin tener que preocuparse sobre la detección de MTU o la fragmentación de los mensajes.

source: Creating a server-client connection using I2PTunnel only requires creating a single tunnel.
es: Crear una conexión servidor-cliente usando un I2PTunnel sólo requiere crear un solo túnel.

source: Figure 1:
es: Figura 1:

source: Setting up connections for a peer-to-peer applications requires a very large amount of tunnels.
es: Configurar conexiones para aplicaciones p2p requiere un gran número de túneles.

source: Figure 2:
es: Fugura 2:

source: In summary, a number of reasons to write I2P-specific code:
es: En resumen, hay bastantes razones para escribir el código específico para I2P:

source: Creating a large amount of I2PTunnel instances consumes a non-trivial amount of resources, which is problematic for distributed applications (a new tunnel is required for each peer).
es: Crear un gran número de I2PTunnles consume una cantidad de recursos nada triviales, lo cual es problemático para las aplicaciones distribuidas (hace falta un nuevo túnel por cada par).

source: General network protocols often send a lot of additional data that can be used to identify users. Programming specifically for I2P allows the creation of a network protocol that does not leak such information, keeping users anonymous and secure.
es: Los protocolos de red generales a menudo envían mucha información adicional que puede usarse para identificar a los usuarios. Programar específicamente para I2P permite la creación de protocolos de red que no filtran dicha información no deseada, permitiendo que los usuarios permanezcan seguros y anónimos.

source: Network protocols designed for use on the regular internet can be inefficient on I2P, which is a network with a much higher latency.
es: Los protocolos de red diseñados para el Internet normal pueden ser ineficientes sobre I2P, que es una red con una latencia mayor.

source: I2P supports a standard <a href="%(plugins)s">plugins interface</a> for developers so that applications may be easily integrated and distributed.
es: I2P soporta un <a href="%(plugins)s">interfaz de plugins</a> estándar para los desarrolladores, con lo que las aplicaciones pueden ser integradas y distribuidas más fácilmente.

source: Applications written in Java and accessible/runnable using an HTML interface via the standard webapps/app.war may be considered for inclusion in the i2p distribution.
es: Las aplicaciones escritas en Java y accesibles/ejecutables usando un interfaz HTML a través de aplicaciones web estándar pueden considerarse para incluirse en la distribución I2P.

source: There are a few changes that require adjusting to when using I2P:
es: Hay varios cambios que se requieren ajustar cuando se usa I2P.

source: Destination ~= host+port
es: Destinación ~= host+puerto

source: An application running on I2P sends messages from and receives messages to a unique cryptographically secure end point - a "destination". In TCP or UDP terms, a destination could (largely) be considered the equivalent of a hostname plus port number pair, though there are a few differences.
es: Una aplicación ejecutándose sobre I2P envía un mensaje desde, y recibe mensajes hacia un único punto seguro criptográfico. - una "destinación". En términos de TCP y UDP una destinación puede ser considerada (en gran parte) el equivalente a un hostname más el par de números de puertos, aunque hay unas pocas diferencias.

source: An I2P destination itself is a cryptographic construct - all data sent to one is encrypted as if there were universal deployment of IPsec with the (anonymized) location of the end point signed as if there were universal deployment of DNSSEC.
es: Una destinación I2P es en sí misma una construcción criptográfica - toda la información enviada es cifrada tal y como si hubiera una implementación mundial de IPsec con la localización (anónima) del punto final firmado como si existiera una implementación universal de DNSSEC.

source: I2P destinations are mobile identifiers - they can be moved from one I2P router to another (or it can even "multihome" - operate on multiple routers at once). This is quite different from the TCP or UDP world where a single end point (port) must stay on a single host.
es: Las destinaciones de I2P son identificadores móviles - pueden ser movidas de un ruter I2P a otro ( o incluso pueden ser "multi-hogar" - funcionar en varios ruters a la vez). Esto es bastante diferente a como funcionan TCP y UDP, donde un un solo punto final (puerto) tiene que estar en un solo host.

source: I2P destinations are ugly and large - behind the scenes, they contain a 2048 bit ElGamal public key for encryption, a 1024 bit DSA public key for signing, and a variable size certificate, which may contain proof of work or blinded data.
es: Las destinaciones I2P son largas y feas - en el fondo contienen un clave pública ElGamal de 2048 bits para el cifrado, una calve pública DSA de 1024 bits para firmar, y un certificado de tamaño variable, que puede contener una prueba de trabajo realizado o información blindada.

source: There are existing ways to refer to these large and ugly destinations by short and pretty names (e.g. "irc.duck.i2p"), but those techniques do not guarantee globally uniqueness (since they're stored locally in a database on each person's machine) and the current mechanism is not especially scalable nor secure (updates to the host list are managed using "subscriptions" to naming services). There may be some secure, human readable, scalable, and globally unique, naming system some day, but applications shouldn't depend upon it being in place, since there are those who don't think such a beast is possible. <a href="%(naming)s">Further information on the naming system</a> is available.
es: Hay formas de referirse a esa larga y fea destinación acortándola con nombres bonitos (por ejemplo "irc.duck.i2p"), pero estas técnicas no garantizan una unicidad global (ya que están almacenadas localmente en la base de datos de la máquina de cada persona) y el mecanismo actual no es especialmente escalable o seguro (las actualizaciones de la lista de hosts son manejadas usando "suscripciones" a servicios de nombres). Quizás algún día habrá un sistema más seguro, legible por humanos, escalable y con unicidad global, pero las aplicaciones no deberían depender de su existencia, ya que hay gente que piensa que ese tipo de bestia no es posible. Hay disponible <a href="%(naming)s">más información sobre el sistema de nombres</a>.

source: While most applications do not need to distinguish protocols and ports, I2P <em>does</em> support them. Complex applications may specify a protocol, from port, and to port, on a per-message basis, to multiplex traffic on a single destination. See the <a href="%(datagrams)s">datagram page</a> for details. Simple applications operate by listening for "all protocols" on "all ports" of a destination.
es: Mientras que la mayoría de las aplicaciones no necesitan distinguir protocolos o puertos, I2P <em>si</em> los soporta. Las aplicaciones complejas pueden especificar un protocolo, desde un puerto, y hacia un puerto, en un mensaje, hacia tráfico múltiple o sobre una sola destinación. Vea la <a href="%(datagrams)s">página de datagrama</a> para más detalles. Las aplicaciones simples funciona escuchando por "todos los protocolos" sobre "todos los puertos" de una destinación.

source: Anonymity and confidentiality
es: Anonimato y confidencialidad.

source: I2P has transparent end to end encryption and authentication for all data passed over the network - if Bob sends to Alice's destination, only Alice's destination can receive it, and if Bob is using the datagrams or streaming library, Alice knows for certain that Bob's destination is the one who sent the data.
es: I2P tiene cifrado transparente y autenticación transparente de todos los datos que pasan por la red - si Bob envía a la destinación de Alice, sólo la destinación de Alice puede recibirlo, y si Bob está usando la librería de datagramas o streaming, Alice sabe seguro que la destinación de Bob es la que envió los datos.

source: Of course, I2P transparently anonymizes the data sent between Alice and Bob, but it does nothing to anonymize the content of what they send. For instance, if Alice sends Bob a form with her full name, government IDs, and credit card numbers, there is nothing I2P can do. As such, protocols and applications should keep in mind what information they are trying to protect and what information they are willing to expose.
es: Por supuesto, I2P anonimiza transparentemente los datos enviados entre Alice y Bob, pero no hace nada para anonimizar el contenido de lo que envían. Por ejemplo, si Alice envía a Bob un formulario con su nombre completo, ID del gobierno, y los números de sus tarjetas de crédito, no hay nada que I2P pueda hacer. Por eso, los protocolos y las aplicaciones deben tener en cuenta qué información están intentando proteger y qué información desean exponer.

source: I2P datagrams can be up to several KB
es: Los datagramas I2P pueden ser hasta de varios KB

source: Applications that use I2P datagrams (either raw or repliable ones) can essentially be thought of in terms of UDP - the datagrams are unordered, best effort, and connectionless - but unlike UDP, applications don't need to worry about MTU detection and can simply fire off large datagrams. While the upper limit is nominally 32 KB, the message is fragmented for transport, thus dropping the reliability of the whole. Datagrams over about 10 KB are not currently recommended. See the <a href="%(datagrams)s">datagram page</a> for details. For many applications, 10 KB of data is sufficient for an entire request or response, allowing them to transparently operate in I2P as a UDP-like application without having to write fragmentation, resends, etc.
es: Las aplicaciones que usan datagramas I2P (ya sean en bruto o respondibles) pueden entenderse en términos de UDP - los datagramas no están ordenados, mejor esfuerzo, y sin-conexión - pero al contrario que UDP, las aplicaciones no tienen que preocuparse de la detección MTU y pueden simplemente enviar datagramas grandes. Cuando normalmente el límite superior es de 32 KB, el mensaje es troceado para el transporte, bajando la confiabilidad del todo. No se recomiendan datagramas de más de 10 KB. Ve la <a href="%(datagrams)s">página de los datagramas</a> para más detalles. Para muchas aplicaciones, esos 10 KB de datos es suficiente para una petición o respuesta completa, permitiendoles operar transparentemente en I2P como una aplicación tipo UDP si tener que crear fragmentaciones, re-eenvíos, etc.

source: There are several means of sending data over I2P, each with their own pros and cons. The streaming lib is the recommended interface, used by the majority of I2P applications.
es: Hay varias formas de enviar datos sobre I2P, cada una con sus ventajas e inconvenientes. La librería de streaming es el interfaz recomendado, usado por la mayoría de las aplicaciones de I2P.

source: Streaming Lib
es: Librería Streaming

source: The <a href="%(streaming)s">full streaming library</a> is now the standard interface. It allows programming using TCP-like sockets, as explained in the <a href="#start.streaming">Streaming development guide</a>.
es: La <a href="%(streaming)s">librería de streaming completa</a> es ahora mismo el interfaz estándar. Permite programar usando sockets al estilo TCP, como se explica en la <a href="#start.streaming">guía de desarrollo de Streaming</a>.

source: BOB is the <a href="%(bob)s">Basic Open Bridge</a>, allowing an application in any language to make streaming connections to and from I2P. At this point in time it lacks UDP support, but UDP support is planned in the near future. BOB also contains several tools, such as destination key generation, and verification that an address conforms to I2P specifications. Up to date info and applications that use BOB can be found at this <a href="http://%(boburl)s/">eepsite</a>.
es: BOB es el <a href="%(bob)s">Basic Open Bridge, puente básico abierto/libre</a>, permite a cualquier aplicación en cualquier lenguaje hacer conexiones de streaming hacia y desde I2P. En este momento aún le falta el soporte UDP, pero el soporte UDP está planeado para un futuro cercano. BOB además contiene varias herramientas, como el generar claves de destino, y el verificar que una dirección se ajusta a las especificaciones de I2P. Información actualizada y una lista de aplicaciones que usan BOB pueden encontrarse en esta <a href="http://%(boburl)s/">eepsite</a>.

source: SAM is not recommended. SAM V2 is okay, SAM V3 is recommended.
es: No se recomienda SAM, SAM v2 vale, pero se recomienda SAM v3

source: SAM is the <a href="%(sam)s">Simple Anonymous Messaging</a> protocol, allowing an application written in any language to talk to a SAM bridge through a plain TCP socket and have that bridge multiplex all of its I2P traffic, transparently coordinating the encryption/decryption and event based handling. SAM supports three styles of operation:
es: SAM es el protocolo de <a href="%(sam)s">Simple Anonymous Messaging, mensajería anónima simple</a>, que permite a una aplicación escrita en cualquier lenguaje entenderse con el puente SAM a través de sockets TCP y en donde ese puente multiplexa todo su tráfico I2P, coordinando el cifrado/descifrado transparentemente y el manejo de los eventos. SAM soporta tres tipos de operaciones:

source: streams, for when Alice and Bob want to send data to each other reliably and in order
es: streams, para cuando Alice y Bob quieren enviar datos de uno a otro seguramente y en orden

source: repliable datagrams, for when Alice wants to send Bob a message that Bob can reply to
es: datagramas respondibles, para cuando Alice quiere enviar a Bob un mensaje al que Bob puede responder.

source: raw datagrams, for when Alice wants to squeeze the most bandwidth and performance as possible, and Bob doesn't care whether the data's sender is authenticated or not (e.g. the data transferred is self authenticating)
es: datagramas en bruto, para cuando Alice quiere ahorrar el máximo ancho de banda y obtener el mejor rendimiento, y a Bob no le importa si la información del remitente está autentificada o no (por ejemplo cuando los datos transferidos ya son auto autentificables)

source: SAM V3 aims at the same goal as SAM and SAM V2, but does not require multiplexing/demultiplexing. Each I2P stream is handled by its own socket between the application and the SAM bridge. Besides, datagrams can be sent and received by the application through datagram communications with the SAM bridge.
es: SAM V3 apunta hacia la misma meta que SAM y SAM V2, pero no requiere multiplexado/demultiplexado. Cada flujo (`stream`) I2P es gestionado por su propio socket entre la aplicación y la pasarela (`bridge`) SAM. Además, pueden ser enviados y recibidos datagramas mediante la aplicación a través de comunicaciones de datagrama con la pasarela SAM.

source: <a href="%(samv2)s">SAM V2</a> is a new version used by imule that fixes some of the problems in <a href="%(sam)s">SAM</a>. <br /> <a href="%(samv3)s">SAM V3</a> is used by imule since version 1.4.0.
es: <a href="%(samv2)s">SAM V2</a> es una nueva versión usada por imule que resuelve alguno de los problemas en <a href="%(sam)s">SAM</a>. <br /> <a href="%(samv3)s">SAM V3</a> es usado desde la versión 1.4.0 de imule.

source: The I2PTunnel application allows applications to build specific TCP-like tunnels to peers by creating either I2PTunnel 'client' applications (which listen on a specific port and connect to a specific I2P destination whenever a socket to that port is opened) or I2PTunnel 'server' applications (which listen to a specific I2P destination and whenever it gets a new I2P connection it outproxies to a specific TCP host/port). These streams are 8-bit clean, and are authenticated and secured through the same streaming library that SAM uses, but there is a nontrivial overhead involved with creating multiple unique I2PTunnel instances, since each have their own unique I2P destination and their own set of tunnels, keys, etc.
es: La aplicación I2PTunnel permite a otras aplicaciones establecer túneles específicos tipo-TCP hacia los pares ('peers'), creando tanto aplicaciones I2PTunnel 'cliente' (que escuchan en un puerto específico y se conectan a un destino I2P específico cuando un socket hacia ese puerto se abre) como aplicaciones I2PTunnel 'servidor' (que escuchan un destino I2P específico y cuando reciben una nueva conexión I2P se interponen repitiéndola hacia un anfitrión('host')/puerto específico). Estos flujos ('streams') son puros de 8-bits ('8-bit clean') y son autentificados y asegurados a través de la misma librería que usa SAM, pero crear múltiples instancias I2PTunnel únicas reviste una sobrecarga no trivial, ya que cada una tiene su propio destino único I2P y su propio grupo de túneles, claves, etc.
