Repository: Artogn/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/get-involved.po
Languages: es

source: To compile the code, you need the Sun Java Development Kit 6 or higher, or equivalent JDK (<a href="%(sunjdk6)s">Sun JDK 6</a> strongly recommended) and <a href="http://ant.apache.org/">Apache ant</a> version 1.7.0 or higher. If you go are working on the main I2P code, you can go into the i2p.i2p directory and run 'ant' to see the build options.
es: Para compilar el código necesita Sun Java Development Kit 6 o mayor, o el JDK equivalente (<a href="%(sunjdk6)s">Sun JDK 6</a> recomendado) y <a href="http://ant.apache.org/">Apache ant</a> versión 1.7.0 o mayor. Si va a trabajar en al código principal de I2P puede entrar al directorio i2p.i2p y ejecutar 'ant' para ver las opciones de compilación.

source: To build or work on console translations, you need the xgettext, msgfmt, and msgmerge tools from the <a href="http://www.gnu.org/software/gettext/">GNU gettext package</a>.
es: Para trabajar en la traducción de la consola necesita las herramientas gettext, msgfmt, y msgmerge del <a href="http://www.gnu.org/software/gettext/">paquete GNU gettext</a>.

source: For development on new applications, see the <a href="%(apps)s">application development guide</a>.
es: Para programar nuevas aplicaciones vea la <a href="%(apps)s">guía de desarrollo de aplicaciones</a>.

source: See <a href="http://%(zzz)s/forums/3">zzz's TODO lists</a>, <a href="%(todo)s">this website's TODO list</a> or <a href="%(trac)s">Trac</a> for ideas.
es: Para hacerse una idea vea la <a href="http://%(zzz)s/forums/3">listaTODO, por hacer, de zzz</a>, <a href="%(todo)s">el TODO de esta web</a> o el <a href="%(trac)s">Trac</a>.

source: See the bottom of <a href="%(licenses)s#commit">the licenses page</a> for commit privilege requirements. You need these to put code into i2p.i2p (not required for the website!).
es: Mira en la parte de abajo de <a href="%(licenses)s#commit"> la página de licencias</a> para conocer los requisitos. Los necesita para poder aportar código a i2p.i2p (¡pero no para la página web!)

source: Short version of how to generate and use keys if you plan to commit:
es: Versión corta de cómo generar y usar las claves si tiene planeado hacer aportes:

source: use an empty passphrase
es: use una contraseña vacía, sin contraseña

source: enter a passphrase
es: escriba una contraseña

source: <a href="mailto:%(email)s">send</a> this to a mtn repo operator to get push privileges
es: <a href="mailto:%(email)s">envíe</a> esto al administrador del repositorio de mtn para tener permisos para aportar:

source: send this to <a href="mailto:%(email)s">a release manager</a> to get commit privileges - not required for website
es: envíe esto al <a href="mailto:%(email)s">encargado de las versiones</a> para obtener los permisos para aportar - no se requiere para la página web

source: check in with this key
es: loguee con esta clave

source: push with this key
es: envíe los cambios al servidor con esta clave

source: Long version: see the <a href="%(monotone)s">monotone page</a>.
es: Versión completa: vea la <a href="%(monotone)s">web de monotone</a>.

source: The developers hang around on IRC. They can be reached on the Freenode network, OFTC, and on the I2P internal networks. The usual place to look is #i2p-dev. Join the channel and say hi! We also have <a href="%(guidelines)s">additional guidelines for regular developers</a>.
es: Los desarrolladores suelen estar en el IRC. Puede contactar con ellos en la red Freenode, OFTC, y en la en el IRC de I2P. El lugar usual es #i2p-dev. ¡Únase al canal y diga hola!. También hay <a href="%(guidelines)s">guías adicionales para desarrolladores</a>.

source: Website and router console translators: See the <a href="%(newtrans)s">New Translator's Guide</a> for next steps.
es: Traductores de la consola del ruter y la página web: Vea la <a href="%(newtrans)s">guía de nuevos traductores</a>.

source: I2P is open source software that is mostly developed using open sourced toolkits. The I2P project recently acquired a license for the YourKit Java Profiler. Open source projects are eligible to receive a free license provided that YourKit is referenced on the project web site. Please get in touch if you are interested in profiling the I2P codebase.
es: I2P es una aplicación de código libre y es desarrollada usando herramientas libres. El proyecto I2P ha adquirido recientemente una licencia para YourKit Java Profiler. Los proyectos libres pueden obtener una licencia gratis mientras se haga referencia a YourKit en las webs del proyecto. Por favor pónganse en contacto su está interesado en la depuración y optimización del código base de I2P.

source: YourKit is kindly supporting open source projects with its full-featured Java Profiler. YourKit, LLC is the creator of innovative and intelligent tools for profiling Java and .NET applications. Take a look at YourKit's leading software products: <a href="%(java)s">YourKit Java Profiler</a> and <a href="%(dotnet)s">YourKit .NET Profiler</a>.
es: YourKit está apoyando amablemente a los proyectos libres con el Java Profiler completo. LLC es el creador de inteligentes e innovadoras herramientas para el desarrollo de aplicaciones JAVA y .NET. Échele un ojo a los productos principales de YourKit: <a href="%(java)s">YourKit Java Profiler</a> y <a href="%(dotnet)s">YourKit .NET Profiler</a>.

source: New Translator's Guide
es: Guía para el nuevo traductor

source: Here's a very quick guide to getting started.
es: Aquí hay a guía rápida para comenzar.

source: How to Translate the Website
es: Cómo traducir la página web

source: Translation of the website is done with .po files. The easiest way by far to translate the website is to sign up for an account at <a href="%(transifex)s">Transifex</a> and request to join a translation team. Alternatively it can be done "the old way" as outlined below.
es: La traducción de las páginas web se hace con archivos .po. La forma mas fácil con diferencia para traducir una página web es crearse una cuenta en <a href="%(transifex)s">Transifex</a> y solicitar unirse aun grupo de traducción. Alternativamente se puede hacer a la "forma antigua " como se muestra debajo.

source: Preparation
es: Preparación

source: Come to #i2p-dev on irc and talk to people. Claim the language - To make sure other coworkers don't bump onto the files you are working on, please update the translation status on <a href="%(url)s">this wiki page</a>.
es: Venga a #i2p-dev en el IRC para hablar con la gente. Reclame el idioma - Para asegurarse de que otros colaboradores no trabajen sobre los ficheros sobre los que usted está trabajando, actualice el estatus de la traducción en <a href="%(url)s">esta página wiki</a>.

source: Follow the <a href="%(newdevs)s">new developer's guide</a>, Including the installation of monotone, checking out i2p.www branch, and generate your own monotone keys. It is not required that you sign a dev agreement.
es: Siga la <a href="%(newdevs)s">Guía para el nuevo desarrollador</a>, que incluye la instalación de monotone, comprobación (`checkout`) del ramal de desarrollo (`branch`) i2p.www, y la generación de sus propias claves monotone. No se requiere que firme un nuevo acuerdo de desarrollador.

source: <b>Create files:</b> If the file for your language does not exist yet:
es: <b>Cree ficheros</b> si el fichero para su idioma no existe aún:

source: Run "<code>./extract-messages.sh</code>" to generate a <code>messages.pot</code> in the base directory. Edit the header of this file, then run "<code>./init-new-po.sh locale</code>" to generate the file <code>i2p2www/translations/locale/LC_MESSAGES/messages.po</code>. "<code>mtn add</code>" this file.
es: Ejecute "<code>./extract-messages.sh</code>" para generar <code>messages.pot</code> en el directorio base. Edite la cabecera de este archivo, y entonces ejecute "<code>./init-new-po.sh locale</code>" para generar el archivo <code>i2p2www/translations/locale/LC_MESSAGES/messages.po</code>. "<code>mtn add</code>" este archivo.

source: Edit <code>i2p2www/pages/global/lang.html</code> and add a line for your language (copy an existing line).
es: Edite <code>i2p2www/pages/global/lang.html</code> y añada una línea para su idioma (replique una existente).

source: Add a flag image file to <code>i2p2www/static/images/flags/</code> for the menu (copy from the router).
es: Añada un archivo de imagen con una bandera a <code>i2p2www/static/images/flags/</code> para el menú (cópielo desde el enrutador (`router`)).

source: <b>Edit files:</b> Edit <code>i2p2www/translations/locale/LC_MESSAGES/messages.po</code>. To work with .po files efficiently, you may wish to use <a href="http://www.poedit.net/download.php">POEdit</a>
es: <b>Edite los ficheros:</b> Edite <code>i2p2www/translations/locale/LC_MESSAGES/messages.po</code>. Para trabajar con ficheros .po eficientemente, podría querer usar <a href="http://www.poedit.net/download.php">POEdit</a>

source: <b>Check in:</b> "<code>mtn pull</code>", "<code>mtn update</code>". Then check in by "<code>mtn ci -k yourname@mail.i2p file1 file2 ...</code>" This collects the diff info of your changed file into your local repo. Then "<code>mtn sync mtn.i2p2.de -k yourname-transport@mail.i2p i2p.i2p</code>". This synchronizes your local repo with the repo on the target machine.
es: <b>Regístrelos:</b> Haga "<code>mtn pull</code>", "<code>mtn update</code>". Luego regístrelos como "<code>mtn ci -k yourname@mail.i2p file1 file2 ...</code>". Esto recopila la información de diferencias (diff) de su archivo modificado en su repositorio local. Entonces haga "<code>mtn sync mtn.i2p2.de -k yourname-transport@mail.i2p i2p.i2p</code>". Esto sincroniza su repositorio local con el respositorio en la máquina objetivo.

source: Repeat. Check in often. Don't wait until it is perfect.
es: Repita. Registre traducciones con frecuencia. No espere hasta que estén perfectas.

source: How to Translate the Router Console
es: Cómo traducir la consola del enrutador (`router`)

source: The easiest way by far to translate the router console is to sign up for an account at <a href="%(transifex)s">Transifex</a> and request to join a translation team. Alternatively it can be done "the old way" as outlined below.
es: La forma más fácil de largo para traducir la consola del enrutador (`router`) es abrir una cuenta en <a href="%(transifex)s">Transifex</a> y solicitar unirse a un equipo de traducción. Alternativamente puede hacerse "a la vieja usanza" como se describe debajo.

source: Follow the <a href="%(newdevs)s">new developer's guide</a>, including the installation of monotone and the gettext tools, checking out i2p.i2p branch, and generate your own monotone keys.
es: Siga la <a href="%(newdevs)s">Guía para el nuevo desarrollador</a>, que incluye la instalación de monotone y las herramientas gettext, la comprobación (`checkout`) del ramal de desarrollo (`branch`) i2p.i2p , y genere sus propias claves monotone.

source: Generate your own gpg key and sign the dev agreement.
es: Genere su propia clave GPG y firme el acuerdo de desarrollador.

source: Before starting a console translation, better help translate some i2p webpages first. At least an i2p homepage in your language would be great.
es: Antes de inciar una traducción de la consola, mejor ayude primero a traducir alguna de las páginas web de I2P. Sería genial si al menos tradujera la página principal de I2P a su idioma.

source: <b>What to translate:</b> There are about 15 files in the i2p.i2p branch that needs translation:
es: <b>Qué traducir:</b> Hay cerca de 15 ficheros en el ramal de desarrollo (`branch`) i2p.i2p que precisan traducción:

source: Where xx is your language code like fr/de/ch/zh/... There may be or may not be files with your lang code. If not, you can create your own. by copying and renaming other language files you know with your own lang code.
es: Donde xx es su código de idioma como fr/de/ch/zh... Podría o no haber archivos con su código de idioma. Si no, puede crear los suyos propios copiando y renombrando otros ficheros de idiomas con su propio código de idioma.

source: <b>Create files:</b> If the file for your language does not exist yet, copy another language file to a new file <code>foo_xx.bar</code> for your language. Then "<code>mtn add</code>" the file. After creating a .po file, edit the headers. Then run "<code>ant distclean poupdate</code>".
es: <b>Cree los ficheros:</b> Si el fichero para su idioma no existe aún, copie otro fichero de idioma a un nuevo fichero <code>foo_xx.bar</code> para su idioma. Entonces haga "<code>mtn add</code>" sobre el fichero. Después de crear un fichero .po, edite las cabeceras. Luego ejecute <code>ant distclean poupdate</code>".

source: <b>Start to work:</b> Edit the HTML files with any text editor. Be sure not to use an editor in HTML mode that reformats everything. To work with .po files efficiently, you may wish to use <a href="http://www.poedit.net/download.php">POEdit</a>
es: <b>Comience a trabajar:</b> Edite los ficheros HTML con cualquier editor de texto. Asegúrese de no usar un editor en modo HTML que reformatee todo. Para trabajar con ficheros .po eficientemente, podría querer usar <a href="http://www.poedit.net/download.php">POEdit</a>

source: As you can see, it's not that difficult. If you have questions about the meaning of the terms in the console, ask in <code>#i2p-dev</code> on IRC.
es: Como puede ver, no es tan difícil. Si tiene preguntas acerca del significado de los términos en la consola, pregunte en <code>#i2p-dev</code> en el IRC.

source: FAQ
es: Preguntas frecuentes

source: Q: Why do I have to install monotone, Java, jsp, learn about .po files and html, etc.? Why can't I just do a translation and email it to you?
es: P: ¿Por qué tengo que instalar Monotone, Java, JSP, aprender acerca de los ficheros .po y HTML, etc.? ¿Por qué no puedo simplemente hacer una traducción y enviársela vía email?

source: A: Several reasons:
es: R: Por diferentes razones:

source: You might be interested in translating via Transifex. Request to join a translation team <a href="%(transifex)s">here</a>.
es: Podría estar interesado en traducir a través de Transifex. Solicite unirse a un equipo de traducción <a href="%(transifex)s">aquí</a>.

source: We don't have anybody who has time to accept manual contributions and submit them to our source control system on your behalf. Even if we did, it doesn't scale.
es: No tenemos a nadie que tenga tiempo para aceptar contribuciones manuales y las entregue a nuestro sistema de control de código fuente en su lugar. Incluso si lo hicieramos, no sería adecuado.

source: Maybe you are thinking translation is a one-step process. It isn't. You can't do it all at once. You will make mistakes. You need to test it and tweak it to make it look right <i>before</i> you submit it. Developers will update or add to the English text, thus requiring a translation update.
es: Quizá esté pensando que la traducción es un proceso de un sólo paso. No lo es. No puede hacerlo todo de una vez. Cometerá errores. Ha de probarla y ajustarla para hacer que luzca correcta <i>antes</i> de entregarla. Los desarrolladores actualizarán o añadirán sobre el texto en Inglés, y así será como soliciten una actualización de la traducción.

source: Having translators use a source control system directly provides authentication and accountablility - we know who is doing what, and we can track changes, and revert them if necessary.
es: Hacer que los traductores usen directamente un sistema de control de código fuente proporciona autentificación y registrabilidad - conocemos quién está haciendo qué, y podemos seguir los cambios y revertirlos si fuese necesario.

source: .po files are not difficult. If you don't want to work directly with them, we recommend 'poedit'.
es: Los ficheros .po no son difíciles. Si no quiere trabajar directamente con ellos, le recomendamos 'poedit'.

source: HTML files are not difficult. Just ignore the html stuff and translate the text.
es: Los ficheros HTML no son difíciles. Tan sólo ignore todo el material HTML y traduzca el texto.

source: Installing and using monotone is not that difficult. Several of the translators and other contributors to I2P are non-programmers, and they use monotone regularly. Monotone is simply a source control system, it is not about "coding".
es: Instalar y usar Monotone no es tan difícil. Varios de los traductores y otros contribuidores a I2P son no-programadores, y usan Monotone regularmente. Monotone es sencillamente un sistema de control de código fuente, no tiene que ver con la "programación".

source: Our items to translate are not "documents". They are html files and po files, with a specific format and character encoding (UTF-8) that must be maintained, and not corrupted by email programs or other methods of transfer.
es: Nuestros elementos a traducir no son "documentos". Son ficheros HTML y ficheros .po, con un formato específico y una codificación de caracteres (UTF-8), que debe mantenerse y no corromperse por programas de email u otros métodos de transferencia.

source: We looked at 'pootle' as a front-end for translators. It didn't work well, needed an administrator, and a pootle-based process would suffer from a number of the above flaws.
es: Nos fijamos en 'pootle' como una herramienta intermedia para traductores. No funcionó bien, necesitaba un administrador, y un proceso basado-en-pootle adolecería de algunos de los defectos anteriores.

source: <b>In summary:</b> Yes, we know it is somewhat of a hurdle to get started. It's really the only possible way we can do it. Give it a try, it really isn't that hard.
es: <b>En resumen:</b> Sí, sabemos que comenzar es como una carrera de obstáculos. En realidad es la única forma posible de la que podemos hacerlo. Inténtelo, realmente no es tan difícil.

source: More Information
es: Más información

source: The #i2p-dev channel on IRC, or the <a href="http://%(zzz)s/forums/14">translation forum on %(zzz)s</a>.
es: El canal #i2p-dev del IRC, o el <a href="http://%(zzz)s/forums/14">forum de traducción en %(zzz)s</a>.
