Repository: Artogn/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/get-involved.po
Languages: es

source: Keys for zzz, Complication and welterde are provided clearsigned. The key for jrandom must be verified differently, since he's away, and only left a binary detached signature for his key.
es: Las claves para `zzz`, `Complication` y `welterde` se proporcionan firmadas de forma transparente (`clearsigned`). La clave para `jrandom` debe ser verificada de forma diferente, ya que él está fuera y sólo dejó una firma adosada (`detached signature`) binaria para su clave.

source: Monotone keys for zzz
es: Claves Monotone para `zzz`.

source: Monotone keys for welterde
es: Claves Monotone para `welterde`.

source: Monotone keys for Complication
es: Claves Monotone para `Complication`

source: Monotone keys for jrandom
es: Claves Monotone para `jrandom`

source: Others
es: Otros

source: <u>Tip:</u> To find zzz's GPG key, on his eepsite locate the key `0xA76E0BED`, with the name `zzz@mail.i2p` and the fingerprint `4456 EBBE C805 63FE 57E6 B310 4155 76BA A76E 0BED`.
es: <u>Consejo:</u> Para encontrar la clave GPG de `zzz`, localice en su eepsite la clave `0xA76E0BED`, con el nombre `zzz@mail.i2p` y la huella de validación de clave (`fingerprint`) `4456 EBBE C805 63FE 57E6 B310 4155 76BA A76E 0BED`.

source: <b>Tip:</b> To find welterde's GPG key, on public keyservers locate the key `0x62E011A1`, with the name `welterde@arcor.de` and the fingerprint `6720 FD81 3872 6DFC 6016 64D1 EBBC 0374 62E0 11A1`.
es: <b>Consejo:</b> Para encontrar la clave GPG de `welterde`, localice en los servidores públicos de claves la clave `0x62E011A1`, con el nombre `welterde@arcor.de` y la huella de validación de clave (`fingerprint`) `6720 FD81 3872 6DFC 6016 64D1 EBBC 0374 62E0 11A1`.

source: <b>Tip:</b> To find Complication's GPG key, on his eepsite locate the key `0x79FCCE33`, with the name `complication@mail.i2p` and the fingerprint `73CF 2862 87A7 E7D2 19FF DB66 FA1D FC6B 79FC CE33`.
es: <b>Consejo:</b> Para encontrar la clave GPG de `Complication`, localice en su eepsite la clave `0x79FCCE33`, con el nombre `complication@mail.i2p` y la huella de validación de clave (`fingerprint`) `73CF 2862 87A7 E7D2 19FF DB66 FA1D FC6B 79FC CE33`.

source: <b>Tip:</b> To find jrandom's GPG key for Syndie releases, on public keyservers locate the key `0x393F2DF9`, with the name `syndie-dist-key@i2p.net` and the fingerprint `AE89 D080 0E85 72F0 B777 B2ED C2FA 68C0 393F 2DF9`.
es: <b>Consejo:</b> Para encontrar la clave GPG de `jrandom` para versiones de Syndie, localice en los servidores públicos de claves la clave `0x393F2DF9`, con el nombre `syndie-dist-key@i2p.net` y la huella de validación de clave (`fingerprint`) `AE89 D080 0E85 72F0 B777 B2ED C2FA 68C0 393F 2DF9`.

source: Jrandom had to leave unexpectedly in the end of 2007. His commit key was deployed in the Syndie Monotone repository, in a file named `mtn-committers`. That file also had a GPG signature, `mtn-committers.sig`, but it was a binary detached signature. I am going to supply both files in GPG ASCII-armoured form below.
es: `jrandom` tuvo que abandonar inesperadamente al final de 2007. Su clave de consignación (`commit`) fue desplegada en el repositorio Monotone de Syndie, en un fichero llamado `mtn-committers`. Ese fichero también tuvo una firma GPG, `mtn-committers.sig`, pero era una firma adosada (`detached signature`) binaria. Voy a suministrar ambos ficheros en la forma GPG con-armadura-ASCII (`ASCII-armoured`) siguiente.

source: First, the file `mtn-committers` containing jrandom's Monotone key. Save as `mtn-committers.asc` and unpack it using `gpg --output mtn-committers --dearmor mtn-committers.asc`:
es: Primero, el fichero `mtn-committers` conteniendo la clave Monotone de `jrandom`. Guárdelo como `mtn-committers.asc` y desempaquételo usando `gpg --output mtn-committers --dearmor mtn-committers.asc`:

source: Now the file `mtn-committers.sig`, containing the GPG signature. Save as `mtn-committers.sig.asc` and unpack it using `gpg --output mtn-committers.sig --dearmor mtn-committers.sig.asc`. Use it to verify the above supplied `mtn-committers` file:
es: Ahora el fichero `mtn-committers.sig`, que contiene la firma GPG. Guárdelo como `mtn-committers.sig.asc` y desempaquételo usando `gpg --output mtn-committers.sig --dearmor mtn-committers.sig.asc`. Úselo para verificar el fichero `mtn-committers` suministrado anteriormente.

source: Some of the developers have included their Monotone keys in their <a href="%(licenseagreements)s">signed license agreement</a>.
es: Alguno de los desarrolladores ha incluído sus claves Monotone en sus <a href="%(licenseagreements)s">acuerdos de licencia firmados</a>.

source: Developer Guidelines and Coding Style
es: Estilo del código y pautas a seguir para los desarrolladores.

source: Read the <a href="%(newdevs)s">new developers guide</a> first.
es: Primero lea <a href="%(newdevs)s">la guía para nuevos programadores</a>.

source: Basic Guidelines and Coding Style
es: Pautas básicas y estilo del código

source: Most of the following should be common sense for anybody who has worked on open source or in a commercial programming envrionment. The following applies mostly to the main development branch i2p.i2p. Guidelines for other branches, plugins, and external apps may be substantially different; check with the appropriate developer for guidance.
es: La mayor parte de lo siguiente debería ser de sentido común para cualquiera que haya trabajado para proyectos de código libre o en ambientes de desarrollo comerciales. Lo siguiente se aplica sobre todo para el desarrollo de la rama principal i2p.i2p. Las guías para otras ramas, pluguins y aplicaciones externas pueden ser bastante diferentes, pregúntele al desarrollador indicado en tal caso.

source: Community
es: Comunidad

source: Please don't just "write code". If you can, participate in other development activities, including: development discussions and support on IRC, zzz.i2p, and forum.i2p; testing; bug reporting and responses; documentation; code reviews; etc.
es: Por favor no sólo "escriba código". Si puede, participe en otras actividades de desarrollo como: discusiones sobre el desarrollo y soporte en el IRC, zzz.i2p, y el foro de.i2p; reporte y solución de errores; documentación, revisión del código, etc.

source: Active devs should be available periodically on IRC #i2p-dev. Be aware of the current release cycle. Adhere to release milestones such as feature freeze, tag freeze, and the checkin deadline for a release.
es: Los programadores activos deberían estar disponibles periódicamente en el canal #i2p-dev del IRC. Tenga en cuenta el ciclo de liberación de versiones actual. Fix this! not translated all yet!!!

source: Have a basic understanding of distributed source control systems, even if you haven't used monotone before. Ask for help if you need it. Once pushed, checkins are forever, there is no undo. Please be careful. If you have not used monotone before, start with baby steps. Check in some small changes and see how it goes.
es: Debe tener conocimientos básicos del funcionamiento de sistemas de control de código, incluso si nunca ha usado monotone antes. Pida ayuda si lo necesita. Una vez subido algo no hay vuelta atrás, no se puede deshacer, por favor tenga cuidado. Si nunca ha usado monotone antes empiece con mucho cuidado. Suba pequeños cambios y observe como funciona.

source: Test your changes before checking them in. If you prefer the checkin-before-test development model, use your own development branch (e.g. i2p.i2p.yourname.test) and propagate back to i2p.i2p once it is working well. Do not break the build. Do not cause regressions. In case you do (it happens), please do not vanish for a long period after you push your change.
es: Pruebe los cambios antes de subirlos. Si prefiere el modelo de desarrollo subir-antes-de-probar use su propia rama de desarrollo (por ejemplo i2p.i2p.yourname.test) y envíelo de vuelta a i2p.i2p una vez que funcione correctamente. No rompa la compilación. No cree regresiones. En caso de que lo haga (a veces ocurre), no desaparezca por mucho tiempo antes de subir el cambio.

source: If your change is non-trivial, or you want people to test it and need good test reports to know whether your change was tested or not, add a checkin comment to history.txt and increment the build revision in RouterVersion.java.
es: Si su cambio no es trivial, o desea que otra gente lo pruebe y necesita reportes fiables para saber si su cambio ha sido probado o no, añada un comentario de confirmación en history.txt e incremente la versión de compilación en RouterVersion.java.

source: Ensure that you have the latest monotonerc file in _MTN. Do not check in on top of untrusted revisions.
es: Asegúrese de que tiene la última versión del archivo monotonerc en _MTN. No lo sobrescriba con versiones no confiables.

source: Ensure that you pull the latest revision before you check in. If you inadvertently diverge, merge and push as soon as possible. Don't routinely make others merge for you. Yes, we know that monotone says you should push and then merge, but in our experience, in-workspace merge works just as well as in-database merge, without creating a merge revision.
es: asegúrese que ha descargado la última revisión antes de subir los cambios. Si crea un divergencia accidentalmente, una y suba tan pronto como sea posible. No haga que otros lo fusionen rutinariamente por usted. Si, sabemos que monotone indica que debe subir y unir, pero por nuestra experiencia sabemos que funciona tan bien la unión in-workspace como la unión n-database si crear una revisión de unión.

source: Do not check in major changes into the main i2p.i2p branch late in the release cycle. If a project will take you more than a couple days, create your own branch in monotone and do the development there so you do not block releases.
es: No suba cambios grandes a la rama principal i2p.i2p al final del ciclo de versión. Si un proyecto va a tardar más de varios días, cree su propia rama de monotone y programe allí para no no bloquear la salida de nueva versiones.

source: Coding Style
es: Estilo de programación

source: Coding style throughout most of the code is 4-spaces for indentation. Do not use tabs. Do not reformat code. If your IDE or editor wants to reformat everything, get control of it. Yes, we know 4 spaces is a pain, but perhaps you can configure your editor appropriately. In some places, the coding style is different. Use common sense. Emulate the style in the file you are modifying.
es: El código de estilo en la mayoría de los casos es de usar la sangría de 4 espacios. No use tabulación. No cambie el formato del código. Si su editor o IDE quiere cambiar el formato configúrelo para que no lo haga. Sí, sabemos que usar 4 espacios es doloroso, pero probablemente pueda configurar su editor apropiadamente. En algunos casos el estilo de programar es diferente, use el sentido común, emule el estilo del archivo que está modificando.

source: New classes and methods require at least brief javadocs. Add @since release-number.
es: Las nuevas clases y métodos necesitan al menos un javadocs básico. Añada @since numero-versión.

source: Classes in core/ (i2p.jar) and portions of i2ptunnel are part of our official API. There are several out-of-tree plugins and other applications that rely on this API. Be careful not to make any changes that break compatibility. Don't add methods to the API unless they are of general utility. Javadocs for API methods should be clear and complete. If you add or change the API, also update the documentation on the website (i2p.www branch).
es: Las clases del núcleo/ (i2p.jar) y partes de i2ptunnel están incluidas en el API oficial. Hay varios pluguins y otras aplicaciones que dependen de este API. Tenga cuidado de no hacer cambios que rompan la compatibilidad. No añada métodos al API a no ser que sean de utilidad general. Los Javadocs de los métodos del API deben ser claros y completos. Si añade cambios al API, debe también actualizar la documentación en la web (i2p.www branch).

source: Tag strings for translation where appropriate. Don't change existing tagged strings unless really necessary, as it will break existing translations. Do not add or change tagged strings after the "tag freeze" in the release cycle so that translators have a chance to update before the release.
es: Incluya cadenas de texto para la traducción cuando sea apropiado. No cambie las cadenas ya etiquetadas a no ser que sea necesario ya que rompería las traducciones existentes. No añada o cambie las cadenas después del "tag freeze" durante la liberación de la versión, así los programadores tienen la oportunidad de actualizarlo antes de su liberación

source: Use generics and concurrent classes where possible. I2P is a highly multi-threaded application.
es: Siempre que pueda use clases genéricas y concurrentes. I2P es una aplicación multi-hilos.

source: We require Java 6 to build but only Java 5 to run I2P. Do not use Java 6 classes or methods without handling the class not found exceptions and providing alternate Java 5 code. See classes in net.i2p.util for examples.
es: Necesita Java 6 para compilar I2P, pero sólo Java 5 para ejecutarlo. No use las clases o métodos de Java 6 sin encargase antes de las clases de excepciones not found y de proporcionar el código alternativo para Java 5. Vea los ejemplos de clases en net.i2p.util.

source: Explicitly convert between primitive types and classes; don't rely on autoboxing/unboxing.
es: Convierta explícitamente entre tipos primitivos y clases; no confíe en autoboxing/unboxing.

source: Licenses
es: Licencias

source: Only check in code that you wrote yourself. Before checking in any code or library jars from other sources, justify why it is necessary, verify the license is compatible, and obtain approval from the lead developer.
es: Sólo suba el código que ha escrito usted. Antes de subir el código o librerías de otras fuentes, verifique que la licencia es compatible, y obtenga permiso del desarrollador.

source: For any images checked in from external sources, it is your responsibility to first verify the license is compatible. Include the license and source information in the checkin comment.
es: Para cualquier imagen subida de fuentes externas, es su responsabilidad verificar primero si la licencia es compatible. Incluya la licencia y la información de la fuente en el comentario de subida.

source: Managing Trac tickets is everybody's job, please help. Monitor %(trac)s for tickets you have been assigned or can help with. Assign, categorize, comment on, fix, or close tickets if you can.
es: Mantener las entradas del Trac es trabajo de todos, por favor denos su ayuda. Observe el %(trac)s por entradas que le hayan sido asignadas o en las que pueda ayudar. Asigne, categorice, comente, arregle, o cierre entradas si puede.

source: Close a ticket when you think you've fixed it. We don't have a test department to verify and close tickets. If you arent sure you fixed it, close it and add a note saying "I think I fixed it, please test and reopen if it's still broken". Add a comment with the dev build number or revision and set the milestone to the next release.
es: Cierre la entrada cuando piense que la ha arreglado. No tenemos un departamento de pruebas para verificar las entradas cerradas. Si no está seguro de haberlo solucionado, ciérrela y añada una nota diciendo "I think I fixed it, please test and reopen if it's still broken". Añada un comentario con el número de compilación o la revisión y establezca el hito para la siguiente versión.

source: Using an IDE with I2P
es: Usando un IDE con I2P

source: The main I2P development branch (<code>i2p.i2p</code>) has been set up to enable developers to easily set up two of the commonly-used IDEs for Java development: Eclipse and NetBeans.
es: La rama principal de desarrollo de I2P (<code>i2p.i2p</code>) ha sido configurada para permitir a los desarrolladores configurar fácilmente los dos IDEs de desarrollo de JAVA más usados: Eclipse y NetBeans.

source: The main I2P development branches (<code>i2p.i2p</code> and branches from it) contain .project and .classpath Eclipse files, to enable the branch to be easily set up in Eclipse.
es: Las ramas principales de desarrollo de I2P (<code>i2p.i2p</code> y sus ramas) contienen los archivos para Eclipse .project y .classpath, para permitir una configuración fácil de I2P en eclipse.

source: Check out the I2P branch into some directory (e.g. <code>$HOME/dev/i2p.i2p</code>).
es: Descargue la rama de I2P a algún directorio ( por ejemplo <code>$HOME/dev/i2p.i2p</code>).

source: Open Eclipse and create a new Workspace, based in the directory that the I2P branch was checked out to.
es: Abra Eclipse y cree un nuevo Espacio de Trabajo, Workspace, basado en el directorio donde se ha descargado la rama de I2P.

source: Select "File - Import..." and then under "General" select "Existing Projects into Workspace".
es: Seleccione "Archivo - Importar..." y entonces en "General" seleccione "Proyectos existentes al Espacio de Trabajo"

source: For "Select root directory:" choose the directory that the I2P branch was checked out to.
es: Para "Seleccionar el directorio raíz:" elija la carpeta donde ha descargado la rama de I2P.

source: If necessary, click "Refresh" to refresh the list of projects.
es: Si es necesario, pulse "Recargar" para refrescar la lista de proyectos.

source: Select every project in the list, and click "Finish".
es: Seleccione cada proyecto de la lista y pulse "Terminar".

source: Done! Your workspace should now contain all projects within the I2P branch, and their build dependencies should be correctly set up.
es: ¡Listo! Su espacio de trabajo debería incluir todos los proyectos de la rama de I2P, y sus dependencias deberían estar correctamente configuradas.

source: The main I2P development branches (<code>i2p.i2p</code> and branches from it) contain NetBeans project files.
es: Las ramas principales del proyecto de I2P (<code>i2p.i2p</code> y sus ramas) contienen los archivos del proyecto necesarios para NetBeans.

source: Monotone Guide
es: Guía de Monotone

source: Operating a Monotone client
es: Usando el cliente Monotone

source: Generating Monotone keys
es: Generando las claves de Monotone

source: Trust and initializing your repository
es: Confianza e iniciando su repositorio

source: Obtaining and deploying developers' keys
es: Obteniendo y desplegando las claves de los desarrolladores

source: Setting up trust evaluation hooks
es: Establecer enganches ('hooks') de evaluación de confianza

source: Pulling the <code>i2p.i2p</code>, <code>i2p.www</code> and <code>i2p.syndie</code> branches
es: Descargar las ramas de <code>i2p.i2p</code>, <code>i2p.www</code> y <code>i2p.syndie</code>

source: Verifying that trust evaluation works
es: Verificar que la evaluación de confianza funciona

source: Checking out a working copy of the latest version
es: Descargar una copia funcional de la última versión

source: Updating your working copy to the latest version
es: Actualizar sus fuentes a la última versión

source: Operating a Monotone Server
es: Usando un servidor Monotone

source: Obtaining and deploying developers’ transport keys
es: Obteniendo y desplegando las claves de transporte de los desarrolladores

source: Granting push and pull access
es: Obtener acceso para subir y descargar

source: Running Monotone in server mode
es: Ejecutar Monotone en modo servidor

source: Differences under Debian GNU/Linux
es: Diferencias en Debian GNU/Linux

source: This is a revised version of <a href="%(transitionguide)s">Complication's original guide</a> detailing the use of Monotone in I2P development. For basic instructions see the <a href="%(newdevs)s">quick-start guide</a>.
es: Esto es una versión revisada de la <a href="%(transitionguide)s">guía original de Complication</a> detallando el uso de Monotone en el desarrollo de I2P. Para obtener instrucciones básicas vea la <a href="%(newdevs)s">guía rápida</a>.

source: I2P has a distributed development model. The source code is replicated across independently administered <a href="http://www.monotone.ca/">Monotone</a> ("MTN") repositories. Developers with commit rights are able to push their changes to the repository (a <a href="%(licenses)s#commit">license agreement</a> needs to be signed before commit rights are granted).
es: I2P usa un modelo distribuido de desarrollo. El código es replicado por administradores independientes en repositorios <a href="http://www.monotone.ca/">Monotone</a> ("MTN"). Los desarrolladores con derechos para ello pueden subir sus cambios al repositorio (deben firmar un <a href="%(licenses)s#commit">acuerdo de licencia</a> antes de obtener estos derechos)

source: Some of Monotone's noteworthy qualities are: distributed version control, cryptographic authentication, access control, its small size, having few dependencies, storage of projects in a compressed SQLite database file, and having the ability to resume interrupted synchronization attempts.
es: Algunas de las notables cualidades de Monotone son: control de versiones distribuido, autenticación con cifrados, acceso de control, su pequeño tamaño, tiene pocas dependencias, el almacenamiento de los proyectos usa una base de datos SQLite comprimida, y además tiene la capacidad de reanudar los intentos de sincronización interrumpidos.

source: Operating a Monotone Client
es: Usando un cliente Monotone

source: A transport key grants you the ability to push your changes to a Monotone repository server. In order to commit code into Monotone (in essence signing your code), a commit key is also needed. None of the public Monotone servers on I2P currently require a key in order to read (or pull) the source code.
es: Una clave de transporte le permite subir sus cambios al repositorio del servidor Monotone. Para poder subir código a Monotone (firmando su código), es necesaria una clave de subida. Ninguno de los servidores públicos de Monotone en I2P necesita claves para poder leer (o descargar) el código.

source: Without a transport key, one cannot: <ul> <li>pull code from a server which doesn't allow global read access</li> <li>push code to any server</li> <li>run a Monotone server</li> </ul>
es: Sin una clave de transporte no se puede: <ul> <li>descargar el código de un servidor que no permita acceso global de lectura</li> <li>subir código a cualquier servidor</li> <li>ejecutar un servidor Monotone</li> </ul>

source: Without a commit key, one cannot: <ul> <li>commit any code</li> </ul>
es: Sin una clave de subida no se puede: <ul> <li>subir ningún código</li> </ul>

source: If you only intend to retrieve code from MTN, feel free to skip to the <a href="#trust-and-initializing-your-repository">next section</a>. If you want to generate keys, read the following.
es: So sólo desea obtener el código de MTN salte a la <a href="#trust-and-initializing-your-repository">siguiente sección</a>. Si desea generar las claves siga leyendo aquí.

source: By convention keys are named like an e-mail addresses, but a corresponding e-mail address does not need to exist. For example, your keys might be named:
es: Por convenio las claves son nombradas como una dirección de email, pero no es necesario que exista un email correspondiente. Por ejemplo, sus claves podrían llamarse:

source: Monotone stores keys under <code><b>$HOME/.monotone/keys</b></code> in text files which are named identically to the keys. For example:
es: Monotone guarda las claves en <code><b>$HOME/.monotone/keys</b></code> en archivos de texto que se llaman exactamente igual que la clave. Por ejemplo:

source: To generate transport and commit keys, enter the following commands at a prompt:
es: Para generar las claves de transporte y subida ejecute los siguientes comandos en la terminal:
