Repository: Artogn/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/get-involved.po
Languages: es

source: I2P supports a SOCKS V4 and V5 proxy. Outbound connections work well. Inbound (server) and UDP functionality may be incomplete and untested.
es: I2P soporta un proxy SOCKS V4 y V5. Las conexiones salientes funcionan bien. La funcionalidad de las conexiones entrantes (servidor) y UDP puede ser incompleta y no testada.

source: Removed
es: Eliminado

source: There used to be a simple "ministreaming" library, but now ministreaming.jar contains only the interfaces for the full streaming library.
es: Suele haber una librería sencilla "ministreaming", pero ministreaming.jar ahora contiene sólo las interfaces para la librería streaming completa.

source: Datagrams
es: Datagramas

source: Recommended for UDP-like applications
es: Recomendado para aplicaciones tipo-UDP

source: The <a href="%(datagrams)s">Datagram library</a> allows sending UDP-like packets. It's possible to use:
es: La <a href="%(datagrams)s">librería Datagram</a> permite enviar paquetes tipo-UDP. Es posible usar:

source: Repliable datagrams
es: datagramas respondibles

source: Raw datagrams
es: Datagramas crudos ('raw')

source: Not recommended
es: No recomendado

source: <a href="%(i2cp)s">I2CP</a> itself is a language independent protocol, but to implement an I2CP library in something other than Java there is a significant amount of code to be written (encryption routines, object marshalling, asynchronous message handling, etc). While someone could write an I2CP library in C or something else, it would most likely be more useful to use the C SAM library instead.
es: <a href="%(i2cp)s">I2CP</a> en si mismo es un protocolo independiente del lenguaje, pero para implementar una librería I2CP en cualquier otra cosa que no sea Java hay una cantidad de código significativa a escribir (rutinas de cifrado, serialización ('marshalling') de objetos, gestión de mensajes asíncronos, etc.). Aunque cualquiera pueda escribir una librería I2CP en C o algún otro lenguaje, probablemente sería más útil usar la librería C SAM en su lugar.

source: Web Applications
es: Aplicaciones web

source: I2P comes with the Jetty webserver, and configuring to use the Apache server instead is straightforward. Any standard web app technology should work.
es: I2P viene con el servidor web Jetty, pero configurar el servidor Apache para usarlo en su lugar también es apropiado. Cualquier tecnología de aplicaciones web estandar debería funcionar.

source: Developing using I2P requires a working I2P installation and a development environment of your own choice. If you are using Java, you can start development with the <a href="#start.streaming">streaming library</a> or datagram library. Using another programming language, SAM or BOB can be used.
es: Desarrollar usando I2P requiere una instalación I2P funcional y un entorno de desarrollo de su propia elección. Si esta usando Java puede iniciar el desarrollo con la <a href="#start.streaming">librería streaming</a> o la librería datagram. Usando otro lenguaje de programación, se puede usar SAM o BOB.

source: Developing with the streaming library
es: Desarrollo con la librería streaming

source: The following example shows how to create TCP-like client and server applications using the streaming library.
es: El siguiente ejemplo muestra como crear aplicaciones cliente y servidor tipo-TCP usando la librería streaming.

source: This will require the following libraries in your classpath:
es: Esto requerirá las siguientes librerías en su ruta de clases ('classpath'):

source: The streaming library itself
es: La librería streaming en si misma

source: Factory and interfaces for the streaming library
es: El patrón Factory e interfaces para la librería streaming.

source: Standard I2P classes, data structures, API, and utilities
es: Clases I2P estandar, estructuras de datos, API y utilidades.

source: Network communication requires the usage of I2P network sockets. To demonstrate this, we will create an application where a client can send text messages to a server, who will print the messages and send them back to the client. In other words, the server will function as an echo.
es: La comunicación de red requiere el uso de sockets de red I2P. Para demostrar esto, crearemos una aplicación donde un cliente pueda enviar mensajes de texto a un servidor, que imprimirá los mensajes y los enviará de vuelta al cliente. En otras palabras, el servidor funcionará como un eco.

source: We will start by initializing the server application. This requires getting an I2PSocketManager and creating an I2PServerSocket. We will not provide the I2PSocketManagerFactory with the saved keys for an existing Destination, so it will create a new Destination for us. So we will ask the I2PSocketManager for an I2PSession, so we can find out the Destination that was created, as we will need to copy and paste that information later so the client can connect to us.
es: Comenzaremos por inicializar la aplicación servidor. Esto requiere obtener un gestor de socket I2P ('I2PSocketManager') y crear un socket de servidor I2P ('I2PServerSocket'). No proporcionaremos el patrón I2PSocketManagerFactory con las claves guardadas para un Destino existente, por lo que creará un nuevo Destino para nosotros. Así que pediremos al gestor de socket I2P ('I2PSocketManager') una sesión I2P ('I2PSession'), para que podamos averiguar el Destino que fue creado, ya que necesitaremos copiar y pegar esa información más adelante para que el cliente pueda conectarse con nosotros.

source: Code example 1: initializing the server application.
es: Ejemplo de código 1: inicialización de la aplicación servidor.

source: Once we have an I2PServerSocket, we can create I2PSocket instances to accept connections from clients. In this example, we will create a single I2PSocket instance, that can only handle one client at a time. A real server would have to be able to handle multiple clients. To do this, multiple I2PSocket instances would have to be created, each in separate threads. Once we have created the I2PSocket instance, we read data, print it and send it back to the client. The bold code is the new code we add.
es: Una vez que tengamos un socket de servidor I2P ('I2PServerSocket'), podemos crear instancias de socket I2P ('I2PSocket') para aceptar conexiones desde los clientes. En este ejemplo crearemos una única instancia I2PSocket, que sólo puede gestionar un cliente cada vez. Un servidor real tendría que ser capaz de gestionar múltiples clientes. Para hacer esto, múltiples instancias I2PSocket tendrían que ser creadas, en hilos separados cada una. Una vez hayamos creado la instancia I2PSocket, leemos los datos y los imprimimos y enviamos de vuelta al cliente. El código en negrita es el código nuevo que añadimos.

source: Code example 2: accepting connections from clients and handling messages.
es: Ejemplo de código 2: aceptar conexiones desde clientes y gestionar mensajes.

source: When you run the above server code, it should print something like this (but without the line endings, it should just be one huge block of characters):
es: Cuando ejecute el código servidor de arriba, debería imprimir algo como esto (pero sin los finales de línea, debería ser sólo un enorme bloque de caracteres):

source: This is the base64-representation of the server Destination. The client will need this string to reach the server.
es: Esta es la representación-base64 del servidor Destino. El cliente necesitará esta cadena para alcanzar el servidor.

source: Now, we will create the client application. Again, a number of steps are required for initialization. Again, we will need to start by getting an I2PSocketManager. We won't use an I2PSession and an I2PServerSocket this time. Instead, we will use the server Destination string to start our connection. We will ask the user for the Destination string, and create an I2PSocket using this string. Once we have an I2PSocket, we can start sending and receiving data to and from the server.
es: Ahora crearemos la aplicación cliente. Otra vez se requiere un determinado número de pasos para la inicialización. De nuevo, necesitaremos comenzar obteniendo un gestor de socket I2P ('I2PSocketManager'). No usaremos una sesión I2P ('I2PSession') ni un socket de servidor I2P ('I2PServerSocket') esta vez. En su lugar usaremos la cadena del servidor Destino para iniciar nuestra conexión. Preguntaremos al usuario por la cadena Destino, y crearemos un socket I2P ('I2PSocket') usando esta cadena. Una vez que tengamos el I2PSocket podemos comenzar a enviar y recibir datos hacia y desde el servidor.

source: Code example 3: starting the client and connecting it to the server application.
es: Ejemplo de código 3: iniciar el cliente y conectarlo a la aplicación servidor.

source: Finally, you can run both the server and the client application. First, start the server application. It will print a Destination string (like shown <a href="#start.streaming.destination">above</a>). Next, start the client application. When it requests a Destination string, you can enter the string printed by the server. The client will then send 'Hello I2P!' (along with a newline) to the server, who will print the message and send it back to the client.
es: Finalmente puede ejecutar ambas aplicaciones cliente y servidor. Primero, inicie la aplicación servidor. Imprimirá una cadena Destino (como la mostrada <a href="#start.streaming.destination">arriba</a>). Después inicie la aplicación cliente. Cuando esta solicite una cadena Destino, puede introducir la cadena impresa por el servidor. Entonces el cliente enviará 'Hello I2P!' (junto con un caracter de nueva línea ('newline')) al servidor, que imprimirá el mensaje y lo enviará de vuelta al cliente.

source: Congratulations, you have successfully communicated over I2P!
es: ¡Felicidades!, se ha comunicado con éxito sobre I2P

source: Existing Applications
es: Aplicaciones existentes

source: Contact us if you would like to contribute.
es: Contáctenos si quiere contribuír.

source: Application Ideas
es: Ideas para aplicaciones

source: NNTP server - there have been some in the past, none at the moment
es: Servidor NNTP - ha habido algunos en el pasado, ninguno en este momento

source: Jabber server - there have been some in the past, and there is one at the moment, with access to the public internet
es: Servidor Jabber - ha habido algunos en el pasado, y hay uno en este momento con acceso a la Internet pública

source: PGP Key server and/or proxy
es: Servidor de claves PGP y/o proxy

source: Content Distribution / DHT applications - resurrect feedspace, port dijjer, look for alternatives
es: Distribución de contenidos / Aplicaciones DHT - resucite Feedspace, porte Dijjer, busque alternativas

source: Help out with <a href="http://syndie.i2p2.de/">Syndie</a> development
es: Contribuya al desarrollo de <a href="http://syndie.i2p2.de/">Syndie</a>

source: Web-based applications - The sky is the limit for hosting web-server-based applications such as blogs, pastebins, storage, tracking, feeds, etc. Any web or CGI technology such as Perl, PHP, Python, or Ruby will work.
es: Aplicaciones basadas-en-web - El cielo es el límite para el hospedaje de aplicaciones basadas-en-servidor-web tales como blogs, tablones de anotaciones ('pastebins'), almacenamiento, seguimiento, actualización de publicaciones ('feeds'), etc. Cualquier web o tecnología CGI como Perl, PHP, Python o Ruby funcionará.

source: Resurrect some old apps, several previously in the i2p source package - bogobot, pants, proxyscript, q, stasher, socks proxy, i2ping, feedspace
es: Resucite algunas aplicaciones viejas, varias presentes previamente en el paquete fuente de I2P - Bogobot, Pants, Proxyscript, Q, Stasher, Socks Proxy, I2Ping, Feedspace

source: I2P Developer's MTN Keys
es: Claves MTN de desarrollador I2P

source: Monotone servers used by the I2P project require two types of keys to be used.
es: Los servidores Monotone usados por el proyecto I2P requieren el uso de dos tipos de claves.

source: <a href="#commit">Commit Keys</a> to sign changes checked-in to the respository; and
es: <a href="#commit">Claves de consignación ('commit')</a> para firmar cambios registrados en el repositorio; y

source: <a href="#transport">Transport Keys</a> to push changes to remote servers.
es: <a href="#transport">Claves de transporte</a> para impulsar cambios en servidores remotos.

source: Everyone that uses Monotone to checkout the I2P codebase will need to <a href="%(monotone)s#obtaining-and-deploying-developers-keys">import</a> the developer commit keys, but only Monotone <a href="%(monotone)s#operating-a-monotone-server"> server operators</a> will need to import the <a href="#transport">transport keys</a>.
es: Cualquiera que use Monotone para revisar el código fuente de I2P necesitará <a href="%(monotone)s#obtaining-and-deploying-developers-keys">importar</a> las claves de consignación ('commit') de desarrollador, pero sólo los <a href="%(monotone)s#operating-a-monotone-server">operadores de servidor</a> Monotone necesitarán importar las <a href="#transport">claves de transporte</a>.

source: Developer Commit keys
es: Claves de consignación ('commit') de desarrollador

source: Developer Transport Keys
es: Claves de transporte de desarrollador

source: <b>Note:</b> Transport keys are only needed for setting up a <a href="%(monotone)s#operating-a-monotone-server">Monotone server</a>.
es: <b>Nota:</b> Las claves de transporte sólo son necesarias para configurar un <a href="%(monotone)s#operating-a-monotone-server">servidor Monotone</a>.

source: License Agreements
es: Acuerdos de licencia

source: For more information see <a href="%(licenses)s">the licenses page</a>.
es: Para mayor información vea <a href="%(licenses)s">la página de licencias</a>.

source: Following is a monotonerc file defining the current trust list. Developers must use this file in ~/.monotone/monotonerc or _MTN/montonerc in their i2p.i2p workspace.
es: A continuación está un archivo `monotonerc` que define el listado actual de confianza. Los desarrolladores deben usar este fichero en ~/.monotone/monotonerc o _MTN/montonerc en sus espacio de trabajo i2p.i2p

source: Agreements
es: Acuerdos

source: I2P Software Licenses
es: Licencias de software I2P

source: As required by our <a href="%(threatmodel)s">threat model</a> (among other reasons), the software developed to support the anonymous communication network we call I2P must be freely available, open source, and user modifiable. To meet these criteria, we make use of a variety of legal and software engineering techniques so as to remove as many barriers to entry for those considering making use of or contributing to the I2P effort.
es: Como requiere nuestro <a href="%(threatmodel)s">modelo de amenaza</a> (entre otras razones), el software desarrollado para soportar la red de comunicación anónima que llamamos I2P, debe ser accesible libremente, de código abierto, y modificable por el usuario. Para alcanzar estos criterios hacemos uso de una variedad de técnicas legales y de ingeniería de software, además eliminamos cuantas barreras de entrada haya para aquellos que consideren hacer uso de, o contribuír al esfuerzo de I2P.

source: While the information below may be more confusing than just simply stating "I2P is BSD", "I2P is GPL", or "I2P is public domain", the short answer to the question "How is I2P licensed?" is this:
es: Aunque la información de debajo puede ser más bien confusa que sencilla, estableciendo que "I2P es BSD", "I2P es GPL", o "I2P es dominio público", la respuesta corta a la pregunta "¿Cómo está licenciado I2P?" es esta:

source: All software bundled in the I2P distributions will allow:
es: Todo el software empaquetado en las distribuciones I2P permitirá:

source: use without fee
es: uso libre de cargo

source: use with no restrictions on how, when, where, why, or by whom is running it
es: uso sin restricciones acerca de cómo, cuándo, dónde, por qué o por quién se está ejecutando.

source: access to the source code without fee
es: acceso al código fuente libre de cargo

source: modifications to the source
es: modificaciones del código fuente

source: Most of the software guarantees much more - the ability of <b>anyone</b> to distribute the modified source however they choose. However, not all of the software bundled provides this freedom - the GPL restricts the ability of developers who wish to integrate I2P with their own applications that are not themselves open source applications. While we applaud the noble goals of increasing the resources in the commons, I2P is best served by removing any barriers that stand in the way of its adoption - if a developer considering whether they can integrate I2P with their application has to stop and check with their lawyer, or conduct a code audit to make sure their own source can be released as GPL-compatible, we lose out.
es: La mayoría del software garantiza expresamente - la capacidad de <b>cualquiera</b> de distribuír el código fuente modificado de la manera que escoja. Sin embargo no todos los paquetes de software otorgan esta libertad - la GPL restringe la capacidad de los desarrolladores que deseen integrar I2P en sus propias aplicaciones si estas mismas no son aplicaciones de código abierto. Aunque aplaudimos las nobles metas de incrementar los recursos abiertos al público, se sirve mejor a I2P eliminando cualquier barrera que se encuentre en el camino de su adopción - si un desarrollador que considerando si puede o no integrar I2P con sus aplicaciones, tiene que parar a hacer comprobaciones con su abogado o realizar una aditoría para asegurarse de que su propio código puede ser liberado de forma compatible-con-GPL, lo estamos haciendo mal.

source: Component licenses
es: Licencias de componentes

source: The I2P distribution contains several resources, reflecting the partitioning of the source code into components. Each component has its own license, which all developers who contribute to it agree to - either by explicitly declaring the release of code committed under a license compatible with that component, or by implicitly releasing the code committed under the component's primary license. Each of these components has a lead developer who has the final say as to what license is compatible with the component's primary license, and the I2P project manager has the final say as to what licenses meet the above four guarantees for inclusion in the I2P distribution.
es: La distribución I2P contiene varios recursos, que reflejan la fragmentación del código fuente en sus diferentes componentes. Cada componente tiene su propia licencia, que todos los desarrolladores que contribuyan con él tienen que aceptar - bien explícitamente declarando la versión del código consignada (`committed`) bajo una licencia compatible con ese componente, o implícitamente publicando el código consignado bajo la licencia primaria del componente. Cada uno de estos componentes tiene un desarrollador principal que tiene la última palabra acerca de si una licencia es compatible con la licencia primaria del compente, y el administrador del proyecto I2P tiene la última palabra acerca de qué licencias satisfacen las cuatro garantías anteriores para su inclusión en la distribución I2P.

source: Component
es: Componente

source: Source path
es: Ruta del código fuente

source: Resource
es: Recurso

source: Primary license
es: Licencia primaria

source: Alternate licenses
es: Licencias alternativas

source: Lead developer
es: Desarrollador principal

source: GPL + java exception
es: GPL + excepción java

source: While it may be redundant, just for clarity the <a href="%(gpl)s">GPL</a>'ed code included within I2PTunnel and other apps must be released under the GPL with an additional "exception" explicitly authorizing the use of Java's standard libraries:
es: Aunque puede ser redundante, y sólo para dejarlo claro, el código bajo <a href="%(gpl)s">GPL</a> incluído con I2PTunnel y otras aplicaciones, debe ser publicado bajo la GPL con una "excepción" adicional explícita autorizando el uso de las librerías estándar de Java:

source: All source code under each component will by default be licensed under the primary license, unless marked otherwise in the code. All of the above is summary of the license terms - please see the specific license for the component or source code in question for authoritative terms. Component source locations and resource packaging may be changed if the repository is reorganized.
es: Todo código fuente bajo cada componente será licenciado por defecto bajo la licencia primaria, a menos que otra cosa esté establecida en el código. Todo lo anterior resume los términos de la licencia - por favor revise la licencia específica para el componente, o el código fuente en cuestión en busca de cláusulas autorizativas. Los emplazamientos de los recursos del código de los componentes y los paquetes podrían cambiar si el repositorio es reorganizado.

source: Commit privileges
es: Privilegios de consignación (`commit`)

source: Developers may push changes to a distributed monotone repository if you receive permission from the person running that repository. See the <a href="%(monotone)s">Monotone Page</a> for details.
es: Los desarrolladores pueden impulsar cambios en un repositorio Monotone si reciben permiso de la persona que mantiene ese repositorio. Vea la <a href="%(monotone)s">página de Monotone</a> para mayor detalle.

source: However, to have changes included in a release, developers must be trusted by the release manager (currently zzz). In addition, they must explicitly agree with the above terms to be trusted. That means that they must send one of the release managers a signed message affirming that:
es: Sin embargo, para poder incluír los cambios en una versión, los desarrolladores deben recibir confianza por parte del administrador de versiones (actualmente `zzz`). Además, deben aceptar explícitamente los téminos anteriores para recibir confianza. Eso significa que deben enviar a uno de los administradores de versiones un mensaje firmado afirmando que:

source: Unless marked otherwise, all code I commit is implicitly licensed under the component's primary license
es: A menos que se establezca de otra manera, todo el código que yo consigne está implícitamente licenciado bajo la licencia primaria del componente.

source: If specified in the source, the code may be explicitly licensed under one of the component's alternate licenses
es: Si se especifica en el código fuente, el código puede estar explícitamente licenciado bajo una de las licencias alternativas del componente.

source: I have the right to release the code I commit under the terms I am committing it
es: Tengo derecho a publicar el código que consigne ('commit') bajo los términos con los que lo estoy consignando.

source: If anyone is aware of any instances where the above conditions are not met, please contact the component lead and/or an I2P release manager with further information. <a href="%(licenseagreements)s">See developers' license agreements</a>.
es: Si alguien advierte alguna instancia donde las condiciones anteriores no se cumplen, por favor contacte con el encargado del componente y/o con el administrador de versiones de I2P con información detallada. <a href="%(licenseagreements)s">Vea los acuerdos de licencia del desarrollador</a>.

source: Release Signing Key
es: Clave de firmado de la versión

source: Releases 0.7.6 and later are signed by zzz. His public key is:
es: Las versiones 0.7.6 y posteriores están firmadas por `zzz`. Su clave pública es:

source: Releases 0.6.1.31 through 0.7.5 were signed by Complication. His public key is:
es: Las versiones de la 0.6.1.31 a la 0.7.5 fueron firmadas por `Complication`. Su clave pública es:

source: Signed Developer Keys
es: Claves firmadas de desarrollador
