Repository: Artogn/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/get-involved.po
Languages: es

source: Donate
es: Donar

source: Thank you for your interest in contributing to I2P! The details of how you can make your contribution are provided below.
es: ¡Gracias por su interés en contribuir a I2P! Los detalles de como puede hacer una contribución se indican más abajo.

source: Tax Status
es: Situación tributaria

source: I2P is not incorporated. Your contributions are probably not tax-deductible. If you would like to discuss a large contribution, please contact eche|on.
es: I2P no es una corporación. Sus contribuciones probablemente no son deducibles. Si quisiese discutir acerca de la realización de una gran contribución, por favor contacte con eche|on.

source: Stickers
es: Pegatinas

source: While supplies last, we offer I2P stickers to those who donate enough to cover PayPal fees and postage from the U.S. You must include "stickers please" and your address in the Paypal comments. For other payment methods, follow up with an email to eche|on with the subject "stickers please", your payment information, and your address.
es: Aunque la provisión aún dura, ofrecemos pegatinas de I2P a aquellos que donen lo suficiente para cubir las tasas de PayPal y el servicio postal desde EEUU. Debe incluir "stickers please" (pegatinas por favor) y su dirección física en los comentarios de PayPal. Para otros métodos de pago, remita un correo electrónico a eche|on con el asunto "stickers please", su información de pago, y su dirección física.

source: As of %(date)s, eche|on has been running a <a href="%(coinurl)s">%(cointype)s</a> account for the I2P project. ATTENTION! The address changed on 02-20-2014. ATTENTION! If you'd like to donate using %(cointype)s, just transfer your desired amount of coins to the account <b>%(account)s</b> and leave eche|on a note if you'd like your donation to be mentioned on the I2P webpage.
es: Desde %(date)s, eche|on ha estado ha estado llevando una cuenta en <a href="%(coinurl)s">%(cointype)s</a> para el proyecto I2P. ¡ATENCIÓN! La dirección cambió el 20-02-2014. ¡ATENCIÓN! Si desea donar usando %(cointype)s, simplemente transfiera la cantidad que desee a la cuenta <b>%(account)s</b> y deje a eche|on una nota si quiere que su donación sea mencionada en la página de I2P.

source: For easy usage, use the QR code below!
es: ¡Para usarla con facilidad, utilice el código QR de debajo!

source: As of %(date)s, eche|on has been running a <a href="%(coinurl)s">%(cointype)s</a> account for the I2P project. ATTENTION! The address changed 02-20-2014. ATTENTION! If you'd like to donate using %(cointype)s, just transfer your desired amount of coins to the account <b>%(account)s</b> and leave eche|on a note if you'd like your donation to be mentioned on the I2P webpage.
es: Desde %(date)s, eche|on ha estado ha estado llevando una cuenta en <a href="%(coinurl)s">%(cointype)s</a> para el proyecto I2P. ¡ATENCIÓN! La dirección cambió el 20-02-2014. ¡ATENCIÓN! Si desea donar usando %(cointype)s, simplemente transfiera la cantidad que desee a la cuenta <b>%(account)s</b> y deje a eche|on una nota si quiere que su donación sea mencionada en la página de I2P.

source: You can donate direct via PayPal to the account "%(account)s".
es: Puede donar directamente vía PayPal a las cuentas "%(account)s".

source: One time donation:
es: Una sola donación:

source: Donate 10 &euro;/month for 12 months:
es: Donar 10 &euro;/mes por 12 meses:

source: I2P donation
es: Donación I2P

source: Donate 20 &euro;/month for 12 months:
es: Donar 20 &euro;/mes durante 12 meses:

source: Donate 30 &euro;/month for 12 months:
es: Donar 30 &euro;/mes durante 12 meses:

source: Donate 50 &euro;/month for 12 months:
es: Donar 50 &euro;/mes durante 12 meses:

source: Flattr this
es: Donar con

source: If you want to keep more or less anonymous, the option to send money via mail is also available. But it is less secure as the envelope can be lost on the way to us.
es: Si desea permanecer más o menos anónimo, puede enviar el dinero por correo. Pero es menos seguro ya que la carta puede perderse en el camino.

source: If you'd like to donate via snail mail, send an email to <a href="mailto:%(email)s?subject=information about snailmail donation">%(email)s</a> and you'll receive an email with instructions detailing how to proceed.
es: Si desea donar a través de correo caracol, snail mail, envíe un email a <a href="mailto:%(email)s?subject=information about snailmail donation">%(email)s</a> y recibirá un email con las instrucciones de como debe proceder.

source: In the meantime, feel free to take a look at the generous donations that have been given in support of the I2P Project at the <a href="%(halloffame)s">hall of fame</a>.
es: Mientras tanto, puede echar una ojeada a las generosas donaciones que han sido dadas para el soporte del proyecto I2P en el <a href="%(halloffame)s">salón de la fama</a>.

source: Get Involved!
es: ¡Involúcrese!

source: We need your help!
es: ¡Necesitamos su ayuda!

source: To get involved, please feel free to join us on the #i2p IRC channel (on irc.freenode.net, or within I2P on irc.freshcoffee.i2p or irc.postman.i2p).
es: Para unirse al proyecto, por favor únase a nosotros en el canal #i2p del IRC (en irc.freenode.net, o dentro de I2P en irc.freshcoffee.i2p o irc.postman.i2p).

source: If you're interested in joining our <a href="%(team)s">team</a>, please get in touch as we're always looking for eager contributors!
es: ¡Si está interesado en unirse a nuestro <a href="%(team)s">equipo</a>, por favor póngase en contacto con nosotros, ya que siempre estamos buscando ayudantes entusiastas!

source: We need help in many areas, and you don't need to know Java to contribute! Here's a list to help you get started!
es: ¡Necesitamos ayuda en muchas áreas, y no necesita saber Java para contribuir! ¡Aquí hay una lista para ayudarle a decidirse!

source: Spread the Word!
es: ¡Extienda la Palabra!

source: Tell people about I2P on forums, blogs, and comments to articles. Fix up the Wikipedia article about I2P in your language. Tell your friends.
es: Háblele a la gente sobre I2P en foros, blogs y comentarios de artículos. Mejore la entrada en la Wikipedia sobre I2P en su idioma. Dígaselo a sus amigos.

source: Testing
es: Pruebas

source: Run the latest builds from <a href="%(monotone)s">monotone</a> and report results on #i2p or as bugs on <a href="%(trac)s">Trac</a>.
es: Ejecute las últimas versiones de <a href="%(monotone)s">monotone</a> e informe de los resultados en #i2p o los fallos en el <a href="%(trac)s">Trac</a>.

source: Documentation
es: Documentación

source: Help fix the parts of the website that are outdated or incomplete. Translate pages into other languages.
es: Ayude a mejorar las partes de la web que están anticuadas o incompletas. Traduzca las páginas a otros idiomas.

source: Pictures
es: Imágenes

source: Make some more pictures, fix the old ones on the website
es: Cree más imágenes, mejore las viejas de la web

source: Content
es: Contenido

source: Make an eepsite! Add some content! Contribute to the community!
es: ¡Cree una eepsite! ¡Añádale contenido! ¡Contribuya a la comunidad!

source: Services
es: Servicios

source: Run a service on an eepsite. It could be a proxy, a forum, a tracker, a naming service, a search engine, an eepsite monitor... many of these aren't that hard.
es: Ejecute algún servicio en su eepsite. Puede ser un proxy, un foro, un tracker, un servidor de dominios, una motor de búsquedas, un monitor de eepsites... muchos de estos no son tan difíciles.

source: Applications
es: Aplicaciones

source: Write or port applications for I2P! There's some guidelines and a list of ideas on the <a href="%(apps)s">applications page</a>.
es: ¡Escriba o porte aplicaciones para I2P! Hay algunas guías y una lista de ideas en la <a href="%(apps)s">página de aplicaciones</a>.

source: Coding
es: Programando

source: There's plenty to do if you know Java or are ready to learn. Check for open tickets on <a href="%(trac)s">Trac</a> or the TODO list on <a href="http://%(zzz)s">%(zzz)s</a> for some ideas on where to start. See the <a href="%(newdevs)s">new developer's guide</a> for details.
es: Hay mucho que hacer si conoce Java o está listo para aprenderlo. Compruebe los tickets abiertos en el <a href="%(trac)s">Trac</a> o la lista TODO en <a href="http://%(zzz)s">%(zzz)s</a> para hacerse una idea de dónde empezar. Para más detalles vea la <a href="%(newdevs)s">guía de los nuevos desarrolladores</a>

source: Translation
es: Traducciones

source: Help translate the website and the software into your language. See the <a href="%(newtrans)s">new translator's guide</a> for details.
es: Ayude a traducir la página web y las aplicaciones a su lenguaje. Vea la <a href="%(newtrans)s">guía de nuevos traductores</a> para más información.

source: Analysis
es: Análisis

source: Study or test the code to look for vulnerabilities. Both anonymity vulnerabilities from the various <a href="%(threatmodel)s">threat models</a>, and DOS and other weaknesses due to securities holes, need researching.
es: Estudie o pruebe el código buscando vulnerabilidades. Se necesita estudiar tanto las vulnerabilidades del anonimato de varios <a href="%(threatmodel)s">modelos de amenazas</a>, como los ataques DOS y otras debilidades debidas a errores en la seguridad.

source: Roadmap
es: Hoja de ruta

source: Include some seed data in the distribution so a central reseed location isn't required?
es: ¿Asegurarnos de que I2P en la instalación automáticamente se una a la red y así no haría falta ninguna localización central para esto?

source: Reachability Mapping / handle peers partially reachable / enhanced <a href="%(todo)s#fullRestrictedRoutes">restricted routes</a>
es: Mapeado de accesibilidad / manejar los pares parcialmente accesibles / mejorar los <a href="%(todo)s#fullRestrictedRoutes">ruters restringidos</a>

source: Improve help pages and website
es: Mejorar las páginas de ayuda y la página web.

source: More translations
es: Más traducciones

source: SSU disconnect message
es: Mensaje de desconexión SSU

source: Iterative floodfill lookups
es: Búsquedas iterativas en el algoritmo de relleno, "floodfill"

source: Full review of anonymity issues and other vulnerabilities
es: Examen completo de las vulnerabilidades y problemas de anonimato.

source: Reduce memory usage, remove debugging overhead, make it run better on slow and embedded machines
es: Reducción del uso de memoria, eliminar el gasto superfluo de la depuración, hacer que corra más ligero en hardware pequeño y lento.

source: Docs
es: Documentación

source: Full restricted routes
es: Rutas restringidas

source: Tunnel mixing and padding
es: Mezclado y relleno de los túneles

source: User defined message delays
es: Mensajes con el retraso definido por los usuarios

source: Please see the <a href="%(todo)s">TODO</a> list for more detailed info about some of these tasks.
es: Por favor, vea la lista <a href="%(todo)s">TODO</a> , por hacer, para obtener información mas detallada sobre estas tareas.

source: I2P Project Targets
es: Objetivos del proyecto I2P

source: Below is a more detailed (yet still incomplete) discussion of the major areas of future development on the core I2P network, spanning the plausibly planned releases. This does not include stego transports, porting to wireless devices, or tools to secure the local machine, nor does it include client applications that will be essential in I2P's success. There are probably other things that will come up, especially as I2P gets more peer review, but these are the main 'big things'. See also <a href="%(roadmap)s">the roadmap</a>. Want to help? <a href="%(volunteer)s">Get involved</a>!
es: Más abajo hay una discusión detallada (aunque aún no completa) de las áreas más importantes del futuro desarrollo del núcleo de I2P, que abarca los posibles planes de desarrollo. Esto no incluye transporte oculto, portarlo a dispositivos Wireless o herramientas para asegurar la máquina local, tampoco incluye otras aplicaciones cliente que serían esenciales para el éxito de I2P. Probablemente aparecerán otros temas, especialmente si I2P recibe mas atención, pero estas son ls 'cosas importantes'. Vea también <a href="%(roadmap)s">la hoja de ruta</a>. ¿Quiere ayudar? <a href="%(volunteer)s">¡Únete!</a>

source: Core functionality
es: Funcionamiento del núcleo.

source: link
es: enlace

source: NAT/Firewall bridging via 1-hop restricted routes
es: Puenteando el NAT/cortafuegos a través de ruters restringidos de 1 salto

source: High degree transport layer with UDP, NBIO, or NIO
es: Capa de transporte de alto nivel con UDP, NBIO, o NIO

source: NetworkDB and profile tuning and ejection policy for large nets
es: Base de datos de la red, NetworkDB, y ajustes del perfil y política de expulsión para grandes redes.

source: Security / anonymity
es: Seguridad / anonimato

source: Per-hop tunnel id &amp; new permuted TunnelVerificationStructure encryption
es: Id por salto de túnel &amp; nuevo cifrado permutado de la estructura de verificación del túnel, TunnelVerificationStructure

source: Strict ordering of participants within tunnels
es: Orden estricto de los participantes dentro de los túneles

source: Randomly permuted tunnel lengths
es: Tamaño de los túneles aleatorio.

source: Full blown n-hop restricted routes with optional trusted links
es: Mejor personalización de los ruters y un mejor control de los ruters usados.

source: Hashcash for routerIdentity, destination, and tunnel request
es: Añadir Hashcash a la identidad del ruter, destinación y solicitud de respuesta.

source: Advanced tunnel operation (batching/mixing/throttling/padding)
es: Control avanzado del funcionamiento del ruter (procesamiento por lotes/mezclado/control de velocidad)

source: Stop &amp; go mix w/ garlics &amp; tunnels
es: Configuración avanzada del enrutamiento de los túneles y opciones para crear túneles de usar y tirar para su uso a corto plazo.

source: Performance
es: Rendimiento

source: Implemented in I2P 0.6.0.6
es: Implementado en I2P 0.6.0.6

source: The functionality of allowing routers to fully participate within the network while behind firewalls and NATs that they do not control requires some basic restricted route operation (since those peers will not be able to receive inbound connections). To do this successfully, you consider peers one of two ways:
es: Esta capacidad permite a los ruters participar totalmente dentro de la red incluso detrás de un NAT o cortafuegos de los que no se tienen control (ya que estos pares no podrán recibir conexiones entrantes). Para hacer esto satisfactoriamente, consideramos a los pares de estas dos formas:

source: <b>Peers who have reachable interfaces</b> - these peers do not need to do anything special
es: <b>Pares que tienen algún dispositivo accesible</b> - estos pares no necesitan hacer nada especial

source: <b>Peers who do not have reachable interfaces</b> - these peers must build a tunnel pointing at them where the gateway is one of the peers they have established a connection with who has both a publicly reachable interface and who has agreed to serve as their 'introducer'.
es: <b>Pares que no tienen dispositivos accesibles</b> - estos pares tienen que construir un túnel hacia ellos mismos en donde la salida es uno de los pares con los que ya ha establecido una conexión y quien tiene un dispositivo accesible públicamente y ha aceptado servir como su 'introductor'.

source: To do this, peers who have no IP address simply connect to a few peers, build a tunnel through them, and publish a reference to those tunnels within their RouterInfo structure in the network database.
es: Para hacer esto, los pares que no tiene dirección IP simplemente se conectan a varios pares, construye un túnel a través de ellos, y publican una referencia de esos túneles dentro de la estructura RouterInfo en la base de datos dela red.

source: When someone wants to contact any particular router, they first must get its RouterInfo from the network database, which will tell them whether they can connect directly (e.g. the peer has a publicly reachable interface) or whether they need to contact them indirectly. Direct connections occur as normal, while indirect connections are done through one of the published tunnels.
es: Cuando alguien quiere conectar con algún ruter en particular, el primero debe obtener su RouterInfo de la base de datos de la red, la que le indicará que puede conectarse directamente ( por ejemplo con un par que tiene un dispositivo accesible públicamente) o que necesita conectar indirectamente. La conexiones directas se hacen directamente, pero las indirectas se hacen a través de los túneles publicados.

source: When a router just wants to get a message or two to a specific hidden peer, they can just use the indirect tunnel for sending the payload. However, if the router wants to talk to the hidden peer often (for instance, as part of a tunnel), they will send a garlic routed message through the indirect tunnel to that hidden peer which unwraps to contain a message which should be sent to the originating router. That hidden peer then establishes an outbound connection to the originating router and from then on, those two routers can talk to each other directly over that newly established direct connection.
es: Cuando un ruter simplemente quiere enviar un mensaje a un par oculto puede usar el túnel indirecto para enviar la información. Sin embargo, si el ruter quiere hablar con el par oculto a menudo (por ejemplo, como parte de un túnel), enviará un mensaje enrutado a través del túnel indirecto del par oculto. Entonces este par oculto establece una conexión de salida hacia el ruter original y a partir de entonces estos dos ruters puede hablar entre ellos directamente sobre la nueva conexión directa.

source: Of course, that only works if the originating peer can receive connections (they aren't also hidden). However, if the originating peer is hidden, they can simply direct the garlic routed message to come back to the originating peer's inbound tunnel.
es: Por supuesto esto solo funciona si el par original puede recibir conexiones (y no están también ocultas). Sin embargo, si el par original está oculto, pueden simplemente indicar la mensaje enrutado que vuelva por el túnel de entrada del par original.

source: This is not meant to provide a way for a peer's IP address to be concealed, merely as a way to let people behind firewalls and NATs fully operate within the network. Concealing the peer's IP address adds a little more work, as described <a href="#fullRestrictedRoutes">below.</a>
es: Esto no se ha creado para permitir que la IP de un par permanezca oculta, simplemente es una forma de permitir a la gente detrás de un NAT o cortafuegos funcionar completamente dentro de la red. Ocultar la IP de un par cuesta un poco más de trabajo, como se describe <a href="#fullRestrictedRoutes">más abajo.</a>

source: With this technique, any router can participate as any part of a tunnel. For efficiency purposes, a hidden peer would be a bad choice for an inbound gateway, and within any given tunnel, two neighboring peers wouldn't want to be hidden. But that is not technically necessary.
es: Con esta técnica cualquier ruter puede participar como una parte de un túnel. Con objeto de mejorar la eficiencia, un par oculto sería una mala elección como puerta de entrada, y dentro de un túnel dado, dos pares vecinos no desearían estar ocultos. Pero esto no es técnicamente necesario.

source: Both UDP and NIO have been Implemented in I2P
es: Ambos, UDP y NIO ya han sido implementados en I2P

source: Standard TCP communication in Java generally requires blocking socket calls, and to keep a blocked socket from hanging the entire system, those blocking calls are done on their own threads. Our current TCP transport is implemented in a naive fashion - for each peer we are talking to, we have one thread reading and one thread writing. The reader thread simply loops a bunch of read() calls, building I2NP messages and adding them to our internal inbound message queue, and the writer thread pulls messages off a per-connection outbound message queue and shoves the data through write() calls.
es: Las comunicaciones estándar TCP en java normalmente necesitan el bloqueo de llamadas al socket, y para evitar que el socket bloqueado pare todo el sistema, estos bloqueos se hacen en sus propios hilos. Nuestro sistema de transporte TCP actual está implementado de una forma sencilla - por cada par con el que hablamos, tenemos un hilo escribiendo y otro leyendo. El hilo de lectura simplemente repite un puñado de llamadas read(), creando mensajes I2NP y añadiéndolos a la cola interna de mensajes de entrada, y el hilo de escritura envía mensajes hacia una cola de mensajes de salida y empuja los datos a través de llamadas write().

source: We do this fairly efficiently, from a CPU perspective - at any time, almost all of these threads are sitting idle, blocked waiting for something to do. However, each thread consumes real resources (on older Linux kernels, for instance, each thread would often be implemented as a fork()'ed process). As the network grows, the number of peers each router will want to talk with will increase (remember, I2P is fully connected, meaning that any given peer should know how to get a message to any other peer, and restricted route support will probably not significantly reduce the number of connections necessary). This means that with a 100,000 router network, each router will have up to 199,998 threads just to deal with the TCP connections!
es: Desde la perspectiva del uso de CPU esto se hace bastante eficientemente - la mayoría del tiempo la mayoría de estos hilos están dormidos esperando por algo que hacer. Sin embargo, cada uno de estos hilos consume recursos (en kernels viejos de Linux, por ejemplo, cada hilo se implementa como un proceso fork()'ed). Al mismo tiempo que la red crece, el número de pares con el que se comunica un ruter aumentará (recuerde, I2P está totalmente conectado, esto quiere decir que cualquier par debe saber como enviar un mensaje a cualquier otro par). ¡Esto significa que con una red de 100.000 ruters, cada ruter tendrá 199.998 hilos simplemente para tratar con las conexiones TCP!

source: Obviously, that just won't work. We need to use a transport layer that can scale. In Java, we have two main camps:
es: Obviamente esto no funcionará. Necesitamos una capa de transporte que pueda escalar. En Java tenemos dos posibles soluciones:

source: Implemented in I2P 0.6 ("SSU") as documented <a href="%(ssu)s">elsewhere</a>
es: Implementado en 2P 0.6 ("SSU") y documentado en <a href="%(ssu)s">en otra parte</a>

source: Sending and receiving UDP datagrams is a connectionless operation - if we are communicating with 100,000 peers, we simply stick the UDP packets in a queue and have a single thread pulling them off the queue and shoving them out the pipe (and to receive, have a single thread pulling in any UDP packets received and adding them to an inbound queue).
es: Enviar y recibir datagramas UDP es una operación que no necesita de conexión previa - si estamos comunicándonos con 1000.000 pares, simplemente ponemos los paquetes UDP en una cola y hacemos que un único hilo los envíe fuera de la cola hacia una tubería ( y para recibir, tenemos un único hilo tirando de cualquier paquete UDP recibido y añadiéndolos a una cola de entrada)
