Repository: Artogn/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/get-involved.po
Languages: es

source: In addition, we may want to implement code to dynamically reroute tunnels to avoid failed peers or to inject additional hops into the path. This can be done by garlic routing a message to any particular peer in a tunnel with instructions to redefine the next-hop in the tunnel.
es: Además, queremos implementar el código para re-rutar los túneles dinámicamente, y así evitar que los pares fallidos añadan saltos adicionales en el camino. Esto lo puede hacer la red garlic rutando un mensaje a un par en particular con las instrucciones para redefinir el siguiente salto del túnel.

source: Beyond the per-tunnel batching and mixing strategy, there are further capabilities for protecting against powerful attackers, such as allowing each step in a garlic routed path to define a delay or window in which it should be forwarded on. This would enable protections against the long term intersection attack, as a peer could send a message that looks perfectly standard to most peers that pass it along, except at any peers where the clove exposed includes delay instructions.
es: Además de las estrategias de mezclado y de procesado por lotes de cada túnel, hay más formas de protegernos contra atacantes poderosos, como permitir crear un retraso en cada paso dentro de un camino de rutado garlic. Esto crearía protecciones contra un ataque largo de intersección, ya que un par podría enviar mensajes que parecen normales a la mayoría de los pares, excepto a cualquier par donde se hayan dado instrucciones de retardo.

source: Performance related improvements are listed on the <a href="%(futureperf)s">Performance</a> page.
es: Las mejoras en el rendimiento se listan en la página de <a href="%(futureperf)s">rendimiento</a> .

source: Bounty Arabic translation of webpage and router console
es: Recompensa por la traducción al árabe de la página web y la consola de ruter.

source: Arabic translation
es: Traducción al árabe.

source: To improve I2P usage and attract more people into I2P echelon set out this bounty for translation of the I2P web page and I2P router console into Arabic.
es: Para mejorar el uso de I2P y atraer más gente, echelon propone esta recompensa por la traducción al árabe de la web de I2P y la consola del ruter.

source: This bounty is set into 2 subparts:
es: Esta recompensa de divide en 2 partes:

source: Part 1 is translation of the webpage.
es: La parte 1 es la traducción de la página web.

source: For collecting the bounty of 20 BTC you need to translate the following pages:
es: Para recibir la recompensa de 20 BTC necesita traducir las siguientes páginas:

source: This job was done by hamada and the bounty of 20 BTC was paid to hamada.
es: El trabajo fue hecho por Amanda y la recompensa de 20 BTC fue pagada a Amanda.

source: Part 2 is the translation of the router console. The router console was partly translated and the bounty of 80 BTC was paid to hamada.
es: La parte 2 es la traducción de la consola del ruter. La consola del ruter fue parcialmente traducida y la recompensa de 80 BTC se pagó a hamada.

source: Judge is echelon.
es: El juez es echelon.

source: Bounty creating a I2P native Bitcoin client
es: Recompensa por la creación de un cliente nativo para I2P.

source: BTC I2P native client
es: Cliente nativo BTC para I2P

source: For a future of I2P and attract more people into I2P this bounty is to create a I2P native Bitcoin client. It should integrate with other client via the I2P network and via gateways to the existant bitcoin network.
es: Para el futuro de I2P y para atraer más gente a I2P esta recompensa se pensó para crear un cliente de Bitcoin para I2P. Debería integrarse con otros clientes dentro de la red de I2P y vía las salidas, con la red de Bitcoin actual.

source: Judge is psychonaut who donated the first 30 &euro; to this bounty.
es: El juez es psychonaut quien donó los primeros 30 &euro; para esta recompensa.

source: Bounty datastorage
es: Recompensa por el almacenamiento de datos.

source: datastore
es: almacenamiento de datos

source: To improve I2P's usage and to be independent of routers online status we want a datastorage as a extension to I2P. Like in Freenet the datastorage should be distributed and every participating node should be able to configure his options. The files should be saved in chunks and at least 2-3 times to obtain redundancy. Usage of storage space should be auto balanced. As it is a extra application, it should work flawless within I2P and cooperate nice with the I2P router. Maybe a integration within the webpage/router could be done.
es: Para mejorar el uso de I2P y ser independiente del estados de los ruters en funcionamiento queremos un sistema de almacenamiento de datos como una extensión de I2P. Como en Freenet, el almacenamiento de información debería ser distribuido y cada nodo participante debería poder configurar sus propias opciones. Los archivos deberían ser guardados en trozos y al menos 2-3 veces para obtener redundancia. El uso del espacio de almacenamiento debería ser auto balanceado. Y aunque sea una aplicación extra, debería funcionar perfectamente dentro de I2P y cooperar bien con el ruter I2P. Quizás se puede hacer una integración dentro de la página web o del ruter.

source: This bounty cooperates with the 2 other bounties "frost for I2P" and "eepsites in datastorage".
es: Esta recompensa está unida con otras 2 recompensas, "frost para I2P" y "eepsites en el almacenamiento de datos"

source: The frost for I2P datastorage bounty is paid for a frost like program with which files/messages are stored into database and got from database. It needs to work with a GUI.
es: La recompensa por frost para el almacenamiento de datos de I2P es pagada por un programa tipo frost en donde los archivos o mensajes son almacenados dentro de una base de datos y obtenidos de la base de datos. Debe funcionar con GUI, entorno gráfico.

source: The eepsite served out of I2P datastorage extends a I2P router to send out eepsites out of the I2P datastorage. All files for eepsites need to be saved inside of datastorage and are taken from it. Extension: For better integration all datastorage participants could serve that eepsite.
es: El eepsite servido desde el almacén de datos de I2P despliega un enrutador ('router') I2P para enviar eepsites desde el almacén de datos I2P. Todos los ficheros para los eepsites han de ser guardados dentro del almacén de datos y son tomados desde este. Extensión: Para mayor integración todos los participes del almacen de datos podrían servier ese eepsite.

source: For bounties to be declared done and paid, we need the program AND the source. Source and code need to be licensed under a free license (free to change and free to distribute).
es: Para que una recompensa sea declarada pagada, necesitamos la aplicación y el código. El código debe estar bajo una licencia libre (libre de cambiar y de distribuir el código).

source: Bounty I2P package in Debian and Ubuntu mirrors
es: Recompensa por el paquete I2P en los repositorios de Debian y Ubuntu

source: I2P Ubuntu/Debian package
es: Paquetes I2P para Ubuntu/Debian

source: For the future of I2P and in order to attract more people to I2P, this bounty was set for including an I2P package into the Ubuntu and Debian archive mirrors. To claim this bounty, the I2P router package needs to be available from Ubuntu and Debian archive mirrors and Debian bug <a href="http://bugs.debian.org/cgi-bin/bugreport.cgi?bug=448638">448638</a> needs to be closed successfully.
es: Para el futuro y para atraer más gente a I2P, esta recompensa se creó para incluir los paquetes de I2P dentro de los repositorios de Ubuntu y Debian. Para reclamar esta recompensa, el paquete del ruter de I2P debe estar disponible desde los repositorios de Ubuntu y Debian y el bug <a href="http://bugs.debian.org/cgi-bin/bugreport.cgi?bug=448638">448638</a> debe cerrarse exitosamente.

source: Bounty I2PHex code implementation
es: Recompensa por la implementación de I2PHex

source: i2phex code implementation
es: Implementación del código fuente de I2P

source: To improve I2P usage and attract more people into I2PHex P2P ArneBab setout the bounty for implementing actual Phex code onto I2PHex.
es: Para mejorar el uso de I2P y atraer más gente a I2PHex P2P, ArneBab creó la recompensa por implementar el código actual de Phex dentro de I2PHex.

source: Bounties for I2P
es: Recompensas por I2P

source: While we always gratefully accept any contributions of code, documentation, and the like, there are other ways to help I2P move forward. As with any open source project, our goals would be achieved more rapidly if we were able to support all of our contributors to work on I2P full time. However, as with any open source project, that's not a possibility. Instead, we are making use of a bounty system, whereby anyone can get support for working on something that people want implemented, and people who want to contribute to I2P can be assured that their support goes to what they care about.
es: Aunque siempre aceptamos con agradecimiento cualquier contribución al código, documentación, y de ese tipo, hay otras formas de hacer que I2P siga adelante. Al igual que con otros proyectos libres nuestros fines se podrían conseguir más rápido si fuésemos capaces de compensar a todos los ayudantes para que trabajasen en I2P a jornada completa. Pero, y al igual que con cualquier otro proyecto libre, esto no es posible. En lugar de eso, estamos utilizando un sistema de recompensas en donde cualquiera pude tener compensación por trabajar en algo que desea implementar, y la gente que ayuda a I2P puede estar segura que su apoyo va dirigido a lo que a ellos les interesa.

source: We are also keeping open the ability for people who want to support I2P but don't have strong feelings about the bounties available. Those people can simply put their trust in the I2P team to do what we feel is best by donating to a catch-all general fund that will be used as deemed necessary - allocated to various bounties, covering incidentals (hosting, etc), and the like.
es: También mantenemos abierta una posibilidad para la gente que quiere ayudar a I2P pero no está convencida de las recompensas disponibles. Esta gente simplemente puede poner su confianza en el equipo de I2P para que este haga lo que piense que es mejor, donando a un fondo general que será usado en lo que se considere necesario - usado para las recompensas, cubrir imprevistos (alojamiento, etc), y cosas de ese tipo.

source: Current bounties
es: Recompensas actuales

source: Name
es: Nombre

source: Status
es: Estado

source: Judge
es: Juez

source: Dev
es: Desarrolladores

source: Bounty
es: Recompensas

source: Frost for I2P datastorage
es: Frost para el almacenamiento de datos de I2P

source: Proposal in development
es: Proposición en desarrollo

source: vacant
es: vacante

source: Eepsites served out of I2P datastorage
es: Eepsites disponibles fuera del almacenamiento de datos de I2P

source: Backporting Phex code onto I2PHex
es: Portar el código de Phex dentro de I2PHex

source: I2P package in Debian and Ubuntu mirrors
es: Paquetes I2P disponibles en los repositorios de Debian y Ubuntu

source: Bitcoin client for I2P
es: Cliente Bitcoin para I2P

source: Done, phase of verification
es: Hecho, fase de verificación

source: Unit tests and Multi-router Simulation
es: Unit tests y simulación multi-tuter

source: Partly done, partly in work, partly still open
es: Parcialmente hecho, parcialmente trabajando, parcialmente aún abierto

source: Hold bounties, set on hold due to jrandom AWOL and missing funding
es: Recompensas paradas, paradas a causa de la desaparición de jrandom.

source: Bundling bounties
es: Ordenando las recompensas

source: Proposed
es: Propuesto

source: Claimed bounties
es: Recompensas reclamadas

source: Dev team
es: Equipo de desarrollo

source: Make I2P IPv6 native
es: Hacer I2P IPV6 nativo

source: Setting up a SILC server
es: Configurar un servidor SILC

source: Datastore over I2P
es: Almacenamiento de datos sobre I2P.

source: Russian translation
es: Traducción al ruso

source: Swarming file transfer
es: Agrupando para la transferencia de archivo

source: Streaming library window size
es: Tamaño de la ventana de la librería de streaming

source: IRC connect time monitor
es: Monitor del tiempo de conexión del IRC

source: Unit tests (part 1)
es: Unit tests (parte 1)

source: Dev lists anyone who may already be working on the bounty - collaboration is preferred, so if you're interested in working on it, please contact one of the people listed!
es: Los desarrolladores listan a cualquier persona que haya podido trabajar en la recompensa - por lo cual si está interesado en trabajar en ello, ¡por favor contacte con una de las personas listadas!

source: Bounty I2P IPv6 native
es: Recompensa por IPV6 nativo para I2P

source: native IPv6 I2P
es: IPV6 nativo para I2P

source: For a future of I2P and attract more people into I2P I withdrawal the vuze bounty and offer a IPv6 bounty. To claim this bounty, the I2P router needs to run full on native IPv6 connections like it does on IPv4.
es: Por el futuro de I2P y para atraer a más gente a I2P, yo ofrezco una recompensa por el soporte IPv6 en I2P. Para obtener esta recompensa, los ruters de I2P deben funcionar nativa y completamente con conexiones IPv6 como lo hacen con conexiones IPv4.

source: For bounties to be declared done and paid, we need the plugin AND the source. Source and code need to be licensed under a free license (free to change and free to distribute).
es: Para que las recompensas sean declaradas hechas y pagadas, necesitamos el pluguin y las fuentes. El código y las fuentes tienen que ser liberados con licencias libres (libre para ser cambiado y distribuido).

source: NetDB Backend
es: Sistema NetDB

source: netDB backend
es: Sistema netDB

source: The current NetDB implementation (namely the FloodFill system) needs to be extended with another backend to improve reliability, reduce attack surface and solve the scalability issue for the coming years.
es: La implementación actual de NetDB (llamada sistema Floodfill) necesita ser extendida con otro sistema para mejorar la seguridad, reducir los ataques de superficie u arreglar los problemas de escalabilidad para los próximos años.

source: A solution likely based on a DHT will be investigated and finally implemented.
es: Se investigará e y finalmente implementará una solución basada en DHT.

source: Bounty russian translation of webpage and router console
es: Recompensa por la traducción al ruso de la página web y la consola del ruter.

source: To improve I2P usage and attract more people into I2P a anonymous donator set out the bounty for translation of the I2P web page and I2P router console into russian language.
es: Para mejorar el uso de I2P y atraer más gente a I2P, un donante anónimo ha creado una recompensa para la traducción al ruso de la web de I2P y la consola del ruter.

source: For collecting the bounty of $115 USD you need to translate the following pages:
es: Para recibir la recompensa de 115 dólares tiene que traducir estas páginas:

source: Part 2 is the translation of the router console. The whole router console needs to be translated to collect the bounty of $115 USD.
es: La parte 2 es la traducción del a consola del ruter. Tiene que traducir la consola del ruter completa para recibir la recompensa de 115 dólares.

source: Judge is the russian donor.
es: Judge es el donante ruso.

source: Bounty migrate I2P IRC to SILC
es: Recompensa por migrar el IRC I2P a SILC

source: I2P silc server
es: Servidor I2P silc

source: For a future of I2P and attract more people into I2P this bounty is to setup and host a I2P SILC server. This will allow people to send files over their messaging servers and have intrinsic security built into the protocol.
es: Para el futuro y para atraer a más gente a I2P, se ha creado una recompensa para configurar y mantener un servidor SILC I2P. Esto permitirá a la gente enviar archivos sobre los servidores de mensajes y tener asegurada la privacidad dentro del propio protocolo.

source: A silc server needs to be set up and run for at least 3 month time to get payed. A second server should be set up, too.
es: Un servidor SILC ha de ser instalado y ejecutado durante un periodo de al menos 3 meses para obtener el pago. Un sergundo servidor también debe ser instalado.

source: Bounty was withdrawn and money donated to returningnovice and general fund.
es: La recompensa ha sido retirada y donada a returningnovice y al fondo general.

source: Judge is An Anonymous Secret Society, society@mail.i2p.
es: Judge es una sociedad secreta anónima, society@mail.i2p.

source: Syndie development
es: Desarrollo de Syndie

source: Beside of I2P we want to encourage users to care more about anonymity and security. As I2P is a low latency network with its natural limits, the software SYNDIE can overcome some of these limits and provide better anonymity for people who really need it.
es: Además de usar I2P, queremos fomentar que los usuarios tengan más en cuenta el anonimato y la privacidad. Ya que I2P es una red baja latencia con límites naturales, el software SYNDIE puede vencer esos límites y provver más anonimato para la gente que relamente lo necesita.

source: For our bad sake the syndie project was out of development for quite a long time yet (5 years). To get a fresh and new built with needed bugfixes we set out this bounty. Also syndie needs some enhancements and a better GUI for users to work with it. Current bounty sum is 50 Bitcoin.
es: El proyecto syndie ha estado en desarrollo por demasiado tiempo (5 años). Para conseguir una nueva y fresca versión con los errores arreglados hemos creado esta recompensa. Además Syndie necesita algunas mejoras y una GUI mejor con la que trabajar. La recompensa actual es de 50 bitcoins.

source: The latest Syndie coding rally did improve the situation of the Syndie package dramatically. A new Syndie package with bugfixes was created and made available on different webpages. As a result of this work, the bounty sum was reduced and the withdrawn money moved to the IPv6 bounty.
es: Las últimas mejoras de Syndie en el código han mejorado dramáticamente la mejora de la aplicación. Se ha creado un nuevo paquete con arreglos y se ha puesto a disposición en varias páginas. Como resultado de este trabajo, la cantidad de la recompensa fue reducida y el dinero retirado se movido a la recompensa de IPv6.

source: Bounty unittests
es: Recompensa por unittests

source: To improve I2P's maintainability, we want to have a solid set of automated unit tests for the critical code. While we do have some unit tests at the moment, they are ad-hoc and partly unfinished. This bounty is for someone to check the existing tests and move over old ones to jUnit, automate their execution, extend them to provide better code coverage, and publish the report online. Its a massive effort, but can be broken down into phases, listed below (phase 2 must occur first, but further phases may happen in any order). As this needs some reading of code, it is the best start point for new devs to get a good overview of I2P code and coding. A good job for college students, interns or anyone who is just interested.
es: Para mejorar el mantenimiento de I2P, queremos un conjunto de unit tests automáticos para el código crítico. Aunque ya tenemos algunos unit tests, son ad-hoc y están parcialmente sin terminar. Esta recompensa es para alguien que compruebe los tests existentes y los mueva a jUnit, automatice su ejecución, los amplíe para mejorar la cobertura sobre el código, y lo publique el reporte online. Es un esfuerzo enorme, pero puede romperse en fases, listadas más abajo (la fase 2 debe hacerse primero, pero las demás fases pueden hacerse en cualquier orden). Ya que este trabajo necesita leer el código, es un buen punto de inicio para los nuevos desarrolladores echarle el ojo al código de I2P. Es un buen trabajo para estudiantes o cualquiera interesado.

source: Take care! Jobs and bounties shuffled a bit! Phase 6,7 and 8 are still open!
es: ¡Tenga cuidad! ¡Los trabajos y recompensas han cambiado un poco! ¡Las fases 6,7 y 8 están aun abiertas!

source: Phase %(phase)s:
es: Fase %(phase)s:

source: CI jenkins and IRC bot
es: CI jenkins e IRC bot

source: Bounty: %(euro)s &euro;
es: Recompensa: %(euro)s &euro;

source: server runs and this section is blocked
es: el servidor ya se ejecuta y esta rección está bloqueada.

source: To collect this bounty, a continuous integration server (Jenkins, old name was Hudson) must be set up and a connected IRC bot needs to set up in the channel #i2p-dev on IRC2p network to print out results of build tests.<br> The server needs to be run long term.
es: Para obtener esta recompensa, un servidor de integración continuo (Jenkins, antes se llamaba Hudson) debe configurarse y un bot IRC debe configurarse y conectarse al canal #i2p-dev en la red IRC2p para poder mostrar los resultados de las pruebas de compilación.<br> Este servidor debe ejecutarse por largo tiempo.

source: Check existing SDK tests
es: Comprobar las pruebas del SDK existentes

source: paid to str4d
es: pagado a str4d

source: To collect this bounty, the existing SDK tests must be checked and made to work again. The need to be integrated into the ant build scripts ("ant test"), and tied in with a code coverage tool (e.g. <a href="%(clover)s">Clover</a>). The ant script must be capable of generating test status results as a web page, which will be published online.
es: Para obtener esta recompensa el SDK debe ser comprobado y hacer que funcione de nuevo. Debe ser integrado dentro de los scripts de compilación de ant ("ant test") y unido con una herramienta de cobertura (por ejemplo <a href="%(clover)s">Clover</a>). El script ant debe ser capaz de generar resultados de pruebas de estado como una página web, que se publicará online.

source: SDK test coverage
es: Cobertura de tests del SDK

source: paid to unittests dev team
es: pagado al grupo de desarrollo de unittests

source: To collect this bounty, the automated unit tests of the SDK (i2p/core/java/src) must work again.
es: Para obtener esta recompensa, los unit tests automáticos del SDK (i2p/core/java/src) tienen que funcionar de nuevo.

source: Router test migration
es: Migración de las pruebas del ruter

source: As with phase 2, the existing unit tests for the router must be moved over to the automated system.
es: Como en la fase 2, los unit tests existentes del ruter tienen que ser movidos a un sistema automático.

source: Router test coverage
es: Covertura para los tests del ruter.

source: To collect this bounty, the automated unit tests of the router (i2p/router/java/src) must work again.
es: Para obtener esta recompensa, los unit tests automáticos del ruter (i2p/core/java/src) tienen que funcionar de nuevo.

source: Streaming lib tests
es: Tests de la libreriá de streaming

source: To collect this bounty, a new set of unit tests must meet a measured code coverage of 90&#37; of the streaming lib (i2p/apps/ministreaming/ and i2p/apps/streaming/).
es: Para hacerse con esta recompensa, un nuevo grupo de tests de unidad debe satisfacer una covertura de código determinada de 90&#37; de la librería streaming (i2p/apps/ministreaming/ y i2p/apps/streaming/).

source: Unit tests coverage
es: Covertura de unit tests

source: To collect this bounty, all above unit tests must meet the 100&#37; coverage marker (except for log statements).
es: Para hacerse con esta recompensa, todos los tests de unidad anteriores deben satisfacer la marca de covertura 100&#37; (excepto para las entradas de registro (`log`).

source: MultiRouter simulation
es: Simulación multiruter

source: will be split in more sub-tasks
es: será dividido en más sub-tareas
