Repository: Artogn/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/get-involved.po
Languages: es

source: However, moving to UDP means losing the benefits of TCP's ordering, congestion control, MTU discovery, etc. Implementing that code will take significant work, however I2P doesn't need it to be as strong as TCP. Specifically, a while ago I was taking some measurements in the simulator and on the live net, and the vast majority of messages transferred would fit easily within a single unfragmented UDP packet, and the largest of the messages would fit within 20-30 packets. As mule pointed out, TCP adds a significant overhead when dealing with so many small packets, as the ACKs are within an order of magnitude in size. With UDP, we can optimize the transport for both efficiency and resilience by taking into account I2P's particular needs.
es: Sin embargo, usar UDP significa perder los beneficios de usar el orden de TCP, el control de congestión, descubrimiento de MTU, etc. Implementar esto significaría mucho trabajo, sin embargo I2P no necesita ser tan fuerte como TCP. Hace algún tiempo estaba tomando medida en un simulador y en la red real, y la mayoría de los mensajes pueden ser transmitidas dentro de un único paquete UDP no fragmentado, y el más largo de los mensajes entraría dentro de 20-30 paquetes. Como mule indicó, TCP añade bastante gasto cuando tiene que encargarse de muchos paquetes pequeños. Con UDP, se puede optimizar el transporte para la eficiencia y la flexibilidad teniendo en cuenta las necesidades particulares de I2P.

source: It will be a lot of work though.
es: Sería muchísimo trabajo por hacer.

source: NIO or NBIO
es: NIO o NBIO

source: NIO Implemented in I2P 0.6.1.22 ("NTCP")
es: NIO fue implementada en la versión 0.6.1.22 de I2P ("NTCP")

source: In Java 1.4, a set of "New I/O" packages was introduced, allowing Java developers to take advantage of the operating system's nonblocking IO capabilities - allowing you to maintain a large number of concurrent IO operations without requiring a separate thread for each. There is much promise with this approach, as we can scalable handle a large number of concurrent connections and we don't have to write a mini-TCP stack with UDP. However, the NIO packages have not proven themselves to be battle-ready, as the Freenet developer's found. In addition, requiring NIO support would mean we can't run on any of the open source JVMs like <a href="http://www.kaffe.org/">Kaffe</a>, as <a href="http://www.classpath.org/">GNU/Classpath</a> has only limited support for NIO. <i>(note: this may not be the case anymore, as there has been some progress on Classpath's NIO, but it is an unknown quantity)</i>
es: En Java 1.4 se introdujo paquetes "I/O nuevos", permitiendo a los desarrolladores de java usar las capacidades de los sistemas operativos sin bloquear las entradas y salidas - permitiendo tener un gran número de operaciones I/O concurrentes si necesitar un nuevo hilo para cada una. Hay muchas esperanzas puestas en este método, ya que podemos manejar un gran número de conexiones y no tendríamos que que reescribir un nuevo mini TCP stack con UDP. Sin embargo, los paquetes NIO no han probado aún estar listos, como averiguaron los desarrolladores de Freenet. Además, usar paquetes NIO significaría no poder usar ninguna JVM libre como <a href="http://www.kaffe.org/">Kaffe</a>, ya que <a href="http://www.classpath.org/">GNU/Classpath</a> sólo tiene soporte limitado para NIO.<i>(nota: puede que ahora esto ya no sea verdad, ya que se han hecho progreso en los NIO de Classpath, pero no sabemos su calidad)</i>

source: Another alternative along the same lines is the <a href="%(link)s">Non Blocking I/O</a> package - essentially a cleanroom NIO implementation (written before NIO was around). It works by using some native OS code to do the nonblocking IO, passing off events through Java. It seems to be working with Kaffe, though there doesn't seem to be much development activity on it lately (likely due to 1.4's NIO deployment).
es: Otra alternativa del mismo tipo es el paquete <a href="%(link)s">sin bloqueos I/O</a> - básicamente es una implementación NIO tipo cleanroom (escrita antes de que NIO existiese). Funciona utilizando algo de código nativo del sistema operativo para hacer I/O sin bloqueos, pasando los eventos a través de Java. Parece que funciona con Kaffe, aunque no parece que haya mucha actividad últimamante en su desarrollo (debido probablemente al desarrollo de NIO 1.4)

source: Within the current network database and profile management implementation, we have taken the liberty of some practical shortcuts. For instance, we don't have the code to drop peer references from the K-buckets, as we don't have enough peers to even plausibly fill any of them, so instead, we just keep the peers in whatever bucket is appropriate. Another example deals with the peer profiles - the memory required to maintain each peer's profile is small enough that we can keep thousands of full blown profiles in memory without problems. While we have the capacity to use trimmed down profiles (which we can maintain 100s of thousands in memory), we don't have any code to deal with moving a profile from a "minimal profile" to a "full profile", a "full profile" to a "minimal profile", or to simply eject a profile altogether. It just wouldn't be practical to write that code yet, since we aren't going to need it for a while.
es: Nos hemos tomado la libertad de usar unos atajos prácticos dentro de la base de datos de la red y la implementación de la gestión del perfil. Por ejemplo, no tenemos el código para sacar los perfiles de los pares de K-buckets, al igual que no tenemos suficientes pares para llenar ninguno de ellos, en lugar de eso mantenemos los pares en cualquier cubo que pueda ser apropiado. Otro ejemplo tiene que ver con los perfiles de los pares - la memoria requerida para mantener cada perfil del par es suficientemente pequeña como para poder tener todos los perfiles en la memoria sin problemas (con lo que podemos mantener cientos de miles en la memoria), no tenemos ningún código para lidiar con el problema de mover un perfil de un "perfil mínimo" a un "perfil completo", de un "perfil completo" a un "perfil mínimo", o simplemente desechar un perfil completo. Simplemente no sería práctico escribir el código ya que no lo vamos a necesitar por un tiempo.

source: That said, as the network grows we are going to want to keep these considerations in mind. We will have some work to do, but we can put it off for later.
es: Como ya hemos dicho, según siga creciendo la red volveremos a retomar estas consideraciones. Tendremos algún trabajo por hacer, pero se puede dejar para mas tarde.

source: Addressed in I2P 0.5 as documented <a href="%(tunnelimpl)s">elsewhere</a>
es: Conseguido en I2P 0.5 como se documenta <a href="%(tunnelimpl)s">aquí</a>

source: Right now, if Alice builds a four hop inbound tunnel starting at Elvis, going to Dave, then to Charlie, then Bob, and finally Alice (A&lt;--B&lt;--C&lt;--D&lt;--E), all five of them will know they are participating in tunnel "123", as the messages are tagged as such. What we want to do is give each hop their own unique tunnel hop ID - Charlie will receive messages on tunnel 234 and forward them to tunnel 876 on Bob. The intent is to prevent Bob or Charlie from knowing that they are in Alice's tunnel, as if each hop in the tunnel had the same tunnel ID, collusion attacks aren't much work.
es: Ahora mismo si Alicia crea un túnel de entrada de cuatro saltos empezando en Elvis, yendo a través de Dave, después Charlie, después Bob y finalmente Alice (A&lt;--B&lt;--C&lt;--D&lt;--E), los cinco sabrán que están participando en el túnel "123", ya que el mensaje está etiquetado así. Lo que queremos hacer es dar a cada salto su propio ID de túnel - Charlie recibirá el mensaje en el túnel 234 y lo enviará al túnel 876 de Bob. Se intenta prevenir que Bob o Charlie sepan que están en el túnel de Alice, lo que ocurriría si en cada salto tuviesen el mismo ID de túnel haciendo que un ataque por colisión fuese más fácil.

source: Adding a unique tunnel ID per hop isn't hard, but by itself, insufficient. If Dave and Bob are under the control of the same attacker, they wouldn't be able to tell they are in the same tunnel due to the tunnel ID, but would be able to tell by the message bodies and verification structures by simply comparing them. To prevent that, the tunnel must use layered encryption along the path, both on the payload of the tunneled message and on the verification structure (used to prevent simple tagging attacks). This requires some simple modifications to the TunnelMessage, as well as the inclusion of per-hop secret keys delivered during tunnel creation and given to the tunnel's gateway. We must fix a maximum tunnel length (e.g. 16 hops) and instruct the gateway to encrypt the message to each of the 16 delivered secret keys, in reverse order, and to encrypt the signature of the hash of the (encrypted) payload at each step. The gateway then sends that 16-step encrypted message, along with a 16-step and 16-wide encrypted mapping to the first hop, which then decrypts the mapping and the payload with their secret key, looking in the 16-wide mapping for the entry associated with their own hop (keyed by the per-hop tunnel ID) and verifying the payload by checking it against the associated signed hash.
es: Añadir un Id único por cada salto no es difícil, pero sí insuficiente. Si Dave y Bob están bajo el control del mismo atacante no sería posible saber que están en el mismo túnel a causa del Id, pero podría se capaz de saber sobre el cuerpo del mensaje y las estructuras de verificación con solo compararlos. Para prevenir esto el túnel debe usar una capa de cifrado a lo largo del camino, en el payload tunelado y en la verificación de la estructura (usado para evitar ataques simples de etiquetado). Esto requiere algunos cambios simples en el TunnelMessage, y además, requiere del envío de claves secretas por cada salto durante la creación del túnel, y además hacer llegar estas claves a la salida del túnel. Tenemos que que crear un valor máximo del tamaño del túnel (por ejemplo 16), e instruir a la puerta de salida para que cifre el mensaje de cada una de las claves secretas enviadas, en orden inverso, y de que cifre la firma del hash del payload (cifrado) en cada salto. La puerta de salida envía entonces el mensaje cifrado de 16 pasos, junto con los 16 pasos y el mapeado cifrado de 16 de ancho al primer salto, el cual entonces descifra el mapeado y el payload con su clave secreta, buscando en el mapeado de 16 de ancho por la entrada asociada con su propio salto (cifrado por el Id del túnel de cada salto) y verificando el pyload chequeándolo con el hash firmado asociado.

source: The tunnel gateway does still have more information than the other peers in the tunnel, and compromising both the gateway and a tunnel participant would allow those peers to collude, exposing the fact that they are both in the same tunnel. In addition, neighboring peers know that they are in the same tunnel anyway, as they know who they send the message to (and with IP-based transports without restricted routes, they know who they got it from). However, the above two techniques significantly increase the cost of gaining meaningful samples when dealing with longer tunnels.
es: La salida del túnel todavía tiene más información que los otros pares del túnel, y comprometiendo la salida y un participante en el túnel permitiría a estos confabularse mostrando el hecho de que los dos pertenecen al mismo túnel. Además, los pares vecinos saben que están en el mismo túnel, ya que saben a quien envían el mensaje (y con transportes basados en IP con rutas restrictivas saben de donde lo reciben). Sin embargo, estas dos técnicas incrementan significativamente el coste de conseguir ejemplos con significado cuando se trata de túneles largos.

source: Implemented in release 0.6.2
es: Implementado en la versión 0.6.2

source: As Connelly <a href="%(link)s">proposed</a> to deal with the <a href="%(pdf1)s">predecessor attack</a> <a href="%(pdf2)s">(2008 update)</a>, keeping the order of peers within our tunnels consistent (aka whenever Alice creates a tunnel with both Bob and Charlie in it, Bob's next hop is always Charlie), we address the issue as Bob doesn't get to substantially sample Alice's peer selection group. We may even want to explicitly allow Bob to participate in Alice's tunnels in only one way - receiving a message from Dave and sending it to Charlie - and if any of those peers are not available to participate in the tunnel (due to overload, network disconnection, etc), avoid asking Bob to participate in any tunnels until they are back online.
es: Como <a href="%(link)s">propuso</a> Connelly para tratar el <a href="%(pdf1)s">ataque del predecesor</a><a href="%(pdf2)s">(2008)</a>, manteniendo consistente el orden de los pares dentro de nuestros túneles (osea cuando Alice crea un túnel con Bob y Charlei en él, el siguiente salto de Bob es siempre Charlie), solucionamos el problema, ya que Bob no puede obtener una muestra del grupo de pares de Alice lo suficientemente grande. Incluso podríamos querer permitir explícitamente a Bob participar en el túnel de Alice en una dirección - recibiendo un mensaje de Dave y enviándolo a Charlie - y si unos de estos pares no están disponible para participar en el túnel (debido a saturación, desconexión de red, erc), evitar preguntar a Bob si participa en algún túnel hasta que vuelva a estar disponible.

source: More analysis is necessary for revising the tunnel creation - at the moment, we simply select and order randomly within the peer's top tier of peers (ones with fast + high capacity).
es: Aún hace falta un análisis más detallado de la creación del túnel - hasta el momento, simplemente seleccionamos y ordenamos aleatoriamente de entre uno de los mejores pares del par (uno rápido y con gran capacidad)

source: Adding a strict ordering to peers in a tunnel also improves the anonymity of peers with 0-hop tunnels, as otherwise the fact that a peer's gateway is always the same would be particularly damning. However, peers with 0-hop tunnels may want to periodically use a 1-hop tunnel to simulate the failure of a normally reliable gateway peer (so every MTBF*(tunnel duration) minutes, use a 1-hop tunnel).
es: Añadiendo un orden estricto a los pares de un túnel también mejoramos el anonimato de los pares con túneles de 0 saltos, ya que de otra forma el hecho de que la salida del par fuese siempre la misma sería bastante dañino. Sin embargo, los pares con túneles de 0 saltos necesitarán usar periódicamente un túnel de 1 salto para simular el fallo de un par de salida normal (así cada MTBF*(duración del túnel) minutos, usaría un túnel de 1 salto)

source: Without tunnel length permutation, if someone were to somehow detect that a destination had a particular number of hops, it might be able to use that information to identify the router the destination is located on, per the predecessor attack. For instance, if everyone has 2-hop tunnels, if Bob receives a tunnel message from Charlie and forwards it to Alice, Bob knows Alice is the final router in the tunnel. If Bob were to identify what destination that tunnel served (by means of colluding with the gateway and harvesting the network database for all of the LeaseSets), he would know the router on which that destination is located (and without restricted routes, that would mean what IP address the destination is on).
es: Sin los cambios de tamaño de los túneles, si alguien de alguna forma detectase que una destinación tiene un número determinado de saltos, sería capaz de usar esa información para identificar la localización de la destinación de ruter usando el ataque del predecesor. Por ejemplo, si todo el mundo tiene túneles de 2 saltos, si Bob recibe un mensaje de Charlie y lo envía a Alice, Bob sabría que que Alice es el ruter final del túnel. Si Bob quisiese identificar la destinación que ese túnel sirvió (confabulándose con el nodo de salida y buscando en la base de datos de la red a todos los LeaseSets), conocería el ruter que está en esa destinación ( y sin rutas restringidas, eso quiere decir que sabríamos la IP de la destinación)

source: It is to counter user behavior that tunnel lengths should be permuted, using algorithms based on the length requested (for example, the 1/MTBF length change for 0-hop tunnels outlined above).
es: El tamaño de los túneles debe ser cambiante para contrarrestar el comportamiento de los usuarios, usando algoritmos basados en el tamaño requerido (por ejemplo, el cambio de tamaño a 1/MTBF de los túneles de 0 saltos)

source: The restricted route functionality described before was simply a functional issue - how to let peers who would not otherwise be able to communicate do so. However, the concept of allowing restricted routes includes additional capabilities. For instance, if a router absolutely cannot risk communicating directly with any untrusted peers, they can set up trusted links through those peers, using them to both send and receive all of its messages. Those hidden peers who want to be completely isolated would also refuse to connect to peers who attempt to get them to (as demonstrated by the garlic routing technique outlined before) - they can simply take the garlic clove that has a request for delivery to a particular peer and tunnel route that message out one of the hidden peer's trusted links with instructions to forward it as requested.
es: La funcionalidad restringida del ruter descrita antes era simplemente un problema funcional - cómo hacer que dos pares que de otra forma no estrían comunicados se comuniquen. Sin embargo, el concepto de permitir ruters restringidos incluye capacidades adicionales. Por ejemplo, si un ruter no puede arriesgarse de ninguna forma a una comunicación directa con un par sin confianza, pueden configurar enlaces seguros a través de esos pares, usándolos para enviar y recibir todos sus mensajes. Esos pares ocultos que desean estar totalmente aislados pueden también negarse a conectar con pares que intenten alcanzarles (como se demuestra en la técnica de ruteado 'garlic' esbozada anteriormente)

source: Within the network, we will want some way to deter people from consuming too many resources or from creating so many peers to mount a <a href="%(link)s">Sybil</a> attack. Traditional techniques such as having a peer see who is requesting a resource or running a peer aren't appropriate for use within I2P, as doing so would compromise the anonymity of the system. Instead, we want to make certain requests "expensive".
es: Dentro de la red necesitaremos una forma de disuadir al a gente de consumir demasiados recursos o de crear demasiados pares como para montar un ataque <a href="%(link)s">Sybil</a>. Las técnicas tradicionales como dejar que un par vea quien solicita un recurso o quien ejecuta cierto par, no son apropiadas para I2P, ya que eso comprometería el anonimato del sistema. En su lugar queremos hacer que ciertas peticiones sean muy "caras".

source: <a href="http://www.hashcash.org/">Hashcash</a> is one technique that we can use to anonymously increase the "cost" of doing certain activities, such as creating a new router identity (done only once on installation), creating a new destination (done only once when creating a service), or requesting that a peer participate in a tunnel (done often, perhaps 2-300 times per hour). We don't know the "correct" cost of each type of certificate yet, but with some research and experimentation, we could set a base level that is sufficiently expensive while not an excessive burden for people with few resources.
es: <a href="http://www.hashcash.org/">Hashcash</a> es una técnica que podemos usar anónimamente para incrementar el "costo" de hacer ciertas acciones., como crear una nueva identidad de ruter (se hace sólo cuando se instala por primera vez), crear una nueva destinación (se hace sólo cuando se crea un nuevo servicio), o solicitar que un par participe en un túnel (se hace a menudo, quizás 2-300 veces a la hora). No conocemos todavía el coste "correcto" de cada tipo de certificado, pero con algo de investigación y estudio, podemos crear un nivel básico que sea lo suficientemente caro pero no tan caro como para que agobie a la gente con pocos recursos.

source: There are a few other algorithms that we can explore for making those requests for resources "nonfree", and further research on that front is appropriate.
es: Hay varios algoritmos que podemos explorar para hacer que esas peticiones de recursos "tengan un costo", sería conveniente seguir investigando sobre este tema.

source: To powerful passive external observers as well as large colluding internal observers, standard tunnel routing is vulnerable to traffic analysis attacks - simply watching the size and frequency of messages being passed between routers. To defend against these, we will want to essentially turn some of the tunnels into its own mix cascade - delaying messages received at the gateway and passing them in batches, reordering them as necessary, and injecting dummy messages (indistinguishable from other "real" tunnel messages by peers in the path). There has been a significant amount of <a href="%(pdf)s">research</a> on these algorithms that we can lean on prior to implementing the various tunnel mixing strategies.
es: El rutado estándar de túneles es vulnerable al análisis de tráfico para los observadores externos pasivos con muchos medios y para un gran número de observadores internos si están confabulados, simplemente observando el tamaño y la frecuencia de los mensajes que pasan a través de los ruters. Para defendernos de esto, queremos simplemente convertir algunos túneles en su propia mezcla de cascada - retrasando los mensajes recibidos en la puerta de salida y pasándolos en lotes, reordenándolas como sea necesario, e inyectando mensajes de relleno (indistinguibles de los túneles "reales" para los pares). Ha habido un gran número de <a href="%(pdf)s">estudios</a> sobre estos algoritmos que podríamos utilizar para implementar varias estrategias de mezclado de túneles.

source: In addition to the anonymity aspects of more varied tunnel operation, there is a functional dimension as well. Each peer only has a certain amount of data they can route for the network, and to keep any particular tunnel from consuming an unreasonable portion of that bandwidth, they will want to include some throttles on the tunnel. For instance, a tunnel may be configured to throttle itself after passing 600 messages (1 per second), 2.4MB (4KBps), or exceeding some moving average (8KBps for the last minute). Excess messages may be delayed or summarily dropped. With this sort of throttling, peers can provide ATM-like QoS support for their tunnels, refusing to agree to allocate more bandwidth than the peer has available.
es: Además de los aspectos del anonimato en las operaciones de los túneles, hay una dimensión funcional extra. Cada par sólo tiene cierto número de datos que pueden rutar por la red, y para evitar que un túnel en particular consuma una gran parte del ancho de banda, necesitarán añadir algunas regulaciones en el túnel. Por ejemplo, un túnel puede estar configurado para pararse a sí mismo después de pasar 600 mensajes (1 par por segundo), 2.4MB (4KBps), o tras haber excedido algún promedio variable (8KBps en el último minuto). Los mensajes sobrantes pueden ser retardados o desechados. Con este tipo de control, los pares pueden ofrecer un soporte parecido al QoS en sus túneles, negándose a asignar más ancho de banda de la que el par tiene disponible.
