Repository: Artogn/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/get-involved.po
Languages: es

source: Monotone will prompt you for a password to protect your keys. You are very strongly encouraged to set a password for the commit key. Many users will leave an empty password for the transport key, especially those running a Monotone server.
es: Monotone le pedirá una contraseña para proteger sus claves. Se recomienda encarecidamente usar una contraseña para la clave de subida. Muchos usuarios dejan la contraseña de transporte en blanco, sobre todo los que ejecutan un servidor Monotone.

source: Trust, and initializing your repository
es: Confianza e iniciando su repositorio

source: Monotone's security model helps to ensure that nobody can easily impersonate a developer without it being noticed. Since developers can make mistakes and become compromised,only manual review can ensure quality of code. Monotone's trust model will ensure that you read the right diffs. It does not replace reading diffs.
es: El modelo de seguridad de Monotone ayuda a asegurar que nadie puede suplantar a un programador fácilmente si ser detectado. Ya que los programadores pueden cometer errores y pueden ser comprometidos, sólo una revisión manual puede asegurar la calidad del código. El modelo de confianza de Monotone se asegura de que usted sólo lea los cambios correctos. No reemplaza los cambios de lectura.

source: A Monotone repository is a single file (a compressed SQLite database) which contains all of the project's source code and history.
es: Un repositorio Monotono es un solo archivo (comprimido en una base de datos SQLite) que contiene todo el código del proyecto y su historial.

source: After <a href="#obtaining-and-deploying-developers-keys">importing the developers' keys into Monotone</a> and <a href="#setting-up-trust-evaluation-hooks">setting up trust evaluation hooks</a>, Monotone will prevent untrusted code from being checked out into your workspace. There are commands available to clean untrusted code from your workspace but in practice they've not been needed due to the push access policies in place.
es: Después de <a href="#obtaining-and-deploying-developers-keys">importar las claves de los desarrolladores hacia Monotone</a> y de <a href="#setting-up-trust-evaluation-hooks">Establecer enganches ('hooks') de evaluación de confianza</a>, mediante esta monitorización Monotone evitará que cualquier código que no sea de confianza sea subido a su espacio de trabajo. Existen comandos disponibles para eliminar el código no confiable de su espacio de trabajo, pero en la práctica no se han necesitado debido a las políticas acceso a actualizaciones activas ('push') que se aplican.

source: A repository can hold many branches. For example, our repository holds the following main branches:
es: Un repositorio puede almacenar muchas ramas. Por ejemplo, nuestro repositorio almacena las siguientes ramas principales:

source: The I2P router and associated programs
es: El enrutador ('router') I2P y los programas asociados

source: The I2P project website
es: El sitio web del proyecto I2P

source: Syndie, a distributed forums tool
es: Syndie, una herramienta de forums distribuídos.

source: By convention, the I2P Monotone repository is named <code>i2p.mtn</code>. Before pulling source code from servers, a database for your repository will need to be initialized. To initialize your local repository, change into the directory that you want the <code>i2p.mtn</code> file and branch directories to be stored and issue the following command:
es: Por convención, el repositorio de I2P Monotone se llama <code>i2p.mtn</code>. Antes de obtener código fuente desde los servidores, es necesario que sea inicializada una base de datos para su repositorio. Para inicializar su repositorio local vaya al directorio donde quiera que el fichero <code>i2p.mtn</code> y los subdirectorios sean guardados, y use el siguiente comando:

source: Keys which developers use to commit code are essential for trust evaluation in Monotone. The other developers' transport keys are only required for Monotone server operators.
es: Las claves que los desarrolladores usan para consignar ('commit') código son esenciales para la evaluación de confianza en Monotone. Las otras claves de transporte de desarrolladores sólo son requeridas para operadores de servidor Monotone.

source: Developers' commit keys are provided GPG-signed <a href="%(signedkeys)s">on another page</a>.
es: Las claves de consignación ('commit') de desarrolladores se proporcionan firmadas-con-GPG <a href="%(signedkeys)s">en otra página</a>.

source: To import developers' keys after verifying their authenticity, copy <a href="%(devkeys)s">all of the keys</a> into a new file. Create this file (e.g. <code><b>keys.txt</b></code>) in the same directory where <code>i2p.mtn</code> is located. Import the keys with the command:
es: Para importar claves de desarrollador tras verificar sus autenticidades, copie <a href="%(devkeys)s">todas las claves</a> en un nuevo fichero. Cree este fichero (ej. <code><b>keys.txt</b></code>) en el mismo directorio donde <code>i2p.mtn</code> resida. Luego importe las claves con el comando:

source: <b>Note</b>: <i>Never</i> add keys to <code><b>$HOME/.monotone/keys</b></code> manually.
es: <b>Nota</b>: <i>Nunca</i> añada claves a <code><b>$HOME/.monotone/keys</b></code> manualmente.

source: The default Monotone trust policy is way too lax for our requirements: every committer is trusted by default. That is not acceptable for I2P development.
es: La política de confianza de monotone es demasiada relajada para nuestras necesidades: todos los colaboradores son de confianza por defecto. Esto no es aceptable para el desarrollo de I2P.

source: Change into the directory <code><b>$HOME/.monotone</b></code> and open the file <code>monotonerc</code> with a text editor. Copy and paste the following two functions into this file:
es: Vaya al directorio <code><b>$HOME/.monotone</b></code> y abra el fichero <code>monotonerc</code> con un editor de texto. Copie y pegue las dos siguientes funciones en este fichero:

source: The first function determines an intersection between two sets, in our case a revision's signers and trusted signers.
es: La primera función determina una intersección entre dos grupos, en nuestro caso los firmantes de la revisión y los firmantes de confianza.

source: The second function determines trust in a given revision, by calling the first function with "signers" and "trusted" as arguments. If the intersection is null, the revision is not trusted. If the intersection is not empty, the revision is trusted. Otherwise, the revision is not trusted.
es: La segunda función determina la confianza en una revisión dada, mediante una llamada a la primera con "signers" (firmantes) y "trusted" (confiables) como argumentos. Si la intersección de ambos es nula, no es confiable. Si la intersección no está vacía, la revisión es confiable. De otra manera, la revisión no es confiable.

source: More information about Trust Evaluation Hooks can be found in the <a href="http://www.monotone.ca/docs/Hooks.html">official Monotone documentation</a>.
es: Más información acerca de enganches ('hooks') de evaluación de confianza puede encontrarse <a href="http://www.monotone.ca/docs/Hooks.html">documentación oficial de Monotone</a>.

source: Enter the directory where you initialized <code>i2p.mtn</code>. Depending on whether you want only I2P sources, or also sources for the I2P website and Syndie, you can perform the <code>pull</code> operation in different ways.
es: Entre en el directorio donde inicializó <code>i2p.mtn</code>. Dependiendo de si quiere sólo el código fuente de I2P, o también quiere el código del sitio web de I2P y Syndie, puede realizar <code>pull</code> (obtención) de diferentes maneras.

source: If you only want I2P sources:
es: Si sólo quiere el código fuente de I2P:

source: If you want all branches:
es: Si quiere todas las ramas de desarrollo (`branches`):

source: If the transfer aborts before completing sucessfully, simply repeating the pull command will resume the transfer.
es: Si la transferencia se interrumpe antes de completarse con éxito, simplemente repitiendo el comando pull se retomará la transferencia.

source: Pulling in the above examples is done anonymously by specifying an empty transport key. If everyone pulls anonymously it will be harder for an attacker who gains control of the server to selectively provide some people with tampered data.
es: La obtención (`pulling`) en los ejemplos anteriores se realiza anónimamente especificando una clave de transporte vacía. Si todos realizaran obtenciones anónimas será más difícil para un atacante que gane control en el servidor, proporcionar datos falsos selectivamente a algunas personas.

source: To verify that trust evaluation works:
es: Para verificar que la evaluación de confianza funciona:

source: Make a backup of your <code>monotonerc</code> file.
es: Haga una copia de respaldo de su fichero <code>monotonerc</code>.

source: Modify <code><b>monotonerc</b></code> by setting the trusted_signers variable in the following way:
es: Modifique <code><b>monotonerc</b></code> estableciendo la variable trusted_signers (firmantes confiables) de la siguiente manera:

source: With <code><b>monotonerc</b></code> configured as above, Monotone will no longer trust any committers. Confirm this by changing into the directory where <code>i2p.mtn</code> was created and attempt a checkout of the I2P branch:
es: Con <code><b>monotonerc</b></code> configurado de la forma previa, Monotone no confiará en adelante en ninguno de los consignadores (`committers`). Confirme esto llendo al directorio donde <code>i2p.mtn</code> fue creado, e intente una revisión de la rama de I2P:

source: A directory named <code>i2p.i2p</code> should <b>not</b> appear. You should encounter many error messages like:
es: Un directorio llamado <code>i2p.i2p</code> <b>no</b> debería aparecer. Debería encontrar muchos mensajes de error como:

source: If you are satisfied with results, restore the backup of <code>monotonerc</code> that was created above. If you didn't create a backup as advised, re-read <a href="#setting-up-trust-evaluation-hooks">Setting up trust evaluation hooks</a>.
es: Si está satisfecho con el resultado, restaure <code>monotonerc</code> desde la copia de seguridad que fue creada antes. Si no creó una copia de seguridad como se le aconsejó, vuelva a leer <a href="#setting-up-trust-evaluation-hooks">Establecer enganches ('hooks') de evaluación de confianza</a> (monitorización).

source: If you already have a branch checked out, skip to the <a href="#updating-your-working-copy-to-the-latest-version">next section</a>.
es: Si ya ha comprobado (`checkout`) un ramal de desarrollo (`branch`), pase a la <a href="#updating-your-working-copy-to-the-latest-version">siguiente sección</a>.

source: Change into the directory where <code>i2p.mtn</code> is located. Over there issue:
es: Cambie al directorio donde se emplace <code>i2p.mtn</code>. Allí ejecute:

source: The checkout should complete without error messages and a directory named <code>i2p.i2p</code> should appear in the current directory. Congratulations! You have successfully checked out the latest I2P sources, ready to be compiled.
es: La comprobacion (`checkout`) debería completarse sin mensajes de error, y un directorio llamado <code>i2p.i2p</code> debería aparecer en el directorio actual. ¡Felicidades! Ha comprobado el último código fuente de I2P con éxito. está listo para ser compilado.

source: If you haven't done this already, pull fresh code from the server to your local Monotone repository. To accomplish this, change into the directory where <code>i2p.mtn</code> is located and issue:
es: Si no ha hecho esto ya, sincronice su repositorio local con código fresco desde el servidor. Para lograr esto, vaya al directorio donde se emplace <code>i2p.mtn</code> y ejecute:

source: Now change into your <code>i2p.i2p</code> directory, and over there issue:
es: Ahora vaya a su directorio <code>i2p.i2p</code>, y allí ejecute:

source: As long as there were no errors&hellip;Congratulations! You have successfully updated to the latest I2P sources. They should be ready to compile.
es: En tanto no haya errores&hellip;¡Felicidades! Ha realizado la actualización al último código fuente de I2P con éxito. Debe estar listo para compilar.

source: Obtaining and deploying developers' transport keys
es: Obtención y despliegue de claves de transporte de desarrolladores

source: As a server operator you may want to grant push access to certain developers.
es: Como operador de servidor, podría querer otorgar acceso a modificación (`push`) del código a ciertos desarrolladores.

source: By default the Monotone server denies all access.
es: El servidor Monotone deniega todo acceso por defecto.

source: To grant pull access to all clients, set the following in
es: Para garantizar acceso de sincronización local (`pull`) a todos los clientes, configure lo siguiente en

source: No one will not be able to push code to your server without permission being explicitly granted. To grant push access:
es: Nadie será capaz de modificar código en su servidor (`push`) sin serle otorgado permiso explícito. Para otorgar acceso de modificación:

source: Add the name of the user's transport key to <code>$HOME/.monotone/write-permissions</code>, such as <code><pre> zzz-transport@mail.i2p complication-transport@mail.i2p </pre></code> with one key per line.
es: Añada el nombre de la clave de transporte del usuario en <code>$HOME/.monotone/write-permissions</code> como <code><pre> zzz-transport@mail.i2p complication-transport@mail.i2p </pre></code> con una clave por línea.

source: Import the transport key(s) into your database. The procedure for importing transport keys is the same as for importing commit keys, which is described in the section <a href="#obtaining-and-deploying-developers-keys">Obtaining and deploying developers' keys</a>.
es: Importe la(s) clave(s) de transporte a su base de datos. El procedimiento para importar claves de transporte es el mismo que para importar claves de consignación (`commit`), que se describe en la sección <a href="#obtaining-and-deploying-developers-keys">Obtención y despliegue de claves de transporte de desarrolladores</a>.

source: A separate database should be used for your Monotone server because monotone will lock the database while it is served to others. Make a copy of your development database, then start the server with:
es: Se debe usar una base de datos aparte para su servidor Monotone porque Monotone bloqueará la base de datos mientras sea servida a otros. Haga una copia de su base de datos de desarrollo, y luego inicie el servidor con:

source: If your key is protected with a passphrase, Monotone may request the passphrase when the first client connects. You can work around this by connecting making the first client connection to your server (or by clearing the password for your transport key).
es: Si su clave está protegida con una frase-contraseña, Monotone puede requerir la frase-contraseña cuando conecte el primer cliente. Puede evitar esto realizando usted la primera conexión de cliente a su servidor (o eliminando la contraseña para su clave de transporte).

source: For your server to be accessible for others over I2P, you will need to create a server tunnel for it. Use the "Standard" tunnel type and "Bulk" profile.
es: Para que su servidor sea accesible para otros sobre I2P, tendrá que crear un túnel de servidor para él. Use el tipo de túnel "Standard" y el perfil "Bulk" (masivo).

source: Debian (amongst other distributions) has integrated Monotone into their framework of daemons/services. Although Monotone servers can still be run "the ordinary way" on Debian systems, doing it the "Debian way" may be more straightforward.
es: Debian (entre otras distribuciones) tiene integrado Monotone en sus estructuras demonios/servicios. Aunque los servidores Monotone aún se pueden ejecutar "de la forma corriente" en sistemas Debian, hacerlo "de la forma Debian" podría ser más apropiado.

source: Permissions are granted by editing the files <code>/etc/monotone/read-permissions</code> and <code>/etc/monotone/write-permissions</code>. You'll also need to edit <code>/etc/default/monotone</code> to enable monotone to start at boot or to customize the host, port, or database location.
es: Los permisos se otorgan editando los ficheros <code>/etc/monotone/read-permissions</code> y <code>/etc/monotone/write-permissions</code>. También tendrá que editar <code>/etc/default/monotone</code> para hacer que Monotone se inicie en el arranque o para ajustar anfitrión (`host`), puerto, o emplazamiento de la base de datos.

source: New Developer's Guide
es: Guía para nuevos desarrolladores

source: So you want to start work on I2P? Great! Here's a quick guide to getting started on contributing to the website or the software, doing development or creating translations.
es: ¿Entonces, quiere empezar a trabajar en I2P? ¡Bien! Aquí tiene una pequeña guía de como empezar contribuyendo, con la web o con el software, programando código o traduciendo.

source: Not quite ready for coding? Try <a href="%(volunteer)s">getting involved</a> first.
es: ¿Aún no está listo para programar? Pruebe primero a <a href="%(volunteer)s">involucrarse</a> en el proyecto.

source: Basic study
es: Estudios básicos

source: Getting the I2P code
es: Obteniendo el código de I2P

source: Building I2P
es: Compilando I2P

source: Development ideas
es: Ideas para desarrollar

source: Making the results available
es: Haciendo que los resultados estén disponibles

source: Get to know us!
es: ¡Conózcanos!

source: Translations
es: Traducciones

source: Tools
es: Herramientas

source: Basic development on the I2P router or the embedded applications uses Java as the main development language. If you don't have experience with Java, you can always have a look at <a href="http://www.mindview.net/Books/TIJ/">Thinking in Java</a>.
es: El desarrollo básico del ruter de I2P y de las aplicaciones del núcleo utilizan Java como lenguaje de programación. Si no tiene experiencia con Java, siempre puede echarle un ojo a <a href="http://www.mindview.net/Books/TIJ/">Thinking in Java</a>.

source: Study the <a href="%(intro)s">how intro</a>, the <a href="%(docs)s">other "how" documents</a>, the <a href="%(techintro)s">tech intro</a>, and associated documents. These will give you a good overview of how I2P is structured and what different things it does.
es: Estudie la <a href="%(intro)s">introducción de cómo</a>, los <a href="%(docs)s">otros "como" documentos</a>, la <a href="%(techintro)s">introducción técnica</a>, y los documentos asociados. Esto le dará una buena vista general de como está estructurado y de qué otras cosas hace I2P.

source: For development on the i2p router or the embedded applications, get the monotone source repository installed - short instructions:
es: Para programar la consola de I2P o las aplicaciones principales, instale el código del repositorio de monotone - instrucciones rápidas:

source: Install <a href="http://www.monotone.ca/">monotone</a>. Monotone is a version control system. We use it because it allows us to keep track of who does what changes to the source code (and for a lot of complicated things, but 'keeping track of changes' is the basic idea).
es: Instale <a href="http://www.monotone.ca/">monotone</a>. Monotone es un sistema de control de versiones. Lo utilizamos porque nos permite llevar el control de quien cambia el código (y muchas cosas complicadas más, pero el control de los cambios es el motivo principal)

source: Skim over the <a href="http://www.monotone.ca/docs/Tutorial.html">monotone tutorial</a>, to make sure you understand the concepts.
es: Eche una ojeada al <a href="http://www.monotone.ca/docs/Tutorial.html">tutorial de monotone</a> para asegurarse de que entiende los conceptos

source: If you want to remain anonymous, you need to do an additional step, to set up a connection to a monotone server over I2P:
es: Si desea permanecer anónimo necesita un paso adicional, configurar una conexión al servidor de monotone a través de I2P:

source: Enable the <a href="%(i2ptunnel)s">i2ptunnel</a> client tunnel on port 8998 pointing to mtn.i2p2.i2p.
es: Habilite el túnel cliente <a href="%(i2ptunnel)s">i2ptunnel</a> en e puerto 8998 apuntando a mtn.i2p2.i2p.

source: Pick a directory where you want to put all your I2P files, and create a monotone database:
es: Elija un directorio donde quiera poner todos los archivos de I2P, y cree una base de datos para monotone:

source: Define the trust list by creating <code>~/.monotone/monotonerc</code> (or <code>_MTN/monotonerc</code> in the i2p.i2p workspace) with the following contents:
es: Defina la lista de confianza creando <code>~/.monotone/monotonerc</code> (o <code>_MTN/monotonerc</code> en el área de trabajo de i2p.i2p ) con el siguiente contenido:

source: Copy and paste the <a href="%(devkeys)s">developer's commit keys</a> into a new file (e.g. <code>keys.txt</code>) in the same directory that <code>i2p.mtn</code> is in. Import the keys into your database with <br><code><pre> mtn -d i2p.mtn read < keys.txt</pre></code>
es: Copie y pegue las <a href="%(devkeys)s">claves de los desarrolladores</a> en un nuevo archivo (por ejemplo <code>keys.txt</code>) en el mismo directorio que está <code>i2p.mtn</code>. Importe las claves a su base de datos con <br><code><pre> mtn -d i2p.mtn read < keys.txt</pre></code>

source: Pull the I2P sources to your machine. This may take a long time, especially if you are doing this over I2P!
es: Descargue el código de I2P a su ordenador. ¡Puede tardar bastante, sobre todo si lo hace a través de I2P!

source: Anonymously:
es: Anónimamente:

source: Non-anonymously:
es: Sin anonimato:

source: Alternatively, instead of 'mtn.i2p2.de', you can also download from mtn.i2p-projekt.de.
es: También puede descargarlo desde mtn.i2p-projekt.de además de 'mtn.i2p2.de'.

source: All the sources are now present on your machine, in the database file. To make them available in a directory, you need to check them out:
es: Todo el código esta ahora en su ordenador, en al archivo de la base de datos. Para hacerlo accesible en el directorio necesita ejecutar:

source: The above command creates a directory i2p.i2p, which contains all of the I2P sources.
es: El comando anterior crea el directorio i2p.i2p, el cual contiene todo el código de I2P.

source: Remarks
es: Notas

source: To download the website files instead of the I2P source files, use 'i2p.www' instead of 'i2p.i2p'.
es: Para descargar la página web en vez del código use 'i2p.www' en vez de 'i2p.i2p'.

source: The initial pull may take several hours using the tunnel. If it fails after a partial pull, simply rerun it, it will start where it left off. If you are in a hurry, use the non-anonymous access.
es: La descarga inicial puede tardar varias horas. Si falla después de una descarga parcial, simplemente vuelva a ejecutar el mismo comando y empezará donde lo dejó. Si tiene prisa use el sistema de acceso no anónimo

source: A full list of branches, including i2p.i2p and i2p.www can be found on <a href="%(viewmtn)s">viewmtn</a>.
es: Una lista completa de servidores de descarga, incluyendo i2p.i2p y i2p.www puede encontrarse en <a href="%(viewmtn)s">viewmtn</a>.

source: A long explanation about using monotone is available on the <a href="%(monotone)s">monotone page</a>.
es: Una explicación completa de cómo usar monotone está disponible en la <a href="%(monotone)s">web de monotone</a>.
