Repository: Artogn/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/messages.po
Languages: de, es, fr

source: If Bob wants to reply to Alice, he simply goes through the same process - send a message out one of his outbound tunnels targeting one of Alice's inbound tunnels (tunnel 1 or 2). To make things easier, most messages sent between Alice and Bob are <a href="%(garlicrouting)s">garlic</a> wrapped, bundling the sender's own current lease information so that the recipient can reply immediately without having to look in the network database for the current data.
de: Antwortet Bob nun Alice, geschieht dieses auf der selben Art und Weise - er sendet eine Nachricht &uuml;ber einen seiner Ausgangstunnel in Richtung eines von Alice Eingangstunnels (Tunnel 1 oder 2). Um vieles einfacher zu machen, sind viele Nachrichten zwischen Bob und Alice in sogenannte "<a href="%(garlicrouting)s">Garlics</a>" eingepackt, in denen die Lease Information vom Sender enthalten ist, so das der Empf&auml;nger sofort antworten kann ohne in der Netzwerk Datenbank nach den ben&ouml;tigten Informationen suchen zu m&uuml;ssen.
es: Si Bob quiere contestar a Alice, simplemente utilizará el mismo proceso - envía un mensaje por uno de sus túneles de salida en dirección hacia uno de los túneles de entrada de Alice (túnel 1 o 2). Para hacer las cosas más sencillas, la mayor parte de los mensajes enviados entre Alice y Bob usan el envoltorio <a href="%(garlicrouting)s">garlic</a>, incluyendo la información de arrendamiento propia del remitente en el paquete, de esta forma el destinatario puede contestar inmediatamente sin necesidad de buscar el dato en su base de datos de red.
fr: Si Bob veut répondre ?| Alice, il utilise simplement la même procédure: envoyer un message via un de ses tunnels sortants en ciblant un des tunnels entrants d'Alice (tunnel 1 ou 2). Pour rendre les choses plus faciles, la plupart des messages circulant entre Alice et Bob sont empaquetés "?| la <a href="%(garlicrouting)s">garlic"</a>, embarquant les informations sur le bail actuel de l'expéditeur, de sorte que le destinataire puisse répondre immédiatement sans avoir ?| interroger la base de donnée.

source: To deal with a wide range of attacks, I2P is fully distributed with no centralized resources - and hence there are no directory servers keeping statistics regarding the performance and reliability of routers within the network. As such, each router must keep and maintain profiles of various routers and is responsible for selecting appropriate peers to meet the anonymity, performance, and reliability needs of the users, as described in the <a href="%(peerselection)s">peer selection</a> page.
de: Um einigen Attacken aus dem Wege zu gehen ist I2P dezentral aufgebaut, ohne eine zentrale Instanz - und wie schon richtig geraten existiert kein zentraler Verzeichnisdienst, der Informationen zur Performance und Kontinuit&auml;t der Router im Netzwerk verwaltet. Daraus folgt, da?~_jeder Router eigene Profile verschiedener Router halten und pflegen muss. Ebenso ist jeder Router selber verantwortlich f&uuml;r die Auswahl der korrekten Knoten um die Anforderungen an die Anonymit&auml;t, Performance und Konitnuit&auml;t des Benutzers zu erf&uuml;llen, so wie es in der "<a href="%(peerselection)s">Knoten Auswahl</a>" Seite beschrieben ist.
es: Para tratar con un ámplio rango de ataques, I2P es completamente distribuida sin recursos centralizados - no hay servidores de directorio manteniendo estadísticas sobre el rendimiento y fiabilidad de los routers dentro de la red. De esta forma cada router debe guardar y mantener los perfiles de varios routers y es responsable de seleccionar los pares apropiados para satisfacer el anonimato, rendimiento y fiabilidad requeridos por los usuarios tal y como se describe en la página <a href="%(peerselection)s">selección de pares</a>.
fr: Pour gérer une grande gamme d'attaques, I2P est entièrement <b>décentralisé</b> et en conséquence il n'y a pas de serveur d'annuaire conservant des statistiques de performances et de fiabilité Donc chaque routeur doit garder et entretenir les profils de divers routeurs et est responsable de la sélection de pairs appropriés aux besoins d'anonymat, de performance et de fiabilité des utilisateurs, comme expliqué sur la page <a href="%(peerselection)s">sélection de pairs</a>.

source: The network itself makes use of a significant number of <a href="%(cryptography)s">cryptographic techniques and algorithms</a> - a full laundry list includes 2048bit ElGamal encryption, 256bit AES in CBC mode with PKCS#5 padding, 1024bit DSA signatures, SHA256 hashes, 2048bit Diffie-Hellman negotiated connections with station to station authentication, and <a href="%(elgamalaes)s">ElGamal / AES+SessionTag</a>.
de: Das Netzwerk selber nutzt eine signifikante Anzahl von <a href="%(cryptography)s">Kryptographischen Techniken und Algorhytmen</a> - die Liste umf&auml;sst 2048bit ElGamal Verschl&uuml;sselung, 256bit AES im CBC Modus mit PKCS#5 Padding, 1024bit DSA Signaturen, SHA256 Hashes, 2048bit Diffie-Hellmann vermittelte Verbindungen mit Station-zu-Station Authentifizierung und <a href="%(elgamalaes)s"> ElGamal / AES+SessionTag</a>.
es: La red hace uso de un significante número de <a href="%(cryptography)s">técnicas criptográficas y algoritmos</a> - una lista completa incluye cifrado El Gamal de 2048 bits, AES de 256 bits en modo CBC con relleno PKCS#5, firmas DSA de 1024 bits, hashes SHA256, negociación de conexiones Diffie-Hellman de 2048 bits con autenticación estación a estación y <a href="%(elgamalaes)s"> ElGamal / AES+SessionTag</a>.
fr: Le réseau fait usage d'un nombre significatif de <a href="%(cryptography)s">techniques et algorithmes cryptographiques</a>: la liste complète est constituée des cryptages ElGamal ?| 2048bits, AES 256bits en mode CBC avec bourrage PKCS#5, des signatures DSA ?| 1024bits, des hachages SHA256, de l'authentification de connexions station ?| station négociée en Diffie-Hellman 2048bit, et <a href="%(elgamalaes)s">ElGamal / AES+SessionTag</a>.

source: Content sent over I2P is encrypted through three layers garlic encryption (used to verify the delivery of the message to the recipient), tunnel encryption (all messages passing through a tunnel is encrypted by the tunnel gateway to the tunnel endpoint), and inter router transport layer encryption (e.g. the TCP transport uses AES256 with ephemeral keys).
de: Daten die &uuml;ber I2P gesendet werden, durchlaufen 3 Verschl&uuml;sselungen: garlic Verschl&uuml;sselung (zur &uuml;berpr&uuml;fung ob die Nachrichten beim Empf&auml;nger angekommen ist), Tunnel Verschl&uuml;sselung (alle Nachrichten, die durch einen Tunnel gehen, sind vom Tunnel Gateway bis zum Tunnel Endpunkt verschl&uuml;sselt) und Zwischen-den-Routern-Transport-Schicht Verschl&uuml;sselung (z.B. benutzt der TCP Transport AES256 mit Ephemeral Schl&uuml;ssel).
es: El contenido enviado sobre I2P está cifrado a través del cifrado garlic de tres capas (usado para verificar la entrega del mensaje a destinatario), cifrado de túnel (todos los mensajes cruzando a través de un túnel están cifrados desde el túnel gateway hasta el túnel destino final) y cifrado de la capa de transporte inter-router (e. g. el transporte TCP usa AES256 con claves efímeras).
fr: Les contenus envoyés sur I2P sont cryptés ?| travers un cryptage en têtes d'ail ("garlic") ?| trois niveaux (utilisé pour vérifier la réception du message par le destinataire), par le cryptage de tunnel (tous les messages traversant un tunnel sont cryptés par la passerelle du tunnel ?| l'intention du point de sortie du tunnel), et par un cryptage de la couche transport inter routeurs (p.e. le transport TCP utilise des clés AES256 éphémères).

source: End-to-end (I2CP) encryption (client application to server application) was disabled in I2P release 0.6; end-to-end (garlic) encryption (I2P client router to I2P server router) from Alice's router "a" to Bob's router "h" remains. Notice the different use of terms! All data from a to h is end-to-end encrypted, but the I2CP connection between the I2P router and the applications is not end-to-end encrypted! A and h are the routers of Alice and Bob, while Alice and Bob in following chart are the applications running atop of I2P.
de: Ende-zu-Ende (I2CP) Verschl&uuml;sselung (von Programm zu Programm) wurde in der I2P Version 0.6 deaktiviert; Ende-zu-Ende (garlic) Verschl&uuml;sselung von Alice Router "a" zu Bobs Router "h" existiert weiterhin. Bitte beachte im foglendem Bild den anderen Gebrauch der W&ouml;rter! a und h sind die I2P Router mit der Ende-zu-Ende Verschl&uuml;sselung von Router zu Router, Alice und Bob hingegen sind die Programme die mittels(unverschl&uuml;sseltem) I2CP mit den I2P Routern kommunizieren! Sprich: bis zum I2P Router sind die Daten unverschl&uuml;sselt, ab dem I2P Router ist alles Ende-zu-Ende verschl&uuml;sselt.
es: El cifrado (I2CP) punto a punto (aplicación cliente hacia aplicación servidor) fué deshabilitado en la versión 0.6 de I2P; el cifrado (garlic) punto a punto (router cliente I2P hacia router servidor I2P) desde el router de Alice "a" hasta el router de Bob "h" permanece. ¡Observa el diferente uso de términos! Todos los datos desde "a" hasta "h" están cifrados punto a punto, pero las conexiones I2CP entre el router I2P y las aplicaciones no son cifradas punto a punto. "A" y "h" son los routers de Alice y Bob, mientras que, y siguiendo el diagrama, Alice y Bob son las aplicaciones corriendo encima de I2P.
fr: Le cryptage de bout en bout (I2CP) (application cliente ?| application serveur) a été désactivée dans la version 0.6; Le cryptage (garlic) de bout en bout (routeur I2P client ?| routeur I2P serveur) depuis le routeur "a" d'Alice vers le "h" de Bob est restée. Remarquez l'utilisation différente des termes! Toutes les données transitant de "a" ?| "h" sont cryptées de bout en bout, mais la connexion I2CP entre le routeur et les applications ne l'est pas! "a" et "h" sont les routeurs d'Alice et Bob, alors qu'Alice et Bob dans le schéma suivant <b>sont</b> les applications qui tournent sur I2P.

source: End to end layered encryption
fr: Cryptage en couches de bout en bout

source: The specific use of these algorithms are outlined <a href="%(cryptography)s">elsewhere</a>.
de: Die genaue Anwendung dieser Algorhytmen sind <a href="%(cryptography)s">woanders</a> beschrieben.
es: El uso específico de estos algoritmos está descrito en <a href="%(cryptography)s">otra parte</a>.
fr: Les utilisations spécifiques de ces algorithmes sont précisées <a href="%(cryptography)s">ailleurs</a>.

source: The two main mechanisms for allowing people who need strong anonymity to use the network are explicitly delayed garlic routed messages and more comprehensive tunnels to include support for pooling and mixing messages. These are currently planned for release 3.0, but garlic routed messages with no delays and FIFO tunnels are currently in place. Additionally, the 2.0 release will allow people to set up and operate behind restricted routes (perhaps with trusted peers), as well as the deployment of more flexible and anonymous transports.
de: Die zwei Hauptbestandteile f&uuml;r den milit&auml;rischen Grad der Anonymit&auml;t sind explizite, verz&ouml;gerte garlic geroutete Nachrichten und mehr umfassende Tunnel mit Unterst&uuml;tzung von Pooling und Mixen von Nachrichten. Diese Funktionen sind zur Zeit f&uuml;r Version 3.0 geplant, aber garlic geroutete Nachrichten mit keiner Verz&ouml;gerung und FIFO Tunnels sind schon implementiert. Zus&auml;tzlich wird die Version 2.0 den Leuten erlauben, I2P hinter beschr&auml;nkten Routen (m&ouml;glicherweise mit vertrauten Knoten) aufzusetzen und zu betreiben; ebenso werden die flexiblere und anonymere Transports eingebaut werden.
es: Los dos mecanismos principales que permiten usar la red a gente que necesita fuerte anonimato son explicitamente mensajes enrutados garlic con retardo y túneles más completos que incluyan agrupamiento y mezcla de mensajes. Estos están actualmente planeados para la release 3.0, pero los mensajes enrutados garlic sin retardo y túneles FIFO están ya implementados. Adicionalmente la release 2.0 permitirá a los usuarios establecerse y operar detrás de routers restrictivos (puede que con pares de confianza), así como el despliegue de transportes más flexibles y anónimos.
fr: Les deux mécanismes principaux permettant l'usage du réseau ?| ceux qui ont besoin d'un anonymat fort sont très explicitement le routage "garlic" retardé et des tunnels plus évolués incluant la possibilité d'appeler et de croiser les messages. Ils sont actuellement planifiés pour la version 3.0, mais le routage "garlic" instantané et les tunnels FIFO sont d'ores et déj?| opérationnels. La version 2.0 permettra de mettre en place des routes réservées (peut-être avec des pairs de confiance), ainsi que des transports plus souples et plus anonymes.

source: Some questions have been raised with regards to the scalability of I2P, and reasonably so. There will certainly be more analysis over time, but peer lookup and integration should be bounded by <code>O(log(N))</code> due to the <a href="%(netdb)s">network database</a>'s algorithm, while end to end messages should be <code>O(1)</code> (scale free), since messages go out K hops through the outbound tunnel and another K hops through the inbound tunnel, with K no longer than 3. The size of the network (N) bears no impact.
es: Han surgido algunas preguntas referentes a la escalabilidad de I2P. Habrá ciertamente más análisis con el tiempo, pero la búsqueda e integración de pares debería ser limitado por <code>O(log(N))</code> debido al algoritmo de <a href="%(netdb)s">base de datos de red</a>, mientras que los mensajes punto a punto serían <code>O(1)</code> (escala libre), puesto que los mensajes pasan por K saltos a través del túnel de salida y otros K saltos por el túnel de entrada, donde K no es mayor de 3. El tamaño de la red (N) no acarrea impacto.
fr: Des questions on surgit ?| juste titre sur l'évolutivité d'I2P en terme d'échelle. Il y aura certainement plus d'analyse avec le temps, mais l'intégration et la recherche des pairs devraient répondre ?| <b> <code>O(log(N))</code></b> grâce ?| l'algorithme de la <a href="%(netdb)s">base de données</a>, alors que les messages seraient plutôt liés ?| <b><code>O(1)</code></b> (non dépendance ?| l'échelle), car les messages passent par K sauts du tunnel sortant puis encore K sauts via le tunnel entrant, avec K inférieur ou égal ?| 3. La taille du réseau (N) n'a aucun impact.

source: When?
de: Wann?
es: ¿Cuándo?
fr: Quand?

source: I2P initially began in Feb 2003 as a proposed modification to <a href="http://freenetproject.org">Freenet</a> to allow it to use alternate transports, such as <a href="http://java.sun.com/products/jms/index.jsp">JMS</a>, then grew into its own as an 'anonCommFramework' in April 2003, turning into I2P in July, with code being written in earnest starting in August '03. I2P is currently under development, following the <a href="%(roadmap)s">roadmap</a>.
es: I2P comenzó inicialmente en 2003 como una propuesta de modificar <a href="http://freenetproject.org">Freenet</a> para permitir el uso de transportes alternativos, como puede ser <a href="http://java.sun.com/products/jms/index.jsp">JMS</a>, después se desarrolló con identidad propia como una 'anonCommFramework' en Abril de 2003, convirtiendose en I2P en Julio y comenzando a escribir código seriamente en Agosto de 2003. I2P está actualmente bajo desarrollo siguendo la <a href="%(roadmap)s">hoja de ruta</a>.
fr: I2P a commencé en février 2003 en tant que proposition de modification de <a href="http://freenetproject.org">Freenet</a> pour lui permettre d'utiliser d'autres modes de transferts, comme <a href="http://java.sun.com/products/jms/index.jsp">JMS</a>, puis a évolué de son côté en 'anonCommFramework' en avril 2003, pour devenir I2P en juillet, l'écriture du code ayant sérieusement commencé en août 2003. I2P est actuellement en phase de développement et suit sa <a href="%(roadmap)s"> feuille de route</a>.

source: Who?
de: Wer?
es: ¿Quiénes?
fr: Qui?

source: We have a small <a href="%(team)s">team</a> spread around several continents, working to advance different aspects of the project. We are very open to other developers who want to get involved and anyone else who would like to contribute in other ways, such as critiques, peer review, testing, writing I2P enabled applications, or documentation. The entire system is open source - the router and most of the SDK are outright public domain with some BSD and Cryptix licensed code, while some applications like I2PTunnel and I2PSnark are GPL. Almost everything is written in Java (1.5+), though some third party applications are being written in Python and other languages. The code works on <a href="http://java.com/en/">Sun Java SE</a> and other Java Virtual Machines.
es: Tenemos un pequeño <a href="%(team)s">equipo</a> desperdigado por varios continentes y trabajando en el avance de diferentes aspectos del proyecto. Estamos abiertos a otros desarrolladores que deseen involucrarse en el proyecto, y a cualquier otra persona que quiera contribuir de cualquier forma, como críticas, revisión de pares, pruebas, programación de aplicaciones compatibles I2P, o documentación. El sistema completo es código abierto - el router y la mayor parte del SDK tienen licencia de dominio público con algo de código licenciado con BSD y Cryptix, mientras que aplicaciones como I2PTunnel e I2PSnark son GPL. Casi todo está escrito en Java (1.5+), aunque algunas aplicaciones de terceros están siendo escritas en Python u otros lenguajes. El código funciona en <a href="http://java.com/en/">Sun Java SE</a> y otras máquinas virtuales Java.
fr: Nous sommes une petite <a href="%(team)s">équipe</a> répartie sur plusieurs continents, qui travaille ?| l'avancement de différents aspects du projet. Nous sommes complètement ouverts ?| l'arrivée d'autre développeurs qui voudraient s'impliquer et ?| celle de quiconque préfèrerait participer d'autres façons, telles que la critique, l'analyse de pair, le test, l'écriture d'applications compatibles, ou de documentation. Le système est totalement "open source": le routeur et presque tout l'outil de développement sont de plein droit dans le domaine public avec quelques lignes de code sous licence BSD et Cryptix, et quelques applications comme I2PTunnel et I2PSnark sous GPL. Presque tout est écrit en Java (1.5+), bien que quelques applications tierce partie soient écrites en Python et autres langages. Le code fonctionne sur <a href="http://java.com/en/">Oracle/Sun Java SE</a> et d'autres Machines Virtuelles Java.

source: Where?
de: Wo?
es: ¿Dónde?
fr: Où?

source: Anyone interested should join us on the IRC channel #i2p (hosted concurrently on irc.freenode.net, irc.postman.i2p, irc.freshcoffee.i2p, irc.welterde.i2p and irc.einirc.de). There are currently no scheduled development meetings, however <a href="%(meetings)s">archives are available</a>.
de: Jeder mit Interesse an I2P sollte uns im #i2p IRC Raum (gehostet auf irc.freenode.net, irc.postman.i2p, irc.freshcoffee.i2p, irc.welterde.i2p und irc.einirc.de) besuchen. Es gibt zur Zeit keine fest geplanten Entwicklertreffen, dennoch existiert ein <a href="%(meetings)s">Archiv</a> von abgehaltenen Entwickler Treffen.
es: Cualquiera interesado puede unirse a nosotros en el canal IRC #i2p (hospedado concurrentemente en irc.freenode.net, irc.postman.i2p, irc.freshcoffee.i2p, irc.welterde.i2p e irc.einirc.de). Actualmente no hay agenda de encuentros de desarrollo, no obstante hay <a href="%(meetings)s">archivos disponibles</a>.
fr: Toute personne intéressée peut nous joindre sur le canal IRC #i2p actuellement hébergé sur les serveurs irc.freenode.net, irc.postman.i2p, irc.freshcoffee.i2p, irc.welterde.i2p et irc.einirc.de. Il n'y a pas de rencontre de développement planifiée actuellement, mais <a href="%(meetings)s">les archives sont disponibles</a>.

source: The current source is available in <a href="%(monotone)s">monotone</a>.
de: Der aktuelle Quelltext ist in <a href="%(monotone)s">Monotone</a> verf&uuml;gbar.
es: El código actual está disponible en <a href="%(monotone)s">monotone</a>.
fr: Le code source est disponible dans <a href="%(monotone)s">monotone</a>.

source: Additional Information
es: Información adicional
fr: Plus d'infos

source: See <a href="%(how_index)s">the Index to Technical Documentation</a>.
es: Ver <a href="%(how_index)s">el Indice de la Documentación Técnica</a>.
fr: Voir la <a href="%(how_index)s">table des matières de la documentation technique</a>.
