Repository: Artogn/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/messages.po
Languages: de, es, fr

source: A Gentle Introduction
es: Una Introducción Sencilla
fr: Introduction en douceur

source: A Gentle Introduction to How I2P Works
de: Einf&uuml;hrung in die Arbeitsweise von I2P
es: Una breve presentación de cómo funciona I2P
fr: Une présentation allégée du fonctionnement d'I2P

source: I2P is a project to build, deploy, and maintain a network supporting secure and anonymous communication. People using I2P are in control of the tradeoffs between anonymity, reliability, bandwidth usage, and latency. There is no central point in the network on which pressure can be exerted to compromise the integrity, security, or anonymity of the system. The network supports dynamic reconfiguration in response to various attacks, and has been designed to make use of additional resources as they become available. Of course, all aspects of the network are open and freely available.
de: I2P ist ein Projekt, welches ein Netzwerk zum sicheren und anonymen Kommunizieren planen, aufbauen und betreuen wird. Nutzer von I2P haben die Kontrolle &uuml;ber die Verteilung zwischen Anonymit&auml;t, Verl&auml;sslichkeit, genutzter Bandbreite und Verz&ouml;gerung. Es gibt keinen zentralen Punkt im Netzwerk, welcher &uuml;bernommen werden kann um die Integrit&auml;t, Sicherheit oder Anonymit&auml;t des Systems zu komprimieren. Das Netzwerk kann sich in einer Reaktion auf Angriffe selber rekonfiguriern und wurde so geplant, das es zus&auml;tzliche Ressourcen bei deren Verf&uuml;gbarkeit nutzen wird. Selbstverst&auml;ndlich sind alle Aspekte des Netzwerkes offen und frei verf&uuml;gbar.
es: I2P es un proyecto para construir, desplegar y mantener una red que soporte comunicación segura y anónima. Los usuarios de I2P pueden administrar el balance entre el anonimato, fiabilidad, uso de ancho de banda y latencia. No hay un punto central en la red sobre el cual se pueda ejercer presión para comprometer la integridad, seguridad y anonimato del sistema. La red soporta reconfiguración dinámica en respuesta a diversos ataques, y ha sido diseñada para hacer uso de recursos adicionales según vayan estando disponibles. Por supuesto, todos los aspectos de la red son abiertos y están a libre disposición.
fr: I2P est un projet dont le but est de construire, déployer, et maintenir un réseau fournissant des communications sécurisées et anonymes. Les gens utilisant I2P ont le contrôle de l'arbitrage entre l'anonymat, la fiabilité, l'utilisation de la bande passante, et la latence. Il n'y a dans ce réseau, pas de centre sur lequel pourrait être exercée une pression en vue de compromettre l'intégrité, la sécurité, ou l'anonymat du système. Le réseau intègre sa propre reconfiguration dynamique en réponse aux diverses attaques, et a été conçu pour utiliser de nouvelles ressources au fur et ?| mesure de leur disponibilité. Bien entendu, tous les aspects du réseau sont publics et disponibles gratuitement.

source: Unlike many other anonymizing networks, I2P doesn't try to provide anonymity by hiding the originator of some communication and not the recipient, or the other way around. I2P is designed to allow peers using I2P to communicate with each other anonymously &mdash; both sender and recipient are unidentifiable to each other as well as to third parties. For example, today there are both in-I2P web sites (allowing anonymous publishing / hosting) as well as HTTP proxies to the normal web (allowing anonymous web browsing). Having the ability to run servers within I2P is essential, as it is quite likely that any outbound proxies to the normal Internet will be monitored, disabled, or even taken over to attempt more malicious attacks.
de: Im Gegensatz zu vielen anderen anonymen Netzwerken versucht I2P nicht die Anonymit&auml;t durch verstecken eines Teils einer Kommunikation, der Sender oder der Empf&auml;nger, herzustellen. I2P wurde so geplant, das Nutzer von I2P untereinander anonym kommunizieren k&ouml;nnen - Sender und Empf&auml;nger sind f&uuml;r den jeweils anderen anonym als auch f&uuml;r nicht beteiligte dritte. Zum Beispiel gibt es zur Zeit I2P interne Webseiten (die anonymes Publizieren/hosten erlauben) und einen HTTP Proxy in das normale Internet (der anonymes Browsing bietet). Server im I2P Netz betreiben zu k&ouml;nnen ist eine essentielle Angelegenheit, da angenommen werden kann, das die Proxis ins normale Internet &uuml;berwacht werden, abgeschaltet werden oder gar zu schlimmeren Angriffen genutzt werden.
es: A diferencia de la mayoría de las redes anónimas, I2P no intenta suministrar anonimato ocultándole sí al origen de una comunicación y no al destinatario, o víceversa. De lo contrario: I2P está diseñada para permitir a los pares comunicarse unos con otros anónimamente - ambos, quien envía y el que recibe, no son identificables entre ellos y tampoco por terceras partes. Por ejemplo, actualmente hay sitios web I2P internos (permitiendo publicación y hospedaje anónimo) además de proxies HTTP hacia la web normal (permitiendo navegación anónima). Disponer de la posibilidad de correr servidores internamente en I2p es esencial, ya que es bastante probable que cualquier proxy de salida hacia la Internet normal pudiera ser monitorizado, desactivado o comprometido con el intento de ataques más maliciosos.
fr: Contrairement ?| de nombreux autres réseaux anonymisants, I2P ne tente pas de procurer l'anonymat en masquant l'initiateur et pas le destinataire, ou le contraire. I2P est conçu pour permettre aux pairs l'utilisant de communiquer anonymement &mdash; l'émetteur et le récepteur sont non-identifiables l'un par l'autre comme par un tiers. Par exemple, il y a aujourd'hui des sites web intra-I2P (permettant la publication/hébergement anonymes) tout comme des serveurs mandataires HTTP vers le web normal (permettant la navigation anonyme). La possibilité d'avoir des serveurs dans I2P est essentielle, car il est plus que certain que n'importe quel proxy sortant vers l'Internet sera surveillé, désactivé, ou même piraté pour tenter des attaques encore plus pernicieuses.

source: The network itself is message oriented - it is essentially a secure and anonymous IP layer, where messages are addressed to cryptographic keys (Destinations) and can be significantly larger than IP packets. Some example uses of the network include "eepsites" (webservers hosting normal web applications within I2P), a BitTorrent client ("I2PSnark"), or a distributed data store. With the help of the <a href="%(i2ptunnel)s">I2PTunnel</a> application, we are able to stream traditional TCP/IP applications over I2P, such as SSH, IRC, a squid proxy, and even streaming audio. Most people will not use I2P directly, or even need to know they're using it. Instead their view will be of one of the I2P enabled applications, or perhaps as a little controller app to turn on and off various proxies to enable the anonymizing functionality.
de: Das Netzwerk selber ist Nachrichten basiert - es ist essentiell eine sichere und anonyme IP Schicht, in der Nachrichten an kryptographische Schl&uuml;ssel (Ziele) geschickt werden;die Nachrichten selber k&ouml;nnen signifikant gr&ouml;sser als IP Pakete werden. Beispiele f&uuml;r die Nutzung des Netzwerkes sind unter anderem "Eepsites" (Webserver mit normalen Webapplikationen innerhalb von I2P), ein <a href="http://bitconjurer.org/BitTorrent/">BitTorrent</a> Klient ("I2Psnark") oder ein verteilter Datencontainer. Mit der Hilfe von mihis <a href="%(i2ptunnel)s">I2PTunnel</a> Applikation k&ouml;nnen wir die &uuml;blichen TCP/IP Anwendungen &uuml;ber I2P tunneln, z.B. SSH, IRC, ein squid Proxy oder gar Audio. Viele Leute werden I2P nicht direkt nutzen oder nicht bemerken, das sie I2P nutzen. Stattdessen sehen sie nur eine der I2P f&auml;higen Anwendungen oder nur eine Einstellung f&uuml;r verschiedene Proxies, die ihnen Anonyme Verbindungen anbieten.
es: La red es en sí misma orientada a mensajes - es en esencia una capa IP segura y anónima donde los mensajes son direccionados hacia claves criptográficas (Destinos) y pueden ser considerablemente más largos que los paquetes IP. Algunos ejemplos del uso de la red incluyen "eepsites" (servidores web hospedando aplicaciones web normales dentro de I2P), un cliente BitTorrent ("I2PSnark"), o un sistema de almacenaje de datos distribuido. Con la ayuda de la aplicación <a href="%(i2ptunnel)s"> I2PTunnel</a>, somos capaces de correr aplicaciones TCP/IP tradicionales sobre I2P, como SSH, IRC, un proxy Squid, e igualmente streaming de audio. Mucha gente no usará I2P directamente, o mismamentee no necesitarán saber que lo están usando. En vez de eso, su percepción será la de una de las aplicaciones I2P habilitadas, o quizá la de una pequeña aplicación de control para activar y desactivar varios proxies que permitan funccionalidades de anonimato.
fr: Le réseau lui-même est "orienté messages": il est principalement constitué d'une couche IP sécurisée et anonyme, dans laquelle les messages sont adressés ?| des clés cryptographiques (Destinations) et peuvent être sensiblement plus gros que des paquets IP. ?~@ titre d'exemples d'utilisation du réseau citons les "eepsites" (serveurs web hébergeant des applications Internet normales au sein d'I2P), un client BitTorrent ("I2PSnark"), ou un système de stckage distribué. Grâce ?| l'application <a href="%(i2ptunnel)s">I2PTunnel</a>, nous pouvons utiliser des applications TCP/IP traditionnelles sur I2P, telles que SSH, IRC, un proxy squid, et même du flux audio. La plupart des gens n'utilisent pas I2P directement, ou ne ressentent même pas le besoin de savoir qu'ils l'utilisent. Au lieu de ça ils verront une des application compatibles avec I2P, ou peut-être une petite application de contrôle qui va activer ou désactiver divers proxies pour piloter la fonctionnalité d'anonymisation.

source: An essential part of designing, developing, and testing an anonymizing network is to define the <a href="%(threatmodel)s">threat model</a>, since there is no such thing as "true" anonymity, just increasingly expensive costs to identify someone. Briefly, I2P's intent is to allow people to communicate in arbitrarily hostile environments by providing good anonymity, mixed in with sufficient cover traffic provided by the activity of people who require less anonymity. This way, some users can avoid detection by a very powerful adversary, while others will try to evade a weaker entity, <i>all on the same network</i>, where each one's messages are essentially indistinguishable from the others.
de: Ein wichtiger Teil des Planens, Entwickelns und Testens eines anonymen Netzwerkes ist das Definieren des <a href="%(threatmodel)s">Angriffsszenarios</a>, da es "echte" Anonymit&auml;t nicht gibt, nur steigende Kosten und. Aufwand jemanden zu identifizieren. Kurz gesagt: I2P Absicht ist es, Personen in willk&uuml;rlichen feindseligen Umgebungen einen milit&auml;rischen Grad der Anonymit&auml;t zu bieten, versteckt in dem hinreichendem Datenstrom aus der Aktivit&auml;t anderer Leute, die weniger Anonymit&auml;t ben&ouml;tigen. Dieses beinhaltet den Chat von Joe Sixpack mit seinen Freuden, den niemanden mitlesen kann, Jane Filesharer, die wei?~_ das die grossen Konzerne sie beim Tauschen von Dateien nicht identifizieren k&ouml;nnen, als auch Will Geheimnisverr&auml;ter, der geheime Dokumente ver&ouml;ffentlicht - <i>alles in dem selben Netzwerk</i>, in dem eine Nachricht nicht von einer anderen unterschieden werden kann.
es: Una parte esencial de diseñar, desarrollar y probar una red anónima es definir el <a href="%(threatmodel)s">modelo de amenaza</a>, si partimos de que no existe lo que podría ser considerado anonimato auténtico, solamente se puede hacer más costoso el identificar a alguien. Brevemente, el propósito de I2P es permitir comunicarse a la gente en ambientes arbitrariamente hostiles suministrando buen anonimato, mezclado con suficiente tráfico de cobertura proporcionado por la actividad de gente que requiere menos anonimato. De esta forma algunos usuarios pueden evitar ser detectados por poderosos adversarios, mientras otros intentarán ocultar su identidad de forma más débil, <i>todo en la misma red</i>, donde los mensajes de cada uno son ensencialmente indistinguibles de los del resto.
fr: Un des points clés de la conception, dus développement, et du test d'un réseau anonyme est la définition de son <a href="%(threatmodel)s">modèle de sécurité</a>, car il n'existe nulle part un "vrai" anonymat, mais uniquement des moyens d'augmenter les coûts d'identification de quelqu'un. Succinctement, le but d'I2P est de permettre de communiquer dans des environnements hostiles en procurant un bon anonymat, mélangé ?| un trafic de camouflage suffisant fourni par l'activité de ceux qui ont besoin de moins d'anonymat, de sorte que certains utilisateurs puissent se soustraire ?| la détection par un adversaire très puissant, quand d'autres pourront esquiver une entité plus faible, <i>tout ceci sur le même réseau</i> dans lequel les messages des uns sont fondamentalement indistinguables de ceux des autres.

source: Why?
de: Warum?
es: ¿Por qué?
fr: Pourquoi?

source: There are a multitude of reasons why we need a system to support anonymous communication, and everyone has their own personal rationale. There are many <a href="%(networkcomparisons)s">other efforts</a> working on finding ways to provide varying degrees of anonymity to people through the Internet, but we could not find any that met our needs or threat model.
de: Es existieren eine unglaubliche Anzahl an fantastischen Gr&uuml;nden, weswegen wir ein System zum anonymen Kommunizieren ben&ouml;tigen und jeder hat seine eigenen pers&ouml;nlichen rationalen Gr&uuml;nde. Es gibt viele <a href="%(networkcomparisons)s">andere Bestrebungen</a>, die auf dem einem oder anderen Weg unterschiedliche Arten der Anonymit&auml;t im Internet zu erreichen versuchen, aber wir fanden keine, die unsere Anforderungen oder unser Angriffszenario abdeckten.
es: Puede haber multitud de razones por las que necesitemos un sistema que soporte comunicación anónima, y cada cual tendrá su razonamiento personal. Hay muchos <a href="%(networkcomparisons)s"> otros proyectos</a> trabajando en encontrar formas de suministrar a la gente diferentes grados de anonimato a través de Internet, pero no podríamos encontrar ninguno que se ajuste a nuestras necesidades o al modelo de amenaza.
fr: Il y a une multitude de raisons qui justifient que nous ayons besoin d'un système de communication anonyme, et chacun a les siennes propres. Il y a de nombreux <a href="%(networkcomparisons)s">autres efforts</a> pour trouver les moyens de fournir divers niveaux d'anonymat sur Internet, mais nous n'en avons trouvé aucun qui réponde ?| nos besoins ou ?| notre modèle de sécurité.

source: How?
de: Wie?
es: ¿Cómo?
fr: Comment?

source: The network at a glance is made up of a set of nodes ("routers") with a number of unidirectional inbound and outbound virtual paths ("tunnels", as outlined on the <a href="%(tunnelrouting)s">tunnel routing</a> page). Each router is identified by a cryptographic RouterIdentity which is typically long lived. These routers communicate with each other through existing transport mechanisms (TCP, UDP, etc), passing various messages. Client applications have their own cryptographic identifier ("Destination") which enables it to send and receive messages. These clients can connect to any router and authorize the temporary allocation ("lease") of some tunnels that will be used for sending and receiving messages through the network. I2P has its own internal <a href="%(netdb)s">network database</a> (using a modification of the Kademlia algorithm) for distributing routing and contact information securely.
de: In einer &uuml;bersicht existiert das Netzwerk aus einer Gruppe von Knoten ("Router") mit einer Anzahl an unidirektionalen virtueller Eingangs und Ausgangs Wege ("Tunnel", wie in der <a href="%(tunnelrouting)s">Tunnel Routing</a> Seite beschrieben). Jeder Router wird duch eine kryptographische RouterIdentity eindeutig indentifiziert, diese ist f&uuml;r gew&ouml;hnlich dauerhaft g&uuml;ltig. Diese Router kommunizieren &uuml;ber vorhandene Transportmechanosmen (TCP, UDP, etc.) und tauschen verschiedene Nachrichten aus. Klientprogramme haben ihre eigenen kryptographischen Ident ("Destination"), durch den sie zum Senden und Empfangen von Nachrichten bef&auml;higt sind. Diese Klienten k&ouml;nnen zu irgendwelchen Routern Verbindung aufnehmen und authorisieren ihre derzeitige Belegung ("lease") von ein paar Tunneln, die zum Senden und Empfangen von Nachrichten durch das Netzwerk benutzt werden. I2P hat eine eigene <a href="%(netdb)s">Netzwerk Datenbank</a> ("Floodfill") zum skalierbaren sicherem Verteilen von Routing und Kontaktinformationen.
es: Un vistazo a la red muestra que se compone de una instalación de nodos ("routers") con un número de rutas virtuales unidireccionales entrantes y salientes (Tunnels, como se describen en la página <a href="%(tunnelrouting)s">tunnel routing</a>). Cada router está identificado por una RouterIdentity cifrada que es permanente normalmente. Estos routers se comunican entre ellos a través de mecanismo de transporte existentes (TCP, UDP, etc) enviandose distintos mensajes. Las aplicaciones clientes tienen su propio identificador criptográfico ("Destino") que las habilita para enviar y recibir mensajes. Estos clientes pueden conectarse a cualquier router y autorizar la asignación temporal ("arrendamiento") de varios tuneles que serán usados para enviar y recibir mensaje a través de la red. I2P tiene su propia <a href="%(netdb)s">base de datos de red</a> (utilizando una modificación del algoritmo Kadeemlia) para distribuir información de rutas y contactos de forma segura.
fr: Au premier coup d'?~Sil le réseau est constitué d'un tas de n?~Suds ("routeurs") dotés d'un certain nombre de chemins virtuels entrants et sortants unidirectionnels (appelés "tunnels", expliqués sur la page <a href="%(tunnelrouting)s">routage en tunnel</a>).) Chaque routeur est identifié par l'identifiant cryptographique "RouterIdentity", typiquement de longue durée de vie. Ces routeurs communiquent par des mécanismes existants (TCP, UDP, etc). Les applications clientes ont leur propre identifiant cryptographique ("Destination") qui leur permet d'envoyer et de recevoir des messages. Ces clients peuvent se connecter ?| n'importe quel routeur et autoriser l'allocation temporaire ("lease") de quelques tunnels qui seront utilisés pour l'envoi et la réception ?| travers le réseau. I2P dispose de sa propre <a href="%(netdb)s">base de donnée réseau</a> interne (avec une modification de l'algorithme Kademlia) pour une distribution sécurisée des informations de routage et de contacts.

source: Network topology example
fr: Exemple de topologie du réseau

source: In the above, Alice, Bob, Charlie, and Dave are all running routers with a single Destination on their local router. They each have a pair of 2-hop inbound tunnels per destination (labeled 1, 2, 3, 4, 5 and 6), and a small subset of each of those router's outbound tunnel pool is shown with 2-hop outbound tunnels. For simplicity, Charlie's inbound tunnels and Dave's outbound tunnels are not shown, nor are the rest of each router's outbound tunnel pool (typically stocked with a few tunnels at a time). When Alice and Bob talk to each other, Alice sends a message out one of her (pink) outbound tunnels targeting one of Bob's (green) inbound tunnels (tunnel 3 or 4). She knows to send to those tunnels on the correct router by querying the network database, which is constantly updated as new leases are authorized and old ones expire.
de: Im oberen Bild betreiben Alice, Bob, Charlie und Dave je einen Router mit einer einzigen Destination auf ihren lokalen Router. Sie haben alle ein paar 2-Hop Eingangstunnel je Destination (mit 1, 2, 3, 4, 5 und 6 bezeichnet) und ein paar haben 2-Hop Ausgangstunnel. Zur Vereinfachung sind Charlies Eingangstunnel und Daves Ausgangstunnel nicht eingezeichnet, ebenso wie weitere Ausgangstunnel der Router (normalerweise so 5-10 Tunnel gleichzeitig). Sobald Alice und Bob miteiander reden, sendet Alice eine Nachricht &uuml;ber ihren (pinken) Ausgangstunnel in Richtung eines vons Bobs Eingangstunneln (gr&uuml;n, Tunnel 3 oder 4). Sie lernt den Eingangstunnel durch eine Abfrage der Netzwerk Datenbank kennen, diese Datenbank wird dauerhaft aktualisiert sobald neue Leases authorisiert sind und &auml;ltere auslaufen.
es: En la imagen, Alice, Bob, Charlie and Dave están corriendo routers con un simple Destino en su router local. Cada uno de ellos tiene un par de túneles de dos saltos entrantes por destino (etiquetados como 1, 2, 3, 4, 5 y 6), y una pequeña parte del grupo de los túneles de salida de esos routers se representa con tuneles de salida de dos saltos. Para simplificar, los túneles entrantes de Charlie y los de salida de Dave no se muestran, tampoco está el resto del grupo de túneles de salida de cada router (típicamente compuesto por varios túneles a la vez). Cuando Alice y Bob se comunican entre ellos, Alice envía un mensaje por uno de sus túneles de salida (rosa) en dirección a uno de los túneles entrantes (verde) de Bob (túnel 3 o 4). Ella conoce cómo enviar a los túneles del router correcto mediante consultas a la base de datos de red, que está constantemente actualizándose tan pronto cómo son autorizados nuevos arrendamientos y expiran los viejos.
fr: Ci-dessus, Alice, Bob, Charlie, et Dave ont tous leur routeur, avec une seule Destination locale. Ils ont chacun une paire de tunnels entrants ?| deux sauts par destination (repérés 1, 2, 3, 4, 5 et 6), et une petite partie des tunnels sortants de chacun de ces routeurs est montré avec des tunnels sortants ?| deux sauts. Pour simplifier, ne sont représentés ni les tunnels entrants de Charlie et les tunnels sortants de Dave, ni le reste du groupe de tunnels sortants de chaque routeur (fourni par défaut avec quelques tunnels). Quand Alice et Bob discutent ensemble, Alice envoie un message vers un de ses tunnels sortants (en rose) avec pour cible un des tunnels entrants de Bob (3 ou 4, en vert). Elle sait qu'elle doit envoyer vers ces tunnels sur le bon routeur en interrogeant la base de donnée du réseau qui est actualisée en permanence au fur et ?| mesure que les nouveaux baux sont autorisés et que les anciens expirent.
