Repository: Artogn/i2p.www
Catalog: i2p2www/translations/*/LC_MESSAGES/research.po
Languages: fr, it, pt_br, ru

source: Academic Research
fr: Recherche académique
it: Ricerca accademica
pt_br: Pesquisa acadêmica
ru: Научные исследования

source: February 2016
ru: Февраль 2016

source: Academic research and analysis of I2P is an important part of ensuring that the software and network performs as expected and is safe for users in hostile environments.
fr: La recherche académique et l'analyse de I2P est un élément important afin de s'assurer que le logiciel et le réseau fonctionne comme prévu et est sans danger pour les utilisateurs dans des environnements hostiles.
it: La ricerca e l'analisi accademica di I2P riveste un ruolo mportante per assicurarsi che le prestazioni del software e della rete siano quelle volute e gli utenti siano al riparo da ambienti ostili.
pt_br: A pesquisa acadêmica e a análise da I2P é uma parte importante para assegurar que o desempenho do software e da rede são os esperados, bem como a segurança dos usuários em ambientes hostis.
ru: Научное исследование и анализ I2P это важная часть процесса контроля безопасности програмного обеспечения и сети в целом, в опасных условиях современного мира.

source: Recent events have prompted anonymity projects to provide specific guidelines for responsible research. We endorse the <a href="%(torg)s">Tor Ethical Research Guidelines</a> and incorporate them here. Please follow the Tor guidelines when researching I2P as well.
ru: Последние события подтолкнули проекты по обеспечению анонимности предоставлять конкретные рекомендации для продуктивного исследования. Мы одобряем <a href="%(torg)s">Tor Ethical Research Guidelines</a> и внедряем их. Пожалуйста, следуйте им при исследовании I2P.

source: There is a large research community investigating a wide range of aspects of anonymity. For a current and comprehensive list of relevant papers, see the <a href="%(anonbib)s">Free Haven Anonymity Bibliography</a>. I2P benefits from much of the research into Tor and onion routing, but there is little dedicated research interest into the theory behind I2P, and the choices and tradeoffs that the network makes. This presents a unique opportunity for original research.
fr: Il y a une large communauté de recherche examinant une vaste gamme des aspects de l'anonymat. Pour une liste actuelle et compréhensive des papiers pertinents, voir la <a href="%(anonbib)s">Bibliographie du libre refuge de l'anonymat</a>. I2P bénéficie d'une grande partie de la recherche faite dans Tor et le routage en oignon, mais il y a peu d'intérêt en recherche consacrée à la théorie derrière I2P, et les choix et différences que le réseau fait. Cela présente une occasion unique pour de la recherche originale.
it: Esiste una grande comunità di ricerca che indaga una vasta gamma di aspetti relativi all'anonimato. Per un elenco aggiornato e completo di documenti, consulta la <a href="%(anonbib)s">bibliografia di Free Haven Anonymity</a>. I2P si avvantaggia di molte delle ricerche relative a Tor e all'onion routing, ma c'è poco interesse dedicato alla ricerca nel campo della teoria alla base di I2P e alle scelte e ai compromessi fatti dalla rete. Questo presenta una opportunità di ricerca originale unica.
pt_br: Há uma enorme comunidade de pesquisa investigando uma ampla variedade de aspectos do anonimato. Para uma lista abrangente e atual de artigos relevantes, dê uma olhada na <a href="%(anonbib)s">Bibliografia sobre anonimato do Free Haven</a>. A I2P se beneficia da maioria da pesquisa feita no Tor e sobre o roteamento cebola, mas há pouco esforço de pesquisa dedicado aos tópicos teóricos por trás da I2P, e às escolhas e compromissos que a rede faz. Isso apresenta uma oportunidade única para pesquisa nova e original.
ru: Существует большое сообщество занимающееся исследованием широкого спектра аспектов анонимности. Для ознакомления с текущим и исчерпывающим списком соответствующих материалов, загляните в <a href="%(anonbib)s">Free Haven Anonymity Bibliography</a>. I2P использует многие положительные результаты исследований Tor и onion маршрутизации, однако сейчас интерес к исследованию непосредственно теории работы I2P, применяемым в I2P решениям и соглашениям довольно низкий. Это, в свою очередь, предоставляет уникальную возможность для проведения оригинальных исследовательских работ.

source: A list of known published papers about I2P is available <a href="%(papers)s">here</a>.
fr: Une liste des documents publiés connus sur I2P est disponible <a href="%(papers)s">ici</a>.
it: Un elenco di documenti pubblicati inerenti a I2P di cui siamo a conoscenza è disponibile <a href="%(papers)s">qui</a>.
pt_br: Uma lista de publicações conhecidas sobre a I2P encontra-se disponível <a href="%(papers)s">aqui</a>.
ru: Список известных публикаций про I2P доступен <a href="%(papers)s">вот тут</a>.

source: See also the <a href="%(torr)s">Tor Research Home Page</a> for general guidance and links.
ru: Смотрите также <a href="%(torr)s">Tor Research Home Page</a> для общих рекомендаций и ссылок.

source: Testing Attacks on I2P
fr: Tester des attaques sur I2P
it: Collaudo degli attacchi su I2P
pt_br: Testando ataques sobre a I2P
ru: Тестовые атаки на I2P

source: I2P can be run as a separate test network by controlling the locations that a new router reseeds from so that it only finds other test routers.
fr: I2P peut être exécuté en tant que réseau de test séparé, en contrôlant les emplacements depuis lesquels un nouveau routeur se réamorce, de sorte qu'il ne trouve que d'autres routeurs de test.
it: I2P può essere eseguita come una rete di collaudo separata controllando le posizioni da cui un nuovo router effettua il reseed in modo che trovi soltanto altri router di collaudo.
pt_br: Pode-se montar uma versão de testes da I2P em separado, controlando-se os locais a partir dos quais um novo roteador propaga de modo a encontrar apenas outros roteadores de teste.
ru: I2P можно запускать как отдельную сеть, контролируя расположения, откуда новые маршрутизаторы получают свои сиды, так чтобы тестовые маршрутизаторы работали только с тестовыми маршрутизаторами.

source: The standard mode of operation is to have one JVM per router instance; hence running multiple copies of I2P on a single machine is inadvisable, both due to the potential resource drain and the certain port conflicts. To better facilitate setting up small test networks, I2P has a multirouter mode which enables multiple distinct routers to be run in the same JVM.
fr: Le mode de fonctionnement standard, c'est d'avoir une JVM par instance routeur, par conséquent l'exécution de plusieurs copies d'I2P sur une seule machine est déconseillé, tant en raison de la fuite des ressources potentielles et de la certitude de conflits de ports. Pour mieux faciliter la mise en place de petits réseaux d'essais, I2P a un mode multirouteur qui permet à plusieurs routeurs distincts d'être exécutés dans la même JVM.
it: La modalità operativa standard è di avere una JVM per ogni istanza di router; quindi non è consigliabile eseguire copie multiple di I2P su un solo computer, sia per il potenziale assorbimento di risorse sia per i conflitti che potrebbero verificarsi su determinate porte. Per facilitare meglio l'impostazione di piccole reti di collaudo, I2P dispone di una modalità multirouter che attiva molteplici router separati da eseguire sulla stessa JVM.
pt_br: O modo padrão de operação é ter uma instânca da JVM por roteador. Assim, executar múltiplas cópias do software I2P em uma única máquina é desaconselhável, tanto devido a potencial fuga e/ou esgotamento de recursos como também a determinados conflitos de portas. Para melhor facilitar a definição de pequenas redes de teste, o software I2P possui o modo multiroteador no qual é permitido que múltiplos roteadores distintos sejam executados numa mesma JVM.
ru: Стандартный способ работы это использовать одну JVM на один экземпляр маршрутизатора. Запуск нескольких копий I2P на одной машине не рекомендуется, как с точки зрения ресурсов, так и с точки зрения конфликтов по портам. Для лучшего развертывания небольших тестовых сетей, I2P может работать в режиме multirouter, который реализует запуск нескольких маршрутизаторов в рамках одной JVM.

source: MultiRouter can be started from the i2p base directory by running the below command.
fr: MultiRouteur peut être démarré à partir du répertoire de base I2P en exécutant la commande ci-dessous.
it: Il MultiRouter può essere avviato dalla cartella base di i2p eseguendo il seguente comando.
pt_br: O Multi-roteador pode ser iniciado a partir do diretório base da I2P executando-se o comando abaixo.
ru: MultiRouter можно запустить из базовой директории I2P с помощью команды ниже:

source: Additionally, I2P can be started in a virtual network mode. This mode disables all transports, allowing the router to be tested in isolation without network traffic. To enable this mode, add <code>i2p.vmCommSystem=true</code> to the router.config before starting.
fr: En outre, I2P peut être démarré dans un mode de réseau virtuel. Ce mode désactive tous les transports, ce qui permet au routeur d'être testé isolément, sans le trafic réseau. Pour activer ce mode, avant de commencer, ajouter <code>i2p.vmCommSystem=true</code> à router.config .
it: Inoltre, I2P può essere avviato in modalità di rete virtuale. Tale modalità disattiva tutti i trasporti, consentendo il collaudo del router in isolamento senza traffico di rete. Per attivare questa modalità, aggiungi <code>i2p.vmCommSystem=true</code> a router.config prima di cominciare.
pt_br: Adicionalmente, o roteador I2P pode ser inicializado no modo rede virtual. Este modo desabilita todo o transporte, permitindo que o roteador seja testado em isolamento sem tráfego de rede. Para permitir este modo, adicione <code>i2p.vmCommSystem=true</code> ao arquivo router.config antes da inicialização.
ru: I2P можно также запускать в режиме виртуальной сети. Этот режим отключает все транспорты, позволяя тестировать маршрутизатор без сетевого доступа. Чтобы включить такой режим, добавьме <code>i2p.vmCommSystem=true</code> в router.config до запуска

source: Testing the Live I2P Network
fr: Tester le réseau I2P en direct
it: Collaudo della rete I2P live
pt_br: Efetuando testes na rede I2P existente
ru: Тестирование работающей I2P сети

source: If you are planning on conducting research on the live I2P network, please <a href="%(contact)s">contact us</a> before you commence your testing. While we do not discourage researchers from responsibly testing their ideas on the live network, if an attack becomes apparent and we don't have any line of communication then we will end up taking countermeasures which could interfere with the test.
fr: Si vous prévoyez de mener des recherches en direct sur le réseau I2P, s'il vous plaît <a href="%(contact)s">nous contacter </a> avant de commencer vos tests. Bien que nous ne nous décourageons pas les chercheurs de tester leurs idées de façon responsable sur le réseau direct, si une attaque devient apparente et que nous n'avons pas de moyen de communication, nous finirons par prendre des contre-mesures qui pourraient interférer avec le test.
it: Se stai programmando di condurre una ricerca sulla rete I2P live, <a href="%(contact)s">contattaci</a> prima di iniziare il collaudo. Sebbene non scoraggiamo i ricercatori dal mettere alla prova responsabilmente le loro idee sulla nostra rete live, se un attacco si manifesta e non disponiamo di alcuna linea di comunicazione finiremo con il prendere delle contromisure che potrebbero interferire con il collaudo.
pt_br: Se você almeja conduzir experimentos com a rede I2P corrente, por favor, <a href="%(contact)s">entre em contato conosco</a> antes de começar os seus testes. Ainda que não desencorajamos pesquisadores de, responsavelmente, experimentar suas idéias na rede existente, se um ataque em andamento parece acontecer, sem um canal de comunicação, tomaremos contramedidas que, talvez, interfiram nos testes.
ru: Если вы планируете произоводить исследования на живой I2P сети, пожалуйста, <a href="%(contact)s">свяжитесь с нами</a> заранее. Хотя мы не против ответственных исследователей, которые проверяют свои идеи на живой сети, если мы заметим вмешательство и у нас не будет способа связаться, исследование может быть испорчено применяемыми нами контр-мерами.

source: Router Family Configuration
ru: Конфигурация семейства роутеров

source: As of release 0.9.25, I2P supports a router family configuration. This provides researchers who run multiple routers with the means to publicly identify those routers. In turn, this helps the I2P project understand that these routers are not running an attack on the network. It also will prevent other routers from including multiple routers of the family in a single tunnel, which could lead to deanonymization. Routers that appear to be colluding but do not have a declared family may be assumed to be an attack on the network, and may be blocked. The best way to ensure the success of your research project is to work with us.
ru: В релизе 0.9.25, I2P поддерживает конфигурацию семейства маршрутизаторов. Это позволяет исследователям, управляющим несколькими маршрутизаторами с обозначением этого факта. В свою очередь, это поможет I2P понять что эти маршрутизаторы не участвуют в атаке на сеть. Это также предотвратит другие маршрутизаторы от включения нескольких маршрутизаторов одного семейства в один тоннель, что может повлечь деанонимизацию. Маршрутизаторы, замеченные в сговоре, но не состоящие в семействе могут быть заподозрены в атаке на сеть и заблокированы. Лучший путь к успеху вашего исследования это работа с нами.

source: A router family shares a private key so that participation in the family cannot be spoofed. To configure a router family, click on the 'I2P Internals' link in the router console, and then on the 'Family' tab. Follow the instructions there to generate the private key for the first router in the family. Then, export the key from that router, and import it to other members of the family.
ru: Семейство маршрутизаторов разделяет приватный ключ, так что участие в семействе не может быть отслежено. Для настройки семейства маршрутизаторов, нажмите ссылку 'Настройки I2P' в консоли маршрутизатора, а затем вкладку 'Семейство'. Следуйте предложенным инструкциям для генерации приватного ключа для первого маршрутизатора семейства. Затем, экспортируйте ключ с маршрутизатора и импортируйте на другие члены семьи.

source: Open research questions
fr: Questions concernant la recherche ouverte
it: Domande di ricerca aperte
pt_br: Questões de pesquisa abertas
ru: Вопросы открытые для исследования

source: Network database
fr: Base de données réseau
it: Database di rete
pt_br: Banco de dados da rede
ru: Сетевая база данных

source: Transports
it: Trasporti
pt_br: Transportes
ru: Транспорты

source: Tunnels and Destinations
fr: Tunnels et destinations
it: Tunnel e destinazioni
pt_br: Túneis e Destinos
ru: Туннели и Назначения

source: Peer selection
fr: Sélection pair
it: Selezione peer
pt_br: Seleção de pares
ru: Выбор узлов

source: Unidirectional tunnels
fr: Tunnels unidirectionnels
it: Tunnel unidirezionali
pt_br: Túneis unidirecionais
ru: Однонаправленные туннели

source: Multihoming
ru: Множественная адресация

source: Message routing
fr: Routage de message
it: Instradamento del messaggio
pt_br: Roteamento de mensagens
ru: Маршрутизация сообщений
